{
 "ms-moc-1": {
    "misconception" : "Students grasp only the first level of thinking when comparing / contrasting measures of center. (Level 1 is “process-telling”; Level 4 involves characterizing solutions when one of the three measures might be a better measure of center / typicality than another.",
    "addressed" : true,
    "proposed-solution" : [
      "Provide scenarios where students must decide which measure of center is most appropriate"
    ],
    "lessons" : [
      "measures-of-center"
    ],
    "standards": [
      "6.SPB.5 "
    ],
    "sources": [
      "groth-bergner-2006"
    ]
  },
 "ms-moc-2": {
    "misconception" : "Students understand mean computationally but not conceptually.",
    "addressed" : true,
    "proposed-solution" : [
      "Teach mean as balance point."
    ],
    "lessons" : [
      "measures-of-center"
    ],
    "standards": [
      "6.SPB.5 "
    ],
    "sources": [
      "pollatsek-et-al-1981"
    ]
  },
 "ms-moc-3": {
    "misconception" : "Many students tend to see a median or mean as a feature of an individual in the center of the group rather than as a characterization of the whole group. Students considered the median mainly as a cut point in the data and not as a measure of center.",
    "addressed" : true,
    "proposed-solution" : [
      "As a beginning point of statistical learning, it may be sufficient that students consider the median purely as a cut point (“our state score is just above the median”). However, additional instruction is necessary to foster understanding of the median as a measure of center and thus as a characteristic of the group. (p.167)"
    ],
    "lessons" : [
      "measures-of-center"
    ],
    "standards": [
      "6.SPA.3 "
    ],
    "sources": [
      "bakker-et-al-2005"
    ]
  },
 "ms-moc-4": {
    "misconception" : "Students cannot identify or compute measures of center from histograms or bar graphs, in part because they lack attention to the context of the data.",
    "addressed" : true,
    "proposed-solution" : [
      "Have students find measures of center from graphs where the raw data are completely accessible to help students understand relative positions of measures of center with respect to shape. Proposed solution: Ask students “What are the data” to redirect or jumpstart students’ thinking."
    ],
    "lessons" : [
      "measures-of-center"
    ],
    "standards": [
      "6.SPB.5 "
    ],
    "sources": [
      "cooper-shore-2008"
    ]
  },

  "ms-bp-1": {
    "misconception" : "Students often think that the median line actually represents the mean, causing misinterpretation of skewed datasets",
    "addressed" : false,
    "proposed-solution" : [
      ""
    ],
    "lessons" : [
      "box-plots"
    ],
    "standards": [
      "",  
      ""
    ],
    "sources": [
      "lem-et-al-2013"
    ]
  },
  "ms-bp-2": {
    "misconception" : "Students sometimes attempt to identify individual cases within histograms and box plots",
    "addressed?" : false,
    "proposed-solution" : [
      "have students use a combination of box plots and dot plots displayed at the same time",
      ""
    ],
    "lessons" : [
      "box-plots",
      "dot-plots"
    ],
    "standards": [
      ""
    ],
    "source": [
      "bakker-et-al-2005"
    ]
  },

  "ms-variability-1": {
    "misconception" : "Students have an oversimplified view of variability: they believe that variability can be judged based solely on the range of the data, and they think that histograms with greater variability in heights of bars indicates greater variability of the dataset.",
    "addressed" : true,
    "proposed-solution" : [
      "Instructors should explicitly discuss the concept of variability of data in general and not limit the focus to quantifying variability through common measures such as range, interquartile range, and standard deviation",
      "To gain a better understanding of how variability is represented in histograms of quantitative data, students should examine histograms of little and great variation.",
      "To facilitate understanding the connection between shape of a distribution and likely relative positions of center,instructors might consider first having students find measures of center from graphs where the raw data are completely accessible.",
      "When extracting data from graphs, students should be asked to identify the data values. Otherwise, when finding summary measures, students may revert to using memorized algorithms."
    ],
    "lessons" : [
      "histograms",
      "dot-plots"
    ],
    "standards": [
      "6.SP.B.5.c"
    ],
    "sources": [
      "cooper-2018"
    ]
  },
  "ms-variability-2": {
    "misconception" : "Variability of categorical data is often left out of the conversation, despite being more intuitive to students, Sometimes when it is introduced, students overgeneralize and think of variability as unlikeability in a variety of settings (histograms)",
    "addressed" : true,
    "proposed-solution" : [
      "Provide instruction on variability of categorical data, while emphasizing that there are multiple ways to assess variability."
    ],
    "lessons" : [
      "variability"
    ],
    "standards": [
      "6.SP.B.5.c"
    ],
    "sources": [
      "kader-2007"
    ]
  },


  "ms-histogram-v-bar": {
    "misconception": "Students  do not understand the distinction between a bar chart and a histogram, and why this distinction is important; consequently, they do not understand the different methods used to evaluate variability from these different representations.",
    "addressed": false,
    "proposed-solution": [
      "Focus on dot plots as a “bridge” representation (from bar graphs to histograms); they are easier to interpret and will not be confused with bar graphs.",
      "Integrate tech that “fuses” dots into other displays."
    ],
    "lessons": [
      ""
    ],
    "sources": [
      "kaplan-et-al-2014",
      "cooper-shore-2008"
    ]
  },
  "ms-axes-confusion": {
    "misconception": "Students use the frequency (y-axis) instead of the data values (x-axis) when reporting on variability.",
    "addressed": false,
    "proposed-solution": [
      "Discuss the concept of variability of data in general; do not limit the focus to common measures such as range, interquartile range, and standard deviation.",
      "Examine histograms of both little and great variation and discuss how distributions with the same mean and median could differ in variability."
    ],
    "lessons": [
      ""
    ],
    "sources": [
      "cooper-shore-2008"
    ]
  },
  "ms-histogram-variability": {
    "misconception": "Students believe that a flatter histogram equates to less variability in the data than a bumpy histogram.",
    "addressed": false,
    "proposed-solution": [
      "Focus on dot plots as a “bridge” representation (from bar graphs to histograms); they are easier to interpret and will not be confused with bar graphs.",
      "Integrate tech that “fuses” dots into other displays."
    ],
    "lessons": [
      ""
    ],
    "sources": [
      "kaplan-et-al-2014"
    ]
  },
  "ms-histogram-time": {
    "misconception": "Students add a time component to the variable graphed on the horizontal axis.",
    "addressed": false,
    "proposed-solution": [
      "Ensure that students can distinguish between axes on a histogram (see ms-axes-confusion)"
    ],
    "lessons": [
      ""
    ],
    "sources": [
      "kaplan-et-al-2014"
    ]
  },
  "ms-histogram-bp": {
    "misconception": "Students cannot link a histogram to a corresponding boxplot .",
    "addressed": false,
    "proposed-solution": [
      "With regard to education, we can say that, before students are confronted with both histograms and box plots to solve a certain task, it is important that they are able to correctly interpret each of these representations separately. On the other hand, however, the use of both representations together might be a fruitful way of letting students understand the merits and pitfalls of both representations, giving them a chance to construct a more coherent understanding of both representations (Lem et al, 2011, p5)."
    ],
    "lessons": [
      ""
    ],
    "sources": [
      "boels-et-al-2019",
      "lem-et-al-2011"

    ]
  }
}