{
 "ms-moc-1": {
    "misconception" : "Students grasp only the first level of thinking when comparing / contrasting measures of center. (Level 1 is “process-telling”; Level 4 involves characterizing solutions when one of the three measures might be a better measure of center / typicality than another.",
    "addressed" : true,
    "proposed-solution" : [
      "Provide scenarios where students must decide which measure of center is most appropriate"
    ],
    "lessons" : [
      "measures-of-center"
    ],
    "standards": [
      "6.SPB.5 "
    ],
    "sources": [
      "groth-bergner-2006"
    ]
  },
 "ms-moc-2": {
    "misconception" : "Students understand mean computationally but not conceptually.",
    "addressed" : true,
    "proposed-solution" : [
      "Teach mean as balance point."
    ],
    "lessons" : [
      "measures-of-center"
    ],
    "standards": [
      "6.SPB.5 "
    ],
    "sources": [
      "pollatsek-et-al-1981"
    ]
  },
 "ms-moc-3": {
    "misconception" : "Many students tend to see a median or mean as a feature of an individual in the center of the group rather than as a characterization of the whole group. Students considered the median mainly as a cut point in the data and not as a measure of center.",
    "addressed" : true,
    "proposed-solution" : [
      "As a beginning point of statistical learning, it may be sufficient that students consider the median purely as a cut point (“our state score is just above the median”). However, additional instruction is necessary to foster understanding of the median as a measure of center and thus as a characteristic of the group. (p.167)"
    ],
    "lessons" : [
      "measures-of-center"
    ],
    "standards": [
      "6.SPA.3 "
    ],
    "sources": [
      "bakker-et-al-2005"
    ]
  },
 "ms-moc-4": {
    "misconception" : "Students cannot identify or compute measures of center from histograms or bar graphs, in part because they lack attention to the context of the data.",
    "addressed" : true,
    "proposed-solution" : [
      "Have students find measures of center from graphs where the raw data are completely accessible to help students understand relative positions of measures of center with respect to shape. Proposed solution: Ask students “What are the data” to redirect or jumpstart students’ thinking."
    ],
    "lessons" : [
      "measures-of-center"
    ],
    "standards": [
      "6.SPB.5 "
    ],
    "sources": [
      "cooper-shore-2008"
    ]
  },


  "ms-bp-1": {
    "misconception" : "Students often think that the median line actually represents the mean, causing misinterpretation of skewed datasets",
    "addressed" : false,
    "proposed-solution" : [
      ""
    ],
    "lessons" : [
      "box-plots"
    ],
    "standards": [
      "",  
      ""
    ],
    "sources": [
      "lem-et-al-2013"
    ]
  },
  "ms-bp-2": {
    "misconception" : "Students sometimes attempt to identify individual cases within histograms and box plots",
    "addressed?" : false,
    "proposed-solution" : [
      "have students use a combination of box plots and dot plots displayed at the same time",
      ""
    ],
    "lessons" : [
      "box-plots"
    ],
    "standards": [
      ""
    ],
    "source": [
      "bakker-et-al-2005"
    ]
  }
}