{
  "china-flag.png" : {
        "caption" : "",
        "description" : "Chinese Flag: Red rectangle with a large yellow star in the top left corner and an arc of 4 smaller yellow stars to the right of the big star",
        "source" : "Created by the Bootstrap Team",
        "license" : "Creative Commons 4.0 - NC - SA"
  },
  "georgia-republic.gif" : {
        "caption" : "",
        "description" : "Republic of Georgia Flag: primarily white with a large red cross dividing it into 4 quadrants, each of which is a red cross in its center",
        "source" : "Created by the Bootstrap Team",
        "license" : "Creative Commons 4.0 - NC - SA"
  },
  "liberia.gif" : {
        "caption" : "",
        "description" : "Liberia Flag: 11 horizontal stripes alternating between red and white. a blue square with white star appear in the top left corner covering part of 5 stripes",
        "source" : "Created by the Bootstrap Team",
        "license" : "Creative Commons 4.0 - NC - SA"
  },
  "philippines.jpeg" : {
        "caption" : "",
        "description" : "Philippines Flag: top half is blue and bottom half is red. a white triangle coming in from the left edge with a yellow sun in its middle and a yellow star in each of its 3 corners",
        "source" : "Created by the Bootstrap Team",
        "license" : "Creative Commons 4.0 - NC - SA"
  },
  "quebec.png" : {
        "caption" : "",
        "description" : "Quebec Flag: primarily blue with a white cross splitting it into 4 quadrants, each of which has a white fleur de lis in its center",
        "source" : "Created by the Bootstrap Team",
        "license" : "Creative Commons 4.0 - NC - SA"
  },
  "s-korea.jpeg" : {
        "caption" : "",
        "description" : "South Korea Flag: primarily white with a blue & rid yin yang in the center. Each corner has a diagonally-oriented black rectangle composed of a different combination of short and mid-sized black rectangles",
        "source" : "Created by the Bootstrap Team",
        "license" : "Creative Commons 4.0 - NC - SA"
  },
  "st-vincent-and-the-grenadines.jpeg" : {
        "caption" : "",
        "description" : "St. Vincent and the Grenadines Flag: mostly yellow with a blue rectangle along the left edge and a green rectangle along the right edge. 3 green diamonds form a v in the center",
        "source" : "Created by the Bootstrap Team",
        "license" : "Creative Commons 4.0 - NC - SA"
  }
}