[
  {
    "en-us": {
      "keywords": [[ "absolute value" ]],
      "description": "the (positive) distance of a number from zero, annotated | x |"
    },
    "es-mx": {
      "keywords": [[ "valor absoluto", "modulo de un numero" ]],
      "description": "la distancia (positiva) de un número al cero, anotada | x |"
    }
  },
  {
    "en-us": {
      "keywords": [[ "accessor functions" ]],
      "description": "functions to extract values from a data structure"
    },
    "es-mx": {
      "keywords": [[ "funciones de acceso" ]],
      "description": "funciones para extraer valores de una estructura de datos"
    }
  },
    {
    "en-us": {
      "keywords": [[ "Additive Inverse Property" ]],
      "description": "Adding a number and its opposite always produces zero."
    },
    "es-mx": {
      "keywords": [[ "Propiedad inversa aditiva" ]],
      "description": "La suma de un número y su opuesto siempre produce cero."
    }
  },
  {
    "en-us": {
      "keywords": [[ "algebraic expression" ]],
      "description": "a mathematical expression that consists of numbers, operators, and variables. The variables' values are sometimes unknown. If we define variables, algebraic expressions can be simplified to a single numeric value."
    },
    "es-mx": {
      "keywords": [[ "expresión algebraica" ]],
      "description": "una expresión matemática que consta de números, operadores y variables. Los valores de las variables a veces son desconocidos. Si definimos variables, las expresiones algebraicas se pueden simplificar a un solo valor numérico."
    }
  },
  {
    "en-us": {
      "keywords": [[ "apply" ]],
      "description": "use a given function on some inputs"
    },
    "es-mx": {
      "keywords": [[ "aplicar", "applicado", "applicada" ]],
      "description": "dar argumentos a una función"
    }
  },
  {
    "en-us": {
      "keywords": [[ "argument" ]],
      "description": "the inputs to a function; the expressions for each argument follow the function name"
    },
    "es-mx": {
      "keywords": [[ "argumento" ]],
      "description": "los valores que se le dan a una función; las expresiones para los valores de cada argumento siguen el nombre de la función"
    }
  },
  {
    "en-us": {
      "keywords": [[ "arithmetic expression" ]],
      "description": "a mathematical expression that consists of numbers and operators, which does not have an equal sign. When we apply the laws of arithmetic, arithmetic expressions can be simplified to a single numeric value."
    },
    "es-mx": {
      "keywords": [[ "expresión aritmética" ]],
      "description": "una expresión matemática que consta de números y operadores, que no tiene un signo de igual. Cuando aplicamos las leyes de la aritmética, las expresiones aritméticas se pueden simplificar a un solo valor numérico."
    }
  },
  {
    "en-us": {
      "keywords": [[ "ascending" ]],
      "description": "an order in which lower values appear first, and higher values appear after"
    },
    "es-mx": {
      "keywords": [[ "ascendente" ]],
      "description": "un orden de valores en la cual los más bajos aparecen primero y los más altos aparecen después"
    }
  },
  {
    "en-us": {
      "keywords": [[ "amplitude" ]],
      "description": "the amount by which the graph of the function travels above and below its midline"
    },
    "es-mx": {
      "keywords": [[ "amplitud" ]],
      "description": "la cantidad en la que la gráfica de la función se desplaza por encima y por debajo de su línea media"
    }
  },
  {
    "en-us": {
      "keywords": [[ "Associative Property" ]],
      "description": "When adding three numbers or multiplying three numbers, it does not matter whether you start with the first pair or the last. The same is true when either adding or multiplying four numbers, five numbers, etc."
    },
    "es-mx": {
      "keywords": [[ "La propiedad asociativa", "Asociatividad" ]],
      "description": "Al sumar tres números o multiplicar tres números, no importa si comienzas con el primer par o el último. Lo mismo ocurre al sumar o multiplicar cuatro números, cinco números, etc."
    }
  },
  {
    "en-us": {
      "keywords": [[ "asymptote" ]],
      "description": "A straight line to which a curve gets closer and closer - but never touches - as one of the variables approaches infinity."
    },
    "es-mx": {
      "keywords": [[ "asíntota" ]],
      "description": "una línea recta que se aproxima continuamente a la curva de una función, pero nunca la toca conforme la curva avanza hacia el infinito en una dirección"
    }
  },
  {
    "en-us": {
      "keywords": [[ "axis", "axes" ]],
      "description": "a reference line, used to determine the position of a coordinate"
    },
    "es-mx": {
      "keywords": [[ "eje" ]],
      "description": "Una línea de referencia, que se utiliza para determinar la posición de una coordenada"
    }
  },
  {
    "en-us": {
      "keywords": [[ "axis of symmetry"]],
      "description": "a line on either side of which a line, curve, or shape is the reflection of the other"
    },
    "es-mx": {
      "keywords": [[ "eje de simetría" ]],
      "description": "una línea a cada lado de la cual una línea, curva o forma es el reflejo de la otra"
    }
  },
  {
    "en-us": {
      "keywords": [[ "bar chart" ]],
      "description": "a display of categorical data that uses bars positioned over category values; each bar's height reflects the count or percentage of data values in that category"
    },
    "es-mx": {
      "keywords": [[ "gráfico de barras" ]],
      "description": "una visualización de datos categóricos que utiliza barras colocadas sobre los valores de una categoría; la altura de cada barra refleja el número o el porcentaje de los valores en esa categoría"
    }
  },
  {
    "en-us": {
      "keywords": [[ "base" ]],
      "description": "In expressions like 9<sup>3</sup> and log<sub>2</sub>4, the 9 and 2 are called bases. They are the factors that will be multiplied by themselves the number of times indicated by the exponent or to reach the log input."
    },
    "es-mx": {
      "keywords": [[ "base" ]],
      "description": "En expresiones como 9<sup>3</sup> y log<sub>2</sub>4, el 9 y el 2 se llaman bases. Son los factores que se multiplicarán por sí mismos el número de veces indicado por el exponente o para alcanzar la entrada logarítmica."
    }
  },
  {
    "en-us": {
      "keywords": [[ "bias" ]],
      "description": "prejudice in favor of or against one outcome, person, or group compared with another, usually in a way considered to be unfair."
    },
    "es-mx": {
      "keywords": [[ "sesgo" ]],
      "description": "un peso desproporcionado a favor o en contra de una cosa, persona o grupo en comparación con otra, generalmente de una manera que se considera injusta."
    }
  },
  {
    "en-us": {
      "keywords": [[ "bin", "interval" ]],
      "description": "a range that values from a dataset can belong to; there is one bar in a histogram per bin"
    },
    "es-mx": {
      "keywords": [[ "intervalo" ]],
      "description": "un rango al que pueden pertenecer los valores de un conjunto de datos; hay una barra en un histograma por intervalo"
    }
  },
  {
    "en-us": {
      "keywords": [[ "Boolean" ]],
      "description": "a type of data with two values: true and false"
    },
    "es-mx": {
      "keywords": [[ "Booleano" ]],
      "description": "un tipo de dato con dos valores: verdadero (true) y falso (false)"
    }
  },
  {
    "en-us": {
      "keywords": [[ "box plot" ]],
      "description": "the box plot (a.k.a. box-and whisker-plot) is a way of displaying a distribution of data based on the five-number summary: minimum, first quartile, median, third quartile, and maximum"
    },
    "es-mx": {
      "keywords": [[ "diagrama de caja", "diagramas de caja" ]],
      "description": "El diagrama de caja (también conocido como diagrama de caja y bigotes) es una forma de mostrar la distribución de datos basada en el resumen de cinco números: mínimo (el valor más bajo), primer cuartil, mediana, tercer cuartil y máximo (el valor más alto)."
    }
  },
  {
    "en-us": {
      "keywords": [[ "calling", "calls" ]],
      "description": "using a function by giving it inputs"
    },
    "es-mx": {
      "keywords": [[ "llamada" ]],
      "description": "Uso de una función dándole valores"
    }
  },
  {
    "en-us": {
      "keywords": [[ "category" ]],
      "description": "unique value(s) in a categorical dataset"
    },
    "es-mx": {
      "keywords": [[ "categoría" ]],
      "description": "valores únicos en un conjunto de datos categórico"
    }
  },
  {
    "en-us": {
      "keywords": [[ "categorical data", "categorical" ]],
      "description": "data whose values are qualities that are not subject to the laws of arithmetic"
    },
    "es-mx": {
      "keywords": [[ "datos categóricos" ]],
      "description": "datos cuyos valores son cualidades que no están sujetas a las leyes de la aritmética"
    }
  },
  {
    "en-us": {
      "keywords": [[ "central tendency" ]],
      "description": "a summary measure, that attempts to describe a whole set of data with a single value that represents the middle or center of its distribution. In other words, a value that all the others tend to cluster around."
  },
    "es-mx": {
      "keywords": [[ "" ]],
      "description": ""
    }
  },{
    "en-us": {
      "keywords": [[ "circle of evaluation", "circles of evaluation" ]],
      "description": "a diagram of the structure of a mathematical expression (Bootstrap-specific)"
    },
    "es-mx": {
      "keywords": [[ "círculo de evaluación" ]],
      "description": "un diagrama de la estructura de una expresión matemática (específico de Bootstrap)"
    }
  },
  {
    "en-us": {
      "keywords": [[ "chart" ]],
      "description": "visual reprsentations of how values in a dataset are distributed"
    },
    "es-mx": {
      "keywords": [[ "gráfico" ]],
      "description": "Representacion visual de la distribución de valores en un conjunto de datos."
    }
  },
  {
    "en-us": {
      "keywords": [[ "clause" ]],
      "description": "a question and its corresponding answer in a conditional expression"
    },
    "es-mx": {
      "keywords": [[ "cláusula" ]],
      "description": "una pregunta y su correspondiente respuesta en una expresión condicional"
    }
  },
  {
    "en-us": {
      "keywords": [[ "column" ]],
      "description": "set of values in a table of a particular type.  Every row has exactly 1 element in every column"
    },
    "es-mx": {
      "keywords": [[ "columna" ]],
      "description": "conjunto particular de valores en una tabla. Cada fila tiene exactamente 1 elemento en cada columna."
    }
  },
  {
    "en-us": {
      "keywords": [[ "combination" ]],
      "description": "the number of possible arrangements in a collection of items where the order of the selection does NOT matter. (ABC and CBA would be considered the same combination.)"
    },
    "es-mx": {
      "keywords": [[ "combinación" ]],
      "description": "el número de arreglos posibles con los elementos de un conjunto, donde el orden de los elementos usados NO importa. (ABC y CBA se consideran la misma combinación.)"
    }
  },
  {
    "en-us": {
      "keywords": [[ "comments", "comment" ]],
      "description": "messages in the code, generally ignored by the computer, to help people interacting with the code understand what it is doing"
    },
    "es-mx": {
      "keywords": [[ "comentarios de código" ]],
      "description": "anotaciones en el código que facilitan nuestra comprensión de lo que el código intenta hacer; la computadora no los lee"
    }
  },
  {
    "en-us": {
      "keywords": [[ "Commutative Property" ]],
      "description": "For any expression involving only addition or only multiplication, changing the order of the numbers will not change the result."
    },
    "es-mx": {
      "keywords": [[ "Conmutatividad", "propiedad conmutativa" ]],
      "description": "Para cualquier expresión que involucre solo suma o solo multiplicación, cambiar el orden de los números no cambiará el resultado"
    }
  },
  {
    "en-us": {
      "keywords": [[ "compound inequality", "compound inequalities" ]],
      "description": "an inequality that combines two simple inequalities using <i>and</i> or <i>or</i>"
    },
    "es-mx": {
      "keywords": [[ "desigualdad compuesta" ]],
      "description": "una desigualdad que combina dos desigualdades simples con <i>o</i> o <i>y</i>"
    }
  },
  {
    "en-us": {
      "keywords": [[ "conditional" ]],
      "description": "an expression containing a list of boolean-producing \"questions\" (known as conditions), along with code to run if each condition is met"
    },
    "es-mx": {
      "keywords": [[ "condicional" ]],
      "description": "una expresión de código compuesta de preguntas y respuestas"
    }
  },
  {
    "en-us": {
      "keywords": [[ "confounding variable" ]],
      "description": "an unaccounted-for variable that influences both of the variables being analyzed and confuses the interpretation of the relationship between them"
    },
    "es-mx": {
      "keywords": [[ "factor de confusión" ]],
      "description": "una variable no contabilizada que influye en la relación entre las variables que se analizan"
    }
  },
  {
    "en-us": {
      "keywords": [[ "constructor" ]],
      "description": "a function that creates instances of a data structure"
    },
    "es-mx": {
      "keywords": [[ "constructor" ]],
      "description": "la función que crea instancias de una estructura"
    }
  },
  {
    "en-us": {
      "keywords": [[ "continuous" ]],
      "description": "\"Uninterrupted\". On a graph, continuous functions appear as an unbroken curve. Some functions are continuous everywhere, while others may only be continuous over a specific interval."
    },
    "es-mx": {
      "keywords": [[ "continua" ]],
      "description": "\"Ininterrumpido\". En una gráfica, las funciones continuas aparecen como una curva ininterrumpida. Algunas funciones son continuas en todas partes, mientras que otras pueden ser continuas sólo durante un intervalo específico."
    }
  },
  {
    "en-us": {
      "keywords": [[ "contract" ]],
      "description": "a statement of the name, domain, and range of a function (Bootstrap-specific)"
    },
    "es-mx": {
      "keywords": [[ "contrato" ]],
      "description": "una declaración con nombre, dominio y rango de una función (Específico de Bootstrap)"
    }
  },
  {
    "en-us": {
      "keywords": [[ "contract error" ]],
      "description": "errors where the code makes sense, but uses a function with the wrong number or type of arguments (Bootstrap-specific)"
    },
    "es-mx": {
      "keywords": [[ "error de contrato" ]],
      "description": "errores donde el código tiene sentido, pero usa una función con el número o tipo de argumentos incorrectos (Específico de Bootstrap)"
    }
  },
  {
    "en-us": {
      "keywords": [[ "convenience sample", "convenience sampling" ]],
      "description": "a method of collecting data whereby the individuals in the sample are selected not because they are most representative of the entire population, but because they are most easily accessible"
    },
    "es-mx": {
      "keywords": [[ "muestreo por conveniencia" ]],
      "description": "una modalidad de selección de una muestra estadística por la cual el investigador elige aquellos sujetos a los que tiene mayor facilidad de acceso."
    }
  },
  {
    "en-us": {
      "keywords": [[ "coordinate" ]],
      "description": "a number describing an object's location"
    },
    "es-mx": {
      "keywords": [[ "coordenada" ]],
      "description": "un número que describe la ubicación de un objeto"
    }
  },
  {
    "en-us": {
      "keywords": [[ "coordinate pair" ]],
      "description": "a set of numbers describing an object's location on the coordinate plane"
    },
    "es-mx": {
      "keywords": [[ "par ordenado" ]],
      "description": "conjunto de números que describen la ubicación de un objeto relacionándola con el eje-x (el primer valor del par ordenado) y con el eje-y (el segundo valor del par ordenado)"
    }
  },
  {
    "en-us": {
      "keywords": [[ "coordinate plane" ]],
      "description": "a grid formed by a pair of intersecting horizontal and vertical number lines"
    },
    "es-mx": {
      "keywords": [[ "plano de coordinadas", "plano cartesiano" ]],
      "description": "una cuadrícula formada por un par de rectas numéricas horizontales y verticales que se cruzan"
    }
  },
  {
    "en-us": {
      "keywords": [[ "correlation", "correlated"]],
      "description": "the degree to which knowing the value of an <i>explanatory</i> variable helps us predict the value of another, <i>response</i>, variable"
    },
    "es-mx": {
      "keywords": [[ "correlación" ]],
      "description": "El grado en que conocer el valor de una variable explicativa nos ayuda a predecir el valor de la otra variable (de respuesta)."
    }
  },
  {
    "en-us": {
      "keywords": [[ "data" ]],
      "description": "pieces of information about a group of individuals or things"
    },
    "es-mx": {
      "keywords": [[ "datos" ]],
      "description": "Piezas de información sobre un grupo de individuos o cosas."
    }
  },
  {
    "en-us": {
      "keywords": [[ "data block" ]],
      "description": "code that lists the name, constructor(s), and field(s) of a data structure"
    },
    "es-mx": {
      "keywords": [[ "bloque de datos" ]],
      "description": "código que enumera el nombre, los constructores y los elementos de una estructura de datos"
    }
  },
  {
    "en-us": {
      "keywords": [[ "data row", "cases", "row" ]],
      "description": "a structured piece of data in a dataset that typically reports all the information gathered about a given individual"
    },
    "es-mx": {
      "keywords": [[ "fila de datos", "casos" ]],
      "description": "un conjunto de datos estructurados que usualmente representa toda la información recopilada sobre un individuo particular"
    }
  },
  {
    "en-us": {
      "keywords": [[ "data science" ]],
      "description": "the science of collecting, organizing, and drawing general conclusions from data, with the help of computers"
    },
    "es-mx": {
      "keywords": [[ "ciencia de datos" ]],
      "description": "la ciencia de recopilar, organizar y extraer conclusiones generales a partir de datos, con la ayuda de computadoras"
    }
  },
  {
    "en-us": {
      "keywords": [[ "dataset" ]],
      "description": "a collection of related information that is composed of separate elements, but can be manipulated as a unit by a computer"
    },
    "es-mx": {
      "keywords": [[ "conjunto de datos" ]],
      "description": "una colección de información relacionada que se compone de elementos separados, pero que una computadora puede manipular como una unidad"
    }
  },
  {
    "en-us": {
      "keywords": [[ "data structure" ]],
      "description": "a 'container' data type, which has fields that can hold other data (e.g. - a 'coordinate' is a data structure holding number fields x and y)"
    },
    "es-mx": {
      "keywords": [[ "estructura de datos", "estructuras de datos" ]],
      "description": "un tipo de dato con campos que pueden contener otros datos (por ejemplo, una 'coordenada' es una estructura de datos que contiene los campos numéricos <b>x</b> y <b>y</b>)"
    }
  },
  {
    "en-us": {
      "keywords": [[ "data type" ]],
      "description": "a way of classifying values, such as: Number, String, Image, Boolean, or any user-defined data structure"
    },
    "es-mx": {
      "keywords": [[ "tipo de datos", "tipos de datos" ]],
      "description": "Una manera de clasificar valores, como: Número, Cadena, Imagen, Booleano o cualquier estructura de datos definida por el usuario"
    }
  },
  {
    "en-us": {
      "keywords": [[ "debug" ]],
      "description": "to find and fix errors in one's code"
    },
    "es-mx": {
      "keywords": [[ "depurar" ]],
      "description": "encontrar y corregir errores en el código"
    }
  },
  {
    "en-us": {
      "keywords": [[ "decay rate" ]],
      "description": "the percentage each term in an exponential sequence shrinks by to get the next term"},
    "es-mx": {
      "keywords": [[ "tasa de decaimiento" ]],
      "description": "el porcentaje en el que cada término en una secuencia exponencial se reduce para obtener el siguiente término"
    }
  },
  {
    "en-us": {
      "keywords": [[ "define" ]],
      "description": "to associate a descriptive name with a value"
    },
    "es-mx": {
      "keywords": [[ "definir" ]],
      "description": "asociar un nombre descriptivo con un valor"
    }
  },
  {
    "en-us": {
      "keywords": [[ "definitions area" ]],
      "description": "the left-most text box in the Editor where definitions for values and functions are written (Bootstrap-specific)"
    },
    "es-mx": {
      "keywords": [[ "área de definiciones" ]],
      "description": "el cuadro de texto en el editor, donde se definen valores y funciones (Específico de Bootstrap)"
    }
  },
  {
    "en-us": {
      "keywords": [[ "dependent variable", "dependent"]],
      "description": "When modeling a relationship between an input and an output (e.g. - distance over time), we are curious about how a change in the input (typically graphed on the x-axis) impacts the output (y). When the output is entirely dependent on the input, we refer to the output as the \"dependent variable\"." },
    "es-mx": {
      "keywords": [[ "variable dependiente" ]],
      "description": "Al modelar una relación entre una entrada y una salida (p. ej., la distancia en el tiempo), tenemos curiosidad acerca de cómo un cambio en la entrada (típicamente representado en el eje x) impacta la salida (y). Cuando la salida depende completamente de la entrada, nos referimos a la salida como la \"variable dependiente\"."
    }
  },
  {
    "en-us": {
      "keywords": [[ "descending" ]],
      "description": "an order in which higher values appear first, and lower values appear after"
    },
    "es-mx": {
      "keywords": [[ "descendiente" ]],
      "description": "conjunto de valores ordenados de mayor a menor"
    }
  },
  {
    "en-us": {
      "keywords": [[ "design recipe" ]],
      "description": "a sequence of steps that helps people document, test, and write functions (Bootstrap-specific)"
    },
    "es-mx": {
      "keywords": [[ "receta de diseño" ]],
      "description": "una secuencia de pasos que ayuda a las personas a documentar, probar y escribir funciones (Específico de Bootstrap)"
    }
  },
  {
    "en-us": {
      "keywords": [[ "dimension" ]],
      "description": "a measurement of something in a particular direction, especially height, length, or width. The dimensions of a computer screen, for example, are given as width x height."
    },
    "es-mx": {
      "keywords": [[ "dimensión" ]],
      "description": "una medida de algo en una dirección particular, especialmente su altura, largo o ancho"
    }
  },
  {
    "en-us": {
      "keywords": [[ "direction" ]],
      "description": "the aspect of a linear relationship that tells if the line relating the two variables is sloping up or down"
    },
    "es-mx": {
      "keywords": [[ "dirección" ]],
      "description": "el aspecto de una relación lineal que indica si la línea que relaciona las dos variables tiene pendiente hacia arriba o hacia abajo."
    }
  },
  {
    "en-us": {
      "keywords": [[ "distribution" ]],
      "description": "a description of the relative frequencies that different quantities occur in a sample"
    },
    "es-mx": {
      "keywords": [[ "distribución" ]],
      "description": "una descripción del número de veces o probabilidades relativas de que diferentes cantidades ocurran en una muestra"
    }
  },
  {
    "en-us": {
      "keywords": [[ "Distributive Property" ]],
      "description": "Multiplying the sum of two addends by a number produces the same result as multiplying each addend by that number and then adding the products."
    },
    "es-mx": {
      "keywords": [[ "distributividad", "Propiedad distributiva" ]],
      "description": "Multiplicar la suma de dos sumandos por un número produce el mismo resultado que multiplicar cada sumando por ese número y luego sumar los productos."
    }
  },
  {
    "en-us": {
      "keywords": [[ "domain" ]],
      "description": "the type or set of inputs a function expects, i.e., the independent variable(s) that govern the output of the function"
    },
    "es-mx": {
      "keywords": [[ "dominio" ]],
      "description": "el tipo de input que requiere una función"
    }
  },
  {
    "en-us": {
      "keywords": [[ "dot accessor" ]],
      "description": "a way to extract the values of fields an instance"
    },
    "es-mx": {
      "keywords": [[ "punto-accesor" ]],
      "description": "Una manera de extraer valores de una estructura de datos"
    }
  },
  {
    "en-us": {
      "keywords": [[ "driver" ]],
      "description": "in pair programming, the person who is doing the typing, as directed by the navigator"
    },
    "es-mx": {
      "keywords": [[ "conductora" ]],
      "description": "en programación en pareja, la persona al teclado que sigue las indicaciones de la navegadora"
    }
  },
  {
    "en-us": {
      "keywords": [[ "edge" ]],
      "description": "a line segment on a solid figure, where two faces meet"
    },
    "es-mx": {
      "keywords": [[ "borde" ]],
      "description": "un segmento de recta en una figura tridimensional, donde dos caras se encuentran"
    }
  },
  {
    "en-us": {
      "keywords": [[ "editor" ]],
      "description": "software in which code can be written and evaluated"
    },
    "es-mx": {
      "keywords": [[ "editor" ]],
      "description": "software en el que se puede escribir y evaluar código"
    }
  },
  {
    "en-us": {
      "keywords": [[ "entry" ]],
      "description": "a single value in a table, belonging to a particular row and column"
    },
    "es-mx": {
      "keywords": [[ "dato" ]],
      "description": "un solo valor en una tabla, que pertenece a una fila y columna en particular"
    }
  },
  {
    "en-us": {
      "keywords": [[ "equation" ]],
      "description": "a statement that two expressions are equal"
    },
    "es-mx": {
      "keywords": [[ "ecuación" ]],
      "description": "una afirmación de que dos expresiones son iguales"
    }
  },
  {
    "en-us": {
      "keywords": [[ "equivalent" ]],
      "description": "expressions are equivalent when they simplify to the same value, no matter what value is assigned to their variables (if there are any)"
    },
    "es-mx": {
      "keywords": [[ "equivalente" ]],
      "description": "las expresiones son equivalentes cuando se simplifican al mismo valor, sin importar el valor que se asigne a sus variables (si las hay)"
    }
  },
  {
    "en-us": {
      "keywords": [[ "error message" ]],
      "description": "information from the computer about errors in code"
    },
    "es-mx": {
      "keywords": [[ "mensaje de error", "mensajes de error" ]],
      "description": "información que provee la computadora sobre errores en el Código"
    }
  },
  {
    "en-us": {
      "keywords": [[ "evaluate" ]],
      "description": "perform the computation in an expression, producing an answer"
    },
    "es-mx": {
      "keywords": [[ "evaluar" ]],
      "description": "realizar los cálculos para obtener el valor de una expression"
    }
  },
  {
    "en-us": {
      "keywords": [[ "event" ]],
      "description": "something that happens outside of a running program, which the program can respond to"
    },
    "es-mx": {
      "keywords": [[ "eventos" ]],
      "description": "algo que sucede fuera de un programa en ejecución, al que el programa puede responder"
    }
  },
  {
    "en-us": {
      "keywords": [[ "event-based programming" ]],
      "description": "a style of programming in which every functions are written to respond to mouse-clicks, keypresses, etc."
    },
    "es-mx": {
      "keywords": [[ "programacion basada en eventos" ]],
      "description": "un estilo de programación en el que se escriben todas las funciones para responder a los clics del ratón, pulsaciones de teclas, etc."
    }
  },
  {
    "en-us": {
      "keywords": [[ "example" ]],
      "description": "shows the use of a function on specific inputs and the computation the function should perform on those inputs"
    },
    "es-mx": {
      "keywords": [[ "ejemplos" ]],
      "description": "muestran el uso de una función con argumentos específicos y el cálculo que debe realizar la función con esos argumentos"
    }
  },
  {
    "en-us": {
      "keywords": [[ "examples block" ]],
      "description": "code that lists examples"
    },
    "es-mx": {
      "keywords": [[ "bloque de ejemplos" ]],
      "description": "código que enumera ejemplos"
    }
  },
  {
    "en-us": {
      "keywords": [[ "explanatory variable", "explanatory" ]],
      "description": "When modeling a possible relationship between an input and an output (e.g. - height and age), we are curious about how a change in the input (typically graphed on the x-axis of a scatter plot) might \"explain\" the output (y). When the behavior of the output may be explained by the input, we refer to the input as the \"explanatory variable\"." 
    },
    "es-mx": {
      "keywords": [[ "variable explicativa" ]],
      "description": "cualquier factor que pueda influir en la variable de respuesta, generalmente representada en el eje x de un diagrama de dispersión."
    }
  },
  {
    "en-us": {
      "keywords": [[ "exponent" ]],
      "description": "In expressions like 9<sup>3</sup> and 7<sup>2</sup>, the 3 and the 2 are called exponents. They tell you how many times to multiply the base times itself. For example, 9<sup>3</sup> = 9 × 9 × 9 and 7<sup>2</sup> = 7 × 7."
    },
    "es-mx": {
      "keywords": [[ "exponente", "potencia" ]],
      "description": "En expresiones como 9<sup>3</sup> y 7<sup>2</sup>, el 3 y el 2 se llaman exponentes. Ellos indican cuántas veces debemos multiplicar la base por sí misma. Por ejemplo, 9<sup>3</sup> = 9 × 9 × 9 y 7<sup>2</sup> = 7 × 7."
    }
  },
  {
    "en-us": {
      "keywords": [[ "exponential decay" ]],
      "description": "A sequence in which each number is multiplied by a constant amount - less than one - to produce the next, causing the sequence to decay rapidly at first and then slow to smaller and smaller reductions"
    },
    "es-mx": {
      "keywords": [[ "decaimiento exponencial" ]],
      "description": "Una secuencia en la que cada número se multiplica por una cantidad constante (menor que uno) para producir el siguiente, lo que hace que la secuencia decaiga rápidamente al principio y luego se lentifique a reducciones cada vez más pequeñas."
    }
  },
  {
    "en-us": {
      "keywords": [[ "exponential growth" ]],
      "description": "A sequence in which each number is multiplied by a constant amount - greater than one - to produce the next, causing the sequence to grow slowly at first and then switch to rapidly-accelerating increases"
    },
    "es-mx": {
      "keywords": [[ "crecimiento exponencial" ]],
      "description": "Una secuencia en la que cada número se multiplica por una cantidad constante (mayor que uno) para producir el siguiente, lo que hace que la secuencia crezca lentamente al principio y luego cambie a aumentos que se aceleran rápidamente." 
    }
  },
  {
    "en-us": {
      "keywords": [[ "exponential relationship", "exponential function", "exponential model" ]],
      "description": "A mathematical relation between two variables x and y, in which the dominant term is raised to the power of x, and the y-values grow by a constant factor over equal intervals in the x-values. When graphed, an exponential relationship appears as a 'hockey stick' curve (sloping up or down). Exponential functions occur widely in the natural and social sciences, as in a self-reproducing population or a fund accruing compound interest."
    },
    "es-mx": {
      "keywords": [[ "función exponencial" ]],
      "description": "Una relación matemática entre dos variables, xey, en la que el término dominante se eleva a la potencia de x, y los valores de y aumentan en un factor constante en intervalos iguales en los valores de x. Cuando se representa gráficamente, una relación exponencial aparece como una curva de 'palo de hockey' (con pendiente hacia arriba o hacia abajo). Las funciones exponenciales ocurren ampliamente en las ciencias naturales y sociales, como en una población que se reproduce a sí misma o en un fondo que acumula interés compuesto." 
    }
  },
  {
    "en-us": {
      "keywords": [[ "expression" ]],
      "description": "a computation written in the rules of some language (such as arithmetic, code, or a Circle of Evaluation)"
    },
    "es-mx": {
      "keywords": [[ "expresión" ]],
      "description": "un cálculo escrito en las reglas de algún lenguaje (como aritmética, código o un Círculo de Evaluación)"
    }
  },
  {
    "en-us": {
      "keywords": [[ "extend" ]],
      "description": "a table query that creates a table with new column(s), whose entries are computed with an expression"
    },
    "es-mx": {
      "keywords": [[ "extender" ]],
      "description": "una consulta de tabla que crea una tabla con nuevas columnas, cuyas entradas se calculan con una expresión"
    }
  },
  {
    "en-us": {
      "keywords": [[ "extract" ]],
      "description": "to construct a list using data from a particular column in a table"
    },
    "es-mx": {
      "keywords": [[ "extraer" ]],
      "description": "construir una lista de datos de una columna particular"
    }
  },
  {
    "en-us": {
      "keywords": [[ "face" ]],
      "description": "the flat surfaces on the outside of a solid figure"
    },
    "es-mx": {
      "keywords": [[ "cara" ]],
      "description": "las superficies planas en el exterior de una figura sólida"
    }
  },
  {
    "en-us": {
      "keywords": [[ "field" ]],
      "description": "a part of a data structure that has a name and holds a single value of a specified data type"
    },
    "es-mx": {
      "keywords": [[ "campo" ]],
      "description": "una parte de una estructura de datos que tiene un nombre y contiene un solo valor de un tipo específico"
    }
  },
  {
    "en-us": {
      "keywords": [[ "form" ]],
      "description": "the shape of a relationship between two quantitative variables: whether the two variables together vary linearly or in some other way"
    },
    "es-mx": {
      "keywords": [[ "forma" ]],
      "description": "la forma de una relación entre dos variables cuantitativas: si los dos variables varían juntas linealmente o de alguna otra manera"
    }
  },
  {
    "en-us": {
      "keywords": [[ "frequency table" ]],
      "description": ""
    },
    "es-mx": {
      "keywords": [[ "tabla de frecuencias" ]],
      "description": "una forma de resumir datos mostrando con qué frecuencia aparecen valores o categorías específicas en un conjunto de datos"
    }
  },
  {
    "en-us": {
      "keywords": [[ "function" ]],
      "description": "a relation from a set of inputs to a set of possible outputs, where each input is related to exactly one output"
    },
    "es-mx": {
      "keywords": [[ "función" ]],
      "description": "una relación que consume argumentos y produce un resultado"
    }
  },
  {
    "en-us": {
      "keywords": [[ "function block" ]],
      "description": "code that names a function, lists its variables, and states the expression to compute when the function is used"
    },
    "es-mx": {
      "keywords": [[ "bloque de función" ]],
      "description": "código que denomina la función, clasifica sus variables, y propone la expresión a evaluar cuando se utiliza la función"
    }
  },
  {
    "en-us": {
      "keywords": [[ "function composition" ]],
      "description": "the act of connecting two or more functions so that they work together to produce the desired outcome. The output (\"range\") of one function is used as the input (\"domain\") of the next."
    },
    "es-mx": {
      "keywords": [[ "composición de funciones" ]],
      "description": "el acto de conectar dos o más funciones para que trabajen juntas para producir el resultado deseado. La salida (\"rango\") de una función se utiliza como entrada (\"dominio\") de la siguiente."    }
  },
  {
    "en-us": {
      "keywords": [[ "function definition", "definition" ]],
      "description": "code that names a function, lists its variables, and states the expression to compute when the function is used"
    },
    "es-mx": {
      "keywords": [[ "definición de función" ]],
      "description": "que designa una función, enumera sus variables e indica la expresión a evaluar cuando se utiliza la función"
    }
  },
  {
    "en-us": {
      "keywords": [[ "function notation" ]],
      "description": "a standard way to denote functions, beginning with a function name, such as <i>f</i> or <i>gt</i>, the variable(s) the function takes in, such as <i>x</i> or <i>size</i>, and a definition of what the function does using a formula in terms of the variable. For example, f(x) = x + 1 takes in a number and adds 1."
    },
    "es-mx": {
      "keywords": [[ "notación de funciones" ]],
      "description": "una manera en la que una función puede ser representada usando símbolos y signos"
    }
  },
  {
    "en-us": {
      "keywords": [[ "frequency" ]],
      "description": "how often a particular value appears in a dataset"
    },
    "es-mx": {
      "keywords": [[ "frecuencia" ]],
      "description": "el número de veces que aparece un valor particular en un conjunto de datos"
    }
  },
  {
    "en-us": {
      "keywords": [[ "graph" ]],
      "description": "a diagram (such as a series of one or more points, lines, line segments, curves, or areas) that describes how one variable changes as the value of another (independent) variable changes."
    },
    "es-mx": {
      "keywords": [[ "gráfico" ]],
      "description": "la representación en un plano de coordenadas de los pares ordenados, líneas, curvas o áreas que describen la relación entre dos variables"
    }
  },
  {
    "en-us": {
      "keywords": [[ "grouped sample" ]],
      "description": "a non-random subset of individuals chosen from a larger set, where the individuals belong to a specific group"
    },
    "es-mx": {
      "keywords": [[ "muestra agrupada" ]],
      "description": "un subconjunto no aleatorio de individuos elegidos de un conjunto de datos más grande, donde los individuos pertenecen a un grupo específico"
    }
  },
  {
    "en-us": {
      "keywords": [[ "growth factor", "decay factor"]],
      "description": "the amount each term in an exponential sequence is multiplied by to get the next term (either 1 plus the growth rate or 1 minus the decay rate)"
    },
    "es-mx": {
      "keywords": [[ "factor de crecimiento" ]],
      "description": "la cantidad por la que se multiplica cada término en una secuencia exponencial para obtener el siguiente término (ya sea 1 más la tasa de crecimiento o 1 menos la tasa de decaimiento)"
    }
  },
  {
    "en-us": {
      "keywords": [[ "growth rate", "decay rate"]],
      "description": "the percentage each term in an exponential sequence grows or shrinks by to get the next term"
    },
    "es-mx": {
      "keywords": [[ "tasa de crecimiento" ]],
      "description": "el porcentaje en el que crece cada término en una secuencia exponencial para obtener el siguiente término"
    }
  },
  {
    "en-us": {
      "keywords": [[ "handler" ]],
      "description": "Connects an event (like a tick or keypress) and a function within a reactor"
    },
    "es-mx": {
      "keywords": [[ "manejador" ]],
      "description": "Conecta un evento (como un tic o pulsación de tecla) y una función dentro de un reactor"
    }
  },
  {
    "en-us": {
      "keywords": [[ "header row", "header" ]],
      "description": "the titles of each column of a table, usually shown at the top"
    },
    "es-mx": {
      "keywords": [[ "encabezado" ]],
      "description": "los titulos de las columnas en una tabla de datos, que generalmente se muestran en la parte superior"
    }
  },
  {
    "en-us": {
      "keywords": [[ "helper function" ]],
      "description": "a small function that handles a specific part of another computation, and gets called from other functions"
    },
    "es-mx": {
      "keywords": [[ "función auxiliar" ]],
      "description": "Una función invocada desde otras funciones con el propósito de realizar una tarea concreta requerida por éstas"
    }
  },
  {
    "en-us": {
      "keywords": [[ "histogram" ]],
      "description": "a display of quantitative data that uses vertical bars positioned over bins (or 'intervals'); each bar's height reflects the count of values in that bin."
    },
    "es-mx": {
      "keywords": [[ "histograma" ]],
      "description": "Un gráfico de barras de frecuencia especial en el que cada barra cuenta la frecuencia de los valores que aparecen en un cierto intervalo."
    }
  },
  {
    "en-us": {
      "keywords": [[ "horizontal axis", "x-axis" ]],
      "description": "axis on a coordinate plane that runs from left to right"
    },
    "es-mx": {
      "keywords": [[ "eje horizontal" ]],
      "description": "eje en un diagrama de dispersión que va de izquierda a derecha"
    }
  },
  {
    "en-us": {
      "keywords": [[ "horizontal shift", "phase shift" ]],
      "description": "the amount that the graph of a function is shifted to the right (positive) or left (negative)"
    },
    "es-mx": {
      "keywords": [[ "desplazamiento horizontalmente" ]],
      "description": "la cantidad que la gráfica de una función se desplaza hacia la derecha (positiva) o hacia la izquierda (negativa)"
    }
  },
  {
    "en-us": {
      "keywords": [[ "hypotenuse" ]],
      "description": "the side opposite the 90-degree angle in a right triangle"
    },
    "es-mx": {
      "keywords": [[ "hipotenusa" ]],
      "description": "el lado opuesto al ángulo de 90 grados en un triángulo rectángulo"
    }
  },
  {
    "en-us": {
      "keywords": [[ "identifier column" ]],
      "description": "a column of unique values which identify all the individual rows (e.g. - student IDs, SSNs, etc)"
    },
    "es-mx": {
      "keywords": [[ "columna de identificador" ]],
      "description": "una columna de valores únicos, que identifican todas las filas (por ejemplo - número de passaporte, número de estudiante, etc.)"
    }
  },
  {
    "en-us": {
      "keywords": [[ "Identity Property" ]],
      "description": "Multiplying or dividing an expression by 1 does not change its value; similarly, adding or subtracting 0 results in the original value."
    },
    "es-mx": {
      "keywords": [[ "identidad", "Propiedad de identidad" ]],
      "description": "Multiplicar o dividir una expresión por 1 no cambia su valor; de manera similar, sumar o restar 0 da como resultado el mismo valor."
    }
  },
  {
    "en-us": {
      "keywords": [[ "image" ]],
      "description": "a type of data for pictures"
    },
    "es-mx": {
      "keywords": [[ "imagen" ]],
      "description": "un tipo de datos para representaciones visuales"
    }
  },
  {
    "en-us":{
      "keywords": [[ "independent variable", "independent"]],
      "description": "When modeling a relationship between an input and an output (e.g. - distance over time), we are curious about how a change in the input (typically graphed on the x-axis) impacts the output (y). When the output is entirely dependent on the input, we refer to the input as the \"independent variable\"." 
    },
    "es-mx": {
      "keywords": [[ "la variable independiente" ]],
      "description": "Al modelar una relación entre una entrada y una salida (p. ej., distancia en el tiempo), tenemos curiosidad acerca de cómo un cambio en la entrada (típicamente graficado en el eje x) impacta la salida (y). Cuando la salida depende completamente de la entrada, nos referimos a la entrada como la \"variable independiente\"."
    }
  },
  {
    "en-us": {
      "keywords": [[ "inequality" ]],
      "description": "a mathematical description of the relationship between two variables or quantities, in which they are not necessarily equal"
    },
    "es-mx": {
      "keywords": [[ "desigualdad" ]],
      "description": "una afirmación que dos expresiones o valores no son iguales. hay varios símbolos de desigualdad que incluyen: desigual ≠, mayor que >, menor que <, menor o igual que ≤, mayor o igual que ≥"
    }
  },
  {
    "en-us": {
      "keywords": [[ "instance" ]],
      "description": "a specific example of a data structure, with specific values for each field (e.g. - (4,5) is an instance of an (x,y) coordinate"
    },
    "es-mx": {
      "keywords": [[ "instancia" ]],
      "description": "un ejemplo específico de una estructura de datos, con valores específicos para cada campo (por ejemplo, (4,5) es una instancia de una coordenada (x,y))"
    }
  },
  {
    "en-us": {
      "keywords": [[ "interactions area" ]],
      "description": "the right-most text box in the Editor, where expressions are entered to be evaluated (Bootstrap-specific)"
    },
    "es-mx": {
      "keywords": [[ "área de interacciones" ]],
      "description": "el cuadro de texto a la derecha en el Editor, donde se ingresan las expresiones para ser evaluadas (Específico de Bootstrap)"
    }
  },
  {
    "en-us": {
      "keywords": [[ "interquartile range", "IQR" ]],
      "description": "(IQR) is the range of the middle 50% of the data. This measure of spread is found by dividing a dataset into four parts. The values that divide each part are called the first quartile (Q1), the median, and third quartile (Q3). IQR is calculated as Q3 minus Q1."
    },
    "es-mx": {
      "keywords": [[ "rango intercuartil", "IQR" ]],
      "description": "Posible medida de dispersión que está basada en la división de un conjunto de datos en cuatro partes. Los valores que dividen cada parte se denominan primer cuartil (Q1), mediana y tercer cuartil (Q3). IQR se calcula como Q3 menos Q1."
    }
  },
  {
    "en-us": {
      "keywords": [[ "intersection" ]],
      "description": "the set of values that makes both inequalities true"
    },
    "es-mx": {
      "keywords": [[ "intersección" ]],
      "description": "el conjunto de valores que hace que ambas desigualdades sean verdaderas"
    }
  },
  {
    "en-us": {
      "keywords": [[ "legal expression" ]],
      "description": "code that follows the Code Rules for a language"
    },
    "es-mx": {
      "keywords": [[ "expresión legal" ]],
      "description": "expresión que sigue las Reglas de Código para un lenguaje de programación"
    }
  },
  {
    "en-us": {
      "keywords": [[ "library" ]],
      "description": "a file containing definitions (functions, values, etc) that can be imported into another program"
    },
    "es-mx": {
      "keywords": [[ "biblioteca" ]],
      "description": "un archivo que contiene definiciones (funciones, valores, etc.) que se pueden importar a otro programa"
    }
  },
  {
    "en-us": {
      "keywords": [[ "line" ]],
      "description": "an infinite collection of points forming a straight one-dimensional figure having no thickness and extending infinitely in both directions"
    },
    "es-mx": {
      "keywords": [[ "línea" ]],
      "description": "una colección infinita de datos que forman una figura recta unidimensional que no tiene espesor y se extiende infinitamente en ambas direcciones"
    }
  },
  {
    "en-us": {
      "keywords": [[ "line graph", "line chart", "line plot" ]],
      "description": "commonly drawn to show information that changes over time, by drawing continuous lines between data points"
    },
    "es-mx": {
      "keywords": [[ "gráfico de líneas", "diagrama de líneas" ]],
      "description": "se dibuja comúnmente para mostrar la evolución de unos datos a lo largo del tiempo."
    }
  },
  {
    "en-us": {
      "keywords": [[ "linear relationship", "linear", "linear function", "linear model" ]],
      "description": "a mathematical relation between two quantitative variables x and y such that y changes by a constant amount (the slope) for every unit increase in x. When graphed, a linear relationship appears as a straight line (sloping up or down)."
    },
    "es-mx": {
      "keywords": [[ "lineal", "relación lineal" ]],
      "description": "Una relación matemática entre dos variables cuantitativas xey tal que y cambia en una cantidad constante (la pendiente) por cada unidad de aumento en x. Cuando se representa gráficamente, una relación lineal aparece como una línea recta (con pendiente hacia arriba o hacia abajo)."
    }
  },
  {
    "en-us": {
      "keywords": [[ "linear regression" ]],
      "description": "a type of analysis that models the relationship between two quantitative variables. The result is known as a regression line, or line of best fit."
    },
    "es-mx": {
      "keywords": [[ "regresión lineal" ]],
      "description": "un tipo de análisis que modela la relación entre dos variables cuantitativas. El resultado se conoce como línea de regresión o línea de mejor ajuste"
    }
  },
  {
    "en-us": {
      "keywords": [[ "line of best fit", "lines of best fit", "regression line", "regression lines", "least squares line" ]],
      "description": "summarizes the relationship (if linear) between two quantitative variables in such a way as to minimize the errors overall when using explanatory values to predict responses"
    },
    "es-mx": {
      "keywords": [[ "línea de mejor ajuste", "línea de tendencia", "mejor ajuste", "recta de mejor ajuste" ]],
      "description": "resume la relación (si es lineal) entre dos variables cuantitativas de tal manera que se minimicen los errores generales cuando se utilizan valores explicativos para predecir respuestas"
    }
  },
  {
    "en-us": {
      "keywords": [[ "list" ]],
      "description": "a data structure containing a sequence of values"
    },
    "es-mx": {
      "keywords": [[ "lista" ]],
      "description": "una estructura de datos que contiene una secuencia de valores"
    }
  },
  {
    "en-us": {
      "keywords": [[ "logarithmic relationship", "logarithmic function", "logarithmic model" ]],
      "description": "A mathematical relation between two variables, x and y, in which a base must be raised to the power of y in order to equal the value of x. When graphed, a logarithmic relationship appears as a reflection of an exponential function across the diagonal line y = x."
    },
    "es-mx": {
      "keywords": [[ "función logarítmica" ]],
      "description": "una relación matemática entre dos variables, x e y, en la que se debe elevar una base a la potencia de y para igualar el valor de x. Cuando se representa gráficamente, una función logarítmica aparece como una curva de 'palo de hockey invertido' (con pendiente hacia arriba o hacia abajo)."
    }
  },
  {
    "en-us": {
      "keywords": [[ "logic error" ]],
      "description": "errors in the way a programmer is thinking about a problem"
    },
    "es-mx": {
      "keywords": [[ "errores de logica" ]],
      "description": "errores en la forma en que un programador está pensando en un problema"
    }
  },
  {
    "en-us": {
    "keywords": [[ "maxima", "maximum" ]],
    "description": "the largest value(s) in a selected range of a set (e.g. - the outputs of a function or a list of values)"
    },
    "es-mx": {
      "keywords": [[ "máximo" ]],
      "description": "el valor(es) más grande(s) en un rango seleccionado de un conjunto (por ejemplo, las salidas de una función o una lista de valores)"
    }
  },
  {
    "en-us": {
      "keywords": [[ "mean", "average" ]],
      "description": "a representation of the center, or 'typical' value in a set of numbers, calculated as the sum of those numbers divided by the number of values."
    },
    "es-mx": {
      "keywords": [[ "el promedio" ]],
      "description": "Un número que representa el centro o valor 'típico' en un conjunto de datos cuantitativos. Resultado que se obtiene al dividir la suma de varias cantidades entre el número de elementos sumados."
    }
  },
  {
    "en-us": {
      "keywords": [[ "median" ]],
      "description": "the middle value (or average of the two middle values) in an ordered list of quantitative data"
    },
    "es-mx": {
      "keywords": [[ "mediana" ]],
      "description": "el elemento intermedio de un conjunto de datos cuantitativos ordenados"
    }
  },
  {
    "en-us": {
      "keywords": [[ "method" ]],
      "description": "a function that is only associated with an instance of a data type, which consumes inputs and produces an output based on that instance"
    },
    "es-mx": {
      "keywords": [[ "método" ]],
      "description": "una función que solo está asociada con una instancia de un tipo de dato; la función consume argumentos y produce resultados basado en esa instancia"
    }
  },
  {
    "en-us": {
      "keywords": [[ "midline", "center line" ]],
      "description": "the horizontal line that passes exactly in the middle between the graph's maximum and minimum points"
    },
    "es-mx": {
      "keywords": [[ "línea media" ]],
      "description": "la línea horizontal que pasa exactamente en el medio entre los puntos máximo y mínimo del gráfico"
    }
  },
  {
    "en-us": {
      "keywords": [[ "minima", "minimum" ]],
      "description": "the smallest value(s) in a selected range of a set (e.g. - the outputs of a function or a list of values)"
    },
    "es-mx": {
      "keywords": [[ "mínimo" ]],
      "description": "el valor(es) más pequeño(s) en un rango seleccionado de un conjunto (por ejemplo, las salidas de una función o una lista de valores)"
    }
  },
  {
    "en-us": {
      "keywords": [[ "mode", "modes", "mode(s)" ]],
      "description": "the most commonly appearing categorical or quantitative value or values in a dataset"
    },
    "es-mx": {
      "keywords": [[ "moda" ]],
      "description": "el valor (o valores) que ocurren con mayor frecuencia en un conjunto de datos"
    }
  },
  {
    "en-us": {
      "keywords": [[ "model"]],
      "description": "a simplified representation of variables in a dataset, used to predict the value of one of those variables based on one or more of the other variables in the dataset"
    },
    "es-mx": {
      "keywords": [[ "modelo" ]],
      "description": "una representación simplificada de variables en un conjunto de datos, utilizada para predecir el valor de una de esas variables en función de una o más de las otras variables en el conjunto de datos"
    }
  },
   {
    "en-us": {
      "keywords": [[ "Multiplicative Inverse Property" ]],
      "description": "Multiplying a number (other than zero) and its reciprocal always produces 1"
    },
    "es-mx": {
      "keywords": [[ "Propriedad del Inverso Multiplicativo" ]],
      "description": "Multiplicar cualquier número diferente de 0 por su reciproco produce 1"
    }
  },
  {
    "en-us": {
      "keywords": [[ "name" ]],
      "description": "how we refer to a function or value defined in a language (examples: +, *, star, circle)"
    },
    "es-mx": {
      "keywords": [[ "nombre" ]],
      "description": "cómo nos referimos a una función o valor definido en un idioma (ejemplos: +, *, star, circle)"
    }
  },
  {
    "en-us": {
      "keywords": [[ "null hypothesis" ]],
      "description": "The claim that \"there's nothing special going on\" in the larger population from which we are sampling. This claim could mean \"in general, the coin isn't biased towards heads or tails\" or \"in general, breed doesn't affect how long it takes for dogs to be adopted.\""
    },
    "es-mx": {
      "keywords": [[ "hipótesis nula" ]],
      "description": "la hipótesis de que no hay diferencia significativa entre poblaciones específicas, cualquier diferencia observada se debe a un error de muestreo o experimental."
    }
  },
  {
    "en-us": {
      "keywords": [[ "navigator" ]],
      "description": "in pair programming, the person who has their eyes on the screen directing the driver"
    },
    "es-mx": {
      "keywords": [[ "navegadora" ]],
      "description": "en programación en pareja, la persona con los ojos en la pantalla, dirigiendo al conductor"
    }
  },
  {
    "en-us": {
      "keywords": [[ "negative correlation" ]],
      "description": "relationship in which one variable increases as the other decreases, and vice versa"
    },
    "es-mx": {
      "keywords": [[ "correlación negativa" ]],
      "description": "una relación en la que una variable incrementa a medida que la otra disminuye, y viceversa"
    }
  },
  {
    "en-us": {
      "keywords": [[ "nonlinear", "nonlinear relationship", "nonlinear model" ]],
      "description": "a pattern that is not a straight line when it is graphed"
    },
    "es-mx": {
      "keywords": [[ "relación no lineal", "no lineal" ]],
      "description": "tipo de relación que no es una línea recta cuando se representa gráficamente"
    }
  },
  {
    "en-us": {
      "keywords": [[ "normal", "normal distribution" ]],
      "description": "A normal distribution has a particular symmetric shape that bulges in the middle and tapers at the ends."
    },
    "es-mx": {
      "keywords": [[ "distribución normal" ]],
      "description": "Una distribución normal tiene una forma simétrica particular que es más ancha en el medio y se estrecha en los extremos."
    }
  },
  {
    "en-us": {
      "keywords": [[ "number" ]],
      "description": "a data type representing a real number"
    },
    "es-mx": {
      "keywords": [[ "número" ]],
      "description": "un tipo de datos que representa un número real"
    }
  },
  {
    "en-us": {
      "keywords": [[ "operator" ]],
      "description": "a symbol that manipulates two Numbers and produces a result"
    },
    "es-mx": {
      "keywords": [[ "operador" ]],
      "description": "un símbolo que manipula dos números y produce un resultado"
    }
  },
  {
    "en-us": {
      "keywords": [[ "opposite" ]],
      "description": "Two numbers are opposites when they are the same distance from zero on the number line."
    },
    "es-mx": {
      "keywords": [[ "opuesto" ]],
      "description": "Dos números son opuestos si están a la misma distancia de cero en la recta numérica."
    }
  },
  {
    "en-us": {
      "keywords": [[ "order" ]],
      "description": "an arrangement of data according to some pattern"
    },
    "es-mx": {
      "keywords": [[ "orden" ]],
      "description": "una disposición de datos de acuerdo con algún patrón"
    }
  },
  {
    "en-us": {
      "keywords": [[ "origin" ]],
      "description": "the point (0,0) where the horizontal and vertical axes intersect"
    },
    "es-mx": {
      "keywords": [[ "origen" ]],
      "description": "el punto (0,0) en el que el eje horizontal y el eje vertical se intersectan"
    }
  },
  {
    "en-us": {
      "keywords": [[ "parabola" ]],
      "description": "A symmetric, U-shaped curve drawn by a quadratic relationship, or by intersecting a plane with a circular cone."
    },
    "es-mx": {
      "keywords": [[ "parábola" ]],
      "description": "una curva simétrica en forma de U dibujada por una relación cuadrática o por la intersección de un plano con un cono circular."
    }
  },
  {
    "en-us": {
      "keywords": [[ "percentage" ]],
      "description": "a ratio showing the parts per hundred"
    },
    "es-mx": {
      "keywords": [[ "porcentaje" ]],
      "description": "la relación de proporción existente entre 2 números. Para hacerlo más intuitivo, se ha usado siempre la relación en términos de cien unidades"
    }
  },
  {
    "en-us": {
      "keywords": [[ "peak", "crest" ]],
      "description": "the highest outputs from a periodic function, which repeat at regular intervals"
    },
    "es-mx": {
      "keywords": [[ "cresta, " ]],
      "description": "los puntos más altos de la onda, que se repiten a intervalos "
    }
  },
  {
    "en-us": {
      "keywords": [[ "period" ]],
      "description": "The length from one peak to the next, from one trough to the next, or from any point to the next matching point of a periodic function"
    },
    "es-mx": {
      "keywords": [[ "periodo" ]],
      "description": "la longitud de la onda, ya sea desde un valle a otro valle, desde una cresta a otra cresta, o de cualquier punto de una función periódica al siguiente punto coincidente},"
    }
  },
  {
    "en-us": {
      "keywords": [[ "periodic relationship", "periodic function", "periodic model", "periodic" ]],
      "description": "A mathematical relation between two variables, x and y, in which y returns to the same value over and over as x increases, and does so at regular intervals."
    },
    "es-mx": {
      "keywords": [[ "funciones periódicas" ]],
      "description": "relación matemática entre dos variables, x e y, en la que y vuelve al mismo valor una y otra vez a medida que x aumenta, y lo hace a intervalos regulares"
    }
  },
  {
    "en-us": {
      "keywords": [[ "permutation" ]],
      "description": "the number of possible arrangements in a collection of items where the order of the selection matters (ABC and CBA would be considered different permutations)"
    },
    "es-mx": {
      "keywords": [[ "permutación" ]],
      "description": "el número de arreglos posibles en una colección de elementos donde el orden de la selección importa (ABC y CBA se considerarían permutaciones diferentes)"
    }
  },
  {
    "en-us": {
      "keywords": [[ "piecewise function" ]],
      "description": "in contrast to conventional functions that have a single \"rule\" used for every input in their domain, these functions divide their domain into \"pieces\" and use a different rule for each piece."
    },
    "es-mx": {
      "keywords": [[ "funciones por trozos" ]],
      "description": "una función que evalua diferentes expresiones basado en su argumento"
    }
  },
  {
    "en-us": {
      "keywords": [[ "pie chart" ]],
      "description": "a display that uses areas of a circular pie's slices to show percentages in each category"
    },
    "es-mx": {
      "keywords": [[ "gráfico circular" ]],
      "description": "Un gráfico donde el tamaño de cada sector circular corresponde a un valor en el conjunto de datos. Un recurso estadístico que se utiliza para representar porcentajes y proporciones"
    }
  },
  {
    "en-us": {
      "keywords": [[ "pixel" ]],
      "description": "the smallest unit that makes up a digital image. The more pixels, the more detailed an image or video can appear."
    },
    "es-mx": {
      "keywords": [[ "pixel" ]],
      "description": "el elemento más pequeño en la que se puede descomponer una imagen digital. Cuantos más píxeles, más detallada puede aparecer una imagen o un video."
    }
  },
  {
    "en-us": {
      "keywords": [[ "Point-Slope", "Point-Slope", "Point-Slope Form" ]],
      "description": "the equation of a straight line in the form y − y1 = m(x − x1) where m is the slope of the line and (x1, y1) are the coordinates of a given point on the line"
    },
    "es-mx": {
      "keywords": [[ "Punto-Pendiente", "Forma Punto-Pendiente" ]],
      "description": "la ecuación de una recta en la forma y − y1 = m(x − x1) donde 'm' es la pendiente de la línea y (x1, y1) son las coordenadas de un punto dado en la línea"
    }
  },
  {
    "en-us": {
      "keywords": [[ "positive correlation" ]],
      "description": "relationship in which one variable increases as the other increases, and vice versa"
    },
    "es-mx": {
      "keywords": [[ "correlación positiva" ]],
      "description": "una relación en la que los valores de ambas variables tienden a aumentar juntos"
    }
  },
  {
    "en-us": {
      "keywords": [[ "predictor function", "predictor" ]],
      "description": " a model of patterns in data. These models reduce the complexity of the data, predicting the value of the response variable as if completely dependent on the explanatory (independent) variable."
    },
    "es-mx": {
      "keywords": [[ "función predictora" ]],
      "description": "una función que, dado un valor de un conjunto de datos, hace una suposición fundamentada sobre un valor relacionado en un conjunto de datos diferente"
    }
  },
  {
    "en-us": {
      "keywords": [[ "probability", "probabilities" ]],
      "description": "a measure of the chance that a particular event will occur, given the number of possible events. The value is expressed as a number between zero and one, where zero is an impossible event and one is an event that will definitely happen"
    },
    "es-mx": {
      "keywords": [[ "probabilidad" ]],
      "description": "una medida de la certidumbre de que ocurra un evento. Su valor es un número entre 0 y 1, donde un evento imposible corresponde a cero y uno seguro corresponde a uno."}
  },
  {
    "en-us": {
      "keywords": [[ "produce" ]],
      "description": "to compute a value from an expression"
    },
    "es-mx": {
      "keywords": [[ "producir" ]],
      "description": "calcular un valor a partir de una expresión"
    }
  },
  {
    "en-us": {
      "keywords": [[ "programming language" ]],
      "description": "a set of rules for writing code that a computer can evaluate"
    },
    "es-mx": {
      "keywords": [[ "lenguaje de programación" ]],
      "description": "un conjunto de reglas para escribir código que una computadora puede evaluar"
    }
  },
  {
    "en-us": {
      "keywords": [[ "purpose statement" ]],
      "description": "a concise, detailed description of what a function does with its inputs"
    },
    "es-mx": {
      "keywords": [[ "declaración de propósito" ]],
      "description": "una breve descripción de lo que hace una función"
    }
  },
  {
    "en-us": {
      "keywords": [[ "Pythagorean Theorem" ]],
      "description": "the relationship between the squares of the sides of a right triangle; can be used to find diagonal distances on the coordinate plane"
    },
    "es-mx": {
      "keywords": [[ "Teorema de Pitágoras" ]],
      "description": "en todo triángulo rectángulo, el cuadrado de la hipotenusa es igual a la suma de los cuadrados de los catetos; se puede usar para encontrar distancias diagonales en el plano de coordenadas"
    }
  },
  {
    "en-us": {
      "keywords": [[ "quadratic relationship", "quadratic function" ]],
      "description": "A mathematical relation between two variables, x and y, in which the dominant term is squared. When graphed, a quadratic relationship appears as a parabola"
    },
    "es-mx": {
      "keywords": [[ "función cuadrática" ]],
      "description": "Una relación matemática entre dos variables, x e y, en la que el término dominante está al cuadrado. Cuando se representa gráficamente, una relación cuadrática aparece como una parábola"
    }
  },
  {
    "en-us": {
      "keywords": [[ "quantitative data", "quantitative" ]],
      "description": "number values for which arithmetic makes sense"
    },
    "es-mx": {
      "keywords": [[ "datos cuantitativos" ]],
      "description": "datos con valores que miden alguna cantidad; puede no tener un número fijo de valores posibles"
    }
  },
  {
    "en-us" : {
      "keywords": [["Q1 (lower quartile)", "lower quartile", "first quartile"]],
      "description": "the number that separates the first quarter of the data from the second quarter of the data"
    },
    "es-mx" : {
      "keywords" : [["primer cuartil (Q1)", "cuartil inferior"]],
      "description": "quel valor de la variable tal que la cuarta parte (25%) de las observaciones son inferiores o iguales a él, y el resto (75%) es superior o igual"
    }
  },
  {
    "en-us" : {
      "keywords": [["Q3 (upper quartile)", "upper quartile", "third quartile"]],
      "description": "the value that separates the third quarter of the data from the last"
    },
    "es-mx" : {
      "keywords" : [["tercer cuartil (Q3)"]],
      "description": "el valor que separa el 75% inferior del 25% superior de los datos"}
  },
  {
    "en-us": {
      "keywords": [[ "quartile" ]],
      "description": "one of 3 data points that divide the data set into four equal groups. For example, the data point that separates the 1st quarter of data from the 2nd quarter of data is called Q1, the first quartile or the lower quartile."
    },
    "es-mx": {
      "keywords": [[ "cuartiles" ]],
      "description": "valores que dividen una muestra de datos en cuatro partes iguales"
    }
  },
  {
    "en-us": {
      "keywords": [[ "r", "r-value" ]],
      "description": "a number between −1 and 1 that measures the direction and strength of a linear relationship between two quantitative variables (also known as correlation value)"
    },
    "es-mx": {
      "keywords": [[ "valor R" ]],
      "description": "un numero entre -1 y 1 que mide el dirección y la fuerza de una relación lineal entre dos variables cuantitativas"
    }
  },
  {
    "en-us": {
      "keywords": [[ "R&#xB2;", "r-squared;", "R&sup2;", "R&#178;", "R-squared" ]],
      "description": "a number between 0 and 1, indicating what percentage of the variation in the response values can be explained by a prediction based on the <i>explanatory</i> values in the data set. (For example, \"25% of the variation in heights can be explained by a linear model based on shoe sizes\")" },
    "es-mx": {
      "keywords": [[ "R-cuadrado" ]],
      "description": "un número entre 0 y 1, que indica qué porcentaje de la variación en los valores de respuesta se puede explicar mediante una predicción basada en los valores <i>explicativos</i> del conjunto de datos. (Por ejemplo, \"el 25% de la variación de las alturas se puede explicar mediante un modelo lineal basado en tallas de calzado\")"}
  },
  {
    "en-us": {
      "keywords": [[ "radian" ]],
      "description": "a unit for measuring angles in terms of the angle formed by tracing out a single radius length on the circumference of a circle"
    },
    "es-mx": {
      "keywords": [[ "radián" ]],
      "description": "mide angulos por el número de veces que la longitud del radio recorre ese determinado arco en la circunferencia."
    }
  },
  {
    "en-us": {
      "keywords": [[ "random sample" ]],
      "description": "a subset of individuals chosen from a larger set, such that each individual has an equal probability of being chosen"
    },
    "es-mx": {
      "keywords": [[ "muestra aleatoria" ]],
      "description": "un subconjunto de individuos elegidos de un gran conjunto de datos que tiene la misma probabilidad de ser seleccionados"
    }
  },
  {
    "en-us": {
      "keywords": [[ "range" ]],
      "description": "the type or set of outputs that a function produces, i.e., the dependent variable(s)"
    },
    "es-mx": {
      "keywords": [[ "rango" ]],
      "description": "el tipo de datos que produce una función o la diferencia entre el valor más alto y el más bajo"
    }
  },
  {
    "en-us": {
      "keywords": [[ "range of a dataset", "range of the dataset"]],
      "description": "the distance between minimum and maximum values (not to be confused with the range of a function!)"
    },
    "es-mx": {
      "keywords": [[ "rango de un conjunto de datos" ]],
      "description": "la distancia entre los valores mínimo y máximo"
    }
  },
  {
    "en-us": {
      "keywords": [[ "reciprocal" ]],
      "description": "the reciprocal of any real number n is 1/n."
    },
    "es-mx": {
      "keywords": [[ "rango de un conjunto de datos" ]],
      "description": "la distancia entre los valores mínimo y máximo"
    }
  },
  {
    "en-us": {
      "keywords": [[ "rate" ]],
      "description": "A comparison of two related quantities"
    },
    "es-mx": {
      "keywords": [[ "tasa" ]],
      "description": "Una comparación de dos cantidades relacionadas"
    }
  },
  {
    "en-us": {
      "keywords": [[ "ratio", "ratios" ]],
      "description": "the relative sizes of two or more values"
    },
    "es-mx": {
      "keywords": [[ "razón" ]],
      "description": "una comparación entre dos o más medidas"
    }
  },
  {
    "en-us": {
      "keywords": [[ "reactor" ]],
      "description": "a value that contains a current state, and functions for updating, drawing, and interacting with that state"
    },
    "es-mx": {
      "keywords": [[ "reactor" ]],
      "description": "un valor que contiene el estado corriente y funciones por actualizar, dibujar y interactuar con ese estado"
    }
  },
  {
    "en-us": {
      "keywords": [[ "rectangular prism" ]],
      "description": "a solid figure which has 6 faces, all of which are rectangular"
    },
    "es-mx": {
      "keywords": [[ "prisma rectangular" ]],
      "description": "una figura sólida que tiene 6 caras, todas ellas rectangulares"
    }
  },
  {
    "en-us": {
      "keywords": [[ "refactor" ]],
      "description": "the process of changing the style or structure of a program's code, without changing the program's behavior"
    },
    "es-mx": {
      "keywords": [[ "refactorizar" ]],
      "description": "el processo de cambiar el estilo o la estructura del código de un programa, sin cambiar el comportamiento del programa"
    }
  },
  {
    "en-us": {
      "keywords": [[ "residual" ]],
      "description": "when fitting a model to data, the residual is the difference between the predicted value and the actual value of the response variable. The predicted value comes from the regression line and the actual value comes from the dataset."
    },
    "es-mx": {
      "keywords": [[ "el residuo" ]],
      "description": "al ajustar un modelo a los datos, el residual es la diferencia entre el valor predicho y el valor real de la variable de respuesta. Es importante tener en cuenta que el valor predicho proviene de nuestra línea de regresión. El valor observado proviene de nuestro conjunto de datos."
    }
  },
  {
    "en-us": {
      "keywords": [[ "response variable", "response" ]],
      "description": "the variable in a relationship, generally plotted on the y-axis of a scatter plot, that is presumed to be affected by the explanatory variable; in some contexts the response variable is referred to as the \"dependent variable\" or the \"output\""
    },
    "es-mx": {
      "keywords": [[ "variable de respuesta" ]],
      "description": "la variable en una relación, generalmente representada en el eje y de un diagrama de dispersión, que se supone afectada por la variable explicativa; en algunos contextos, la variable de respuesta se denomina \"variable dependiente\" o \"salida\""
    }
  },
  {
    "en-us": {
      "keywords": [[ "sample" ]],
      "description": "a set of individuals or objects collected or selected from a statistical population by a defined procedure"
    },
    "es-mx": {
      "keywords": [[ "muestra" ]],
      "description": "uun conjunto de individuos u objetos recopilados o seleccionados de una población estadística mediante un procedimiento definido"
    }
  },
  {
    "en-us": {
      "keywords": [[ "sample instances" ]],
      "description": "a collection of single instances, or also used to describe illustrative instances that we use to provide examples of a data structure"
    },
    "es-mx": {
      "keywords": [[ "instancias de muestra" ]],
      "description": "un conjunto de instancias únicas, usado para describir instancias ilustrativas que utilizamos para proporcionar ejemplos de una estructura de datos"
    }
  },
  {
    "en-us": {
      "keywords": [[ "sample size" ]],
      "description": "the number of individuals (people or things) for which data is gathered in a study"
    },
    "es-mx": {
      "keywords": [[ "tamaño de la muestra" ]],
      "description": "aquel número determinado de sujetos o cosas que componen la muestra extraída de una población"
    }
  },
  {
    "en-us": {
      "keywords": [[ "scale", "scale up", "scale down" ]],
      "description": "resize an image to be larger or smaller while maintaining ratios and proportions"
    },
    "es-mx": {
      "keywords": [[ "escalar" ]],
      "description": "aumentar o reducir proporcionalmente"
    }
  },
  {
    "en-us": {
      "keywords": [[ "scatter plot" ]],
      "description": "a display of the relationship between two quantitative variables, graphing each explanatory value on the x axis and the accompanying response on the y axis"
    },
    "es-mx": {
      "keywords": [[ "gráfico de dispersión" ]],
      "description": "Un gráfico donde los puntos se colocan en los ejes según pares de valores."
    }
  },
  {
    "en-us": {
      "keywords": [[ "selection bias" ]],
      "description": "failure to ensure that the sample obtained will be representative of the population intended to be studied"
    },
    "es-mx": {
      "keywords": [[ "sesgo de selección" ]],
      "description": "la selección no aleatoria de individuos, grupos o datos"
    }
  },
  {
    "en-us": {
      "keywords": [[ "shape" ]],
      "description": "The aspect of a dataset - visible in a histogram or box plot - that describes which values are more or less common."
    },
    "es-mx": {
      "keywords": [[ "forma de la distribución" ]],
      "description": "el aspecto de un conjunto de datos -visible en una histograma o diagrama de caja - que describe cuáles de los valors son más o menos comun."
    }
  },
  {
    "en-us": {
      "keywords": [[ "skew", "skewness" ]],
      "description": "lack of balance in a dataset's shape, arising from more values that are unusually low or high. Such values tend to trail off, rather than be separated by a gap (as with outliers)."
    },
    "es-mx": {
      "keywords": [[ "sesgo de una distribución" ]],
      "description": "falta de equilibrio en la forma de un conjunto de datos, que surge de la existencia de valores que son inusualmente bajos o altos. Estos valores tienden a aparecer como una cola más larga, en lugar de estar separados por un espacio (como es el caso de los valores atípicos)."
    }
  },
  {
    "en-us": {
      "keywords": [[ "skewed left", "skew left", "left skew" ]],
      "description": "A distribution is skewed left if there are a few values that are fairly low compared to the others. A histogram of data that is skewed left will have a clump of taller bars on the right, with smaller ones trailing off to the left, like the shape of the toes on a left foot."
    },
    "es-mx": {
      "keywords": [[ "sesgo a la izquierda" ]],
      "description": "Una distribución está sesgada hacia la izquierda si hay algunos valores que son bastante bajos en comparación con los demás. Un histograma de datos que está sesgado hacia la izquierda tendrá un grupo de barras más altas a la derecha, y una cola de barras más reducida hacia la izquierda, como la forma de los dedos de un pie izquierdo."
    }
  },
  {
    "en-us": {
      "keywords": [[ "skewed right", "skew right", "right skew" ]],
      "description": "A distribution is skewed right if there are a few values that are fairly high compared to the bulk of data values. A histogram of data that is skewed right will have a clump of taller bars on the left, with smaller ones trailing off to the right, like the shape of the toes on a right foot."
    },
    "es-mx": {
      "keywords": [[ "sesgo a la derecha" ]],
      "description": "Una distribución está sesgada a la derecha si hay algunos valores que son bastante altos en comparación con la mayor parte de los valores de los datos. Un histograma de datos que está sesgado a la derecha tendrá un grupo de barras más altas a la izquierda, y una cola de barras más reducida hacia la derecha, como la forma de los dedos del pie derecho."
    }
  },
  {
    "en-us": {
      "keywords": [[ "slope", "rate of change" ]],
      "description": "the steepness of a straight line on a graph reported as a number which tells how much y changes for every unit increase in x"
    },
    "es-mx": {
      "keywords": [[ "pendiente" ]],
      "description": "la pendiente de una línea recta en una gráfica expresada como un número que indica cuánto cambia y por cada aumento unitario en x"
    }
  },
  {
    "en-us": {
      "keywords": [[ "slope-intercept", "Slope-Intercept Form" ]],
      "description": "the equation of a straight line in the form y = mx + b where m is the slope of the line and b is its y-intercept"
    },
    "es-mx": {
      "keywords": [[ "forma pendiente-ordenada al origen" ]],
      "description": "la ecuación de una recta en la forma y = mx + b en la que 'm' es la pendiente de la línea y 'b' es su intersección con el eje y"
    }
  },
  {
    "en-us": {
      "keywords": [[ "solution set" ]], 
      "description": "the set of all values or coordinate pairs that will make an equation, inequality, set of equations or set of inequalities true"
    },
    "es-mx": {
      "keywords": [[ "conjunto solución" ]],
      "description": "el conjunto de todos los elementos que hacen verdadera una ecuación o desigualdad"
    }
  },
  {
    "en-us": {
      "keywords": [[ "spread", "distribution" ]],
      "description": "the aspect of a dataset that describes the extent to which values vary, either from one another or from the center"
    },
    "es-mx": {
      "keywords": [[ "dispersión", "distribución" ]],
      "description": "el aspecto de un conjunto de datos que describe la medida en que los valores varían, entre sí o desde el centro"
    }
  },
  {
    "en-us": {
      "keywords": [[ "standard deviation" ]],
      "description": "a number that measures spread of a dataset using the typical distance of values from their mean"
    },
    "es-mx": {
      "keywords": [[ "desviación estándar" ]],
      "description": "un número que mide la dispersión de un conjunto de datos usando la distancia típica de los valores desde su media"
    }
  },
  {
    "en-us": {
      "keywords": [[ "S", "residual standard deviation", "standard deviation of the residuals", "S-value" ]],
      "description": "the standard deviation of the residuals calculates how far a model's regression line is from all of the data points"
    },
    "es-mx": {
      "keywords": [[ "desviación estándar" ]],
      "description": "un número que mide la dispersión de un conjunto de datos usando la distancia típica de los valores desde su media"
    }
  },
  {
    "en-us": {
      "keywords": [[ "standard form of a line", "standard form" ]],
      "description": "the equation of a straight line in the form Ax + By = C or Ax + By + C = 0"
    },
    "es-mx": {
      "keywords": [[ "forma estándar de una función lineal" ]],
      "description": "la ecuación de una recta en la forma Ax + By = C o Ax + By + C = 0"
    }
  },
  {
    "en-us": {
      "keywords": [[ "state" ]],
      "description": "the value of a changing system at any point in time (i.e. a stoplight can be in the 'red', 'yellow' or 'green' state). In Pyret, the state of a Reactor is it's current value."
    },
    "es-mx": {
      "keywords": [[ "estado" ]],
      "description": "el valor de un sistema que cambia en cualquier momento (es decir, un semáforo puede estar en un estado 'rojo', 'amarillo' o 'verde'). En Pyret, el estado de un reactor es su valor actual."
    }
  },
  {
    "en-us": {
      "keywords": [[ "statistical inference", "inference" ]],
      "description": "using information from a sample to draw conclusions about the larger population from which the sample was taken"
    },
    "es-mx": {
      "keywords": [[ "inferencia estadística" ]],
      "description": "utilizar información de una muestra para sacar conclusiones sobre la población más grande de la que se origina la muestra"
    }
  },
  {
    "en-us": {
      "keywords": [[ "statistical question"]],
      "description": "questions that _expect some variability in the data_ related to the question and _account for it in the answers_. They focus on describing or analyzing patterns and trends in data sets, to gain understanding of what is generally true about the data, rather than computing a single precise value."    
    },
    "es-mx": {
      "keywords": [[ "inferencia estadística" ]],
      "description": "Preguntas que _esperan cierta variabilidad en los datos_ relacionados con la pregunta y _la tienen en cuenta en las respuestas_. Se centran en describir o analizar patrones y tendencias en conjuntos de datos, para comprender lo que es generalmente cierto acerca de los datos, en lugar de calcular un único valor preciso."
    }
  },
  {
    "en-us": {
      "keywords": [[ "strength" ]],
      "description": "of a relationship between two quantitative variables: how much do the values of one variable tells us about the values of the other"
    },
    "es-mx": {
      "keywords": [[ "fuerza" ]],
      "description": "en una relación entre dos variables cuantitativas, cuánto nos dice los valores de una variable sobre los valores de la otra"
    }
  },
  {
    "en-us": {
      "keywords": [[ "string" ]],
      "description": "a data type for any sequence of characters between quotation marks (examples: \"hello\", \"42\", \"this is a string!\")"
    },
    "es-mx": {
      "keywords": [[ "cadena" ]],
      "description": "cualquier secuencia de caracteres entre comillas (ejemplos: \"hello\", \" 42\", \"esto es una cadena! \")"
    }
  },
  {
    "en-us": {
      "keywords": [[ "substitute" ]],
      "description": "replace a variable with a value or expression and evaluate or simplify the resulting expression"
    },
    "es-mx": {
      "keywords": [[ "sustitución" ]],
      "description": "reemplazar una variable por una cantidad o expresión y evaluar o simplificar"
    }
  },
  {
    "en-us": {
      "keywords": [[ "surface area" ]],
      "description": "the sum of the areas of all of the faces of a solid figure (polyhedron) or the total area that the surface of the object occupies"
    },
    "es-mx": {
      "keywords": [[ "área de superficie" ]],
      "description": "la suma de las áreas de todas las caras de una figura sólida (poliedro) o el área total que ocupa la superficie del objeto"
    }
  },
  {
    "en-us": {
      "keywords": [["symmetric"]],
      "description": "made up of exactly similar parts facing each other or around an axis"
    },
    "es-mx": {
      "keywords": [[]],
      "description": "formado por partes exactamente similares enfrentadas entre sí o alrededor de un eje"
    }
  },
  {
    "en-us": {
      "keywords": [[ "syntax" ]],
      "description": "the set of rules that defines a language, whether it be spoken, written, or programmed."
    },
    "es-mx": {
      "keywords": [[ "sintaxis" ]],
      "description": "El conjunto de reglas que define un lenguaje, ya sea que sea escrito, hablado o programado."
    }
  },
  {
    "en-us": {
      "keywords": [[ "syntax error" ]],
      "description": "errors where the computer cannot make sense of the code (e.g. - missing commas, missing parentheses, unclosed strings)"
    },
    "es-mx": {
      "keywords": [[ "errores de sintaxis" ]],
      "description": "errores en los que la computadora no puede entender en el código (por ejemplo, comas faltantes, paréntesis faltantes, cadenas sin cerrar)"
    }
  },
  {
    "en-us": {
      "keywords": [[ "table" ]],
      "description": "a data structure that organizes data into rows and columns"
    },  
    "es-mx": {
      "keywords": [[ "tabla de datos" ]],
      "description": "una colección de datos organizados en filas y columnas"
    }
  },
  {
    "en-us": {
      "keywords": [[ "testing table" ]],
      "description": "a carefully-selected sample from a dataset, which is designed to test a particular table operation for correctness (Bootstrap-specific)"
    },  
    "es-mx": {
      "keywords": [[ "tabla de pruebas" ]],
      "description": "una muestra cuidadosamente seleccionada de un conjunto de datos, que está diseñada para probar la corrección de una operación de tabla particular (Específico de Bootstrap)"
    }
  },
  {
    "en-us": {
      "keywords": [[ "threats to validity" ]],
      "description": "factors that can undermine the conclusion of a study"
    },
    "es-mx": {
      "keywords": [[ "amenazas a la validez" ]],
      "description": "factores que pueden perjudicar o debilitar la conclusion de un estudio"
    }
  },
  {
    "en-us": {
      "keywords": [[ "trough" ]],
      "description": "the lowest outputs from a periodic function, which repeat at regular intervals"
    },
    "es-mx": {
      "keywords": [[ "valle" ]],
      "description": "los puntos más bajos de la onda, que se repiten a intervalos regulares"
    }
  },
  {
    "en-us": {
      "keywords": [[ "union" ]],
      "description": "the set of values that makes either or both of a set of inequalities true"
    },
    "es-mx": {
      "keywords": [[ "unión", "unión de conjuntos" ]],
      "description": "el conjunto de valores que hace que una o ambas desigualdades sean verdaderas"
    }
  },
  {
    "en-us": {
      "keywords": [[ "unit test" ]],
      "description": "an example showing the use of a function with a specific value or values, and the answer it should produce"
    },
    "es-mx": {
      "keywords": [[ "unidad de prueba" ]],
      "description": "un ejemplo que muestra el uso de una función con un valor o valores específicos y la respuesta que debe producir"
    }
  },
  {
    "en-us": {
      "keywords": [[ "validity" ]],
      "description": "the degree to which a study both measures what it is supposed to and then draws conclusions from the data gathered that are reasonable and supported by the data"
    },
    "es-mx": {
      "keywords": [[ "validez" ]],
      "description": "el grado en el que un estudio mide lo que se supone que debe medir y luego extrae conclusiones de los datos recopilados que son razonables y están respaldadas por los datos"
    }
  },
  {
    "en-us": {
      "keywords": [[ "value" ]],
      "description": "a specific piece of data, like 5 or \"hello\""
    },
    "es-mx": {
      "keywords": [[ "valor" ]],
      "description": "una pieza específica de datos, como 5 o \" hello \""
    }
  },
  {
    "en-us": {
      "keywords": [[ "variability" ]],
      "description": "how spread out a set of data is. Range, Interquartile Range, Standard Deviation, and Variance (the average of the squared differences from the mean) can all be used to describe variability in the dataset."
    },
    "es-mx": {
      "keywords": [[ "variabilidad" ]],
      "description": "qué tan disperso está un conjunto de datos. El rango, el rango intercuartil, la desviación estándar y la varianza (el promedio de las diferencias al cuadrado de la media) se pueden utilizar para describir la variabilidad en el conjunto de datos."
    }
  },
  {
    "en-us": {
      "keywords": [[ "variable" ]],
      "description": "a name or symbol that stands for some value or expression, often a value or expression that changes"
    },
    "es-mx": {
      "keywords": [[ "variable" ]],
      "description": "algo que cambia"
    }
  },
  {
    "en-us": {
      "keywords": [[ "variable name" ]],
      "description": "name of the information that can be different each time a function is used"
    },
    "es-mx": {
      "keywords": [[ "nombre de variable" ]],
      "description": "nombre de la información que puede ser diferente cada vez que se utiliza una función"
    }
  },
  {
    "en-us": {
      "keywords": [[ "vertical axis", "y-axis" ]],
      "description": "number line on a coordinate plane that runs from bottom to top, indicating values in that direction"
    },
    "es-mx": {
      "keywords": [[ "eje vertical" ]],
      "description": "El eje en un gráfico de dispersión que corre de arriba hacia abajo"
    }
  },
  {
    "en-us": {
      "keywords": [[ "vertex" ]],
      "description": "a point where two or more lines or curves meet (in a parabola, the vertex is the maxima or minima)"
    },
    "es-mx": {
      "keywords": [[ "vértice" ]],
      "description": "un punto donde se encuentran dos o más líneas o curvas (en una parábola, el vértice es las máxima o mínima)"
    }
  },
  {
    "en-us": {
      "keywords": [[ "vertical line test" ]],
      "description": "a strategy for determining whether or not a graph represents a function by confirming that no vertical line can be drawn such that it would pass through 2 points on the plot. In a function, each x-value may only correspond to a single y-value." },
    "es-mx": {
      "keywords": [[ "prueba de la línea vertical" ]],
      "description": "establece que una gráfica representa una función si y solo si todas las líneas verticales intersectan la gráfica a lo más una vez"
    }
  },
  {
    "en-us": {
      "keywords": [[ "vertical shift" ]],
      "description": "the amount that the graph of a function is shifted up (positive) or down (negative)"
    },
    "es-mx": {
      "keywords": [[ "traslación vertical", "desplazamiento vertical" ]],
      "description": "la cantidad que la gráfica de una función se desplaza hacia arriba (positiva) o hacia abajo (negativa)"
    }
  },
  {
    "en-us": {
      "keywords": [[ "x-coordinate" ]],
      "description": "first number of an ordered pair; represents the horizontal location of a point"
    },
    "es-mx": {
      "keywords": [[ "coordenada x" ]],
      "description": "primer número de un par ordenado; representa la ubicación horizontal del punto"
    }
  },
  {
    "en-us": {
      "keywords": [[ "x-intercept", "zero", "root", "root(s)" ]],
      "description": "the point where a line or curve crosses the x-axis of a graph (also called the 'root'  or 'zero' because this is the x-value for which y=0)"
    },
    "es-mx": {
      "keywords": [[ "intercepto", "intercepto horizontal", "intersección en el eje X", "raíz", "cero" ]],
      "description": "El punto donde la recta o curva cruza el eje horizontal (también llamado 'raíz' o 'cero' porque este es el valor de x para el cual y=0)."
    }
  },
  {
    "en-us": {
      "keywords": [[ "y-intercept" ]],
      "description": "the point where a line or curve crosses the y-axis of a graph"
    },
    "es-mx": {
      "keywords": [[ "intercepto", "intercepto vertical", "intersección en el eje Y" ]],
      "description": "El punto donde la recta o curva cruza el eje vertical (y)."
    }
  },
  {
    "en-us": {
      "keywords": [[ "typicality" ]],
      "description": "what is typical or expected in a dataset"
    },
    "es-mx": {
      "keywords": [[ "" ]],
      "description": ""
    }
  },
 {
    "en-us": {
      "keywords": [[ "dot plot" ]],
      "description": "a data visualization consisting of data points plotted along a number line"
    },
    "es-mx": {
      "keywords": [[ "" ]],
      "description": ""
    }
  },
 {
    "en-us": {
      "keywords": [[ "cluster" ]],
      "description": "a group of data points that are close together"
    },
    "es-mx": {
      "keywords": [[ "" ]],
      "description": ""
    }
  },
 {
    "en-us": {
      "keywords": [[ "gap" ]],
      "description": "an interval where there are no data points"
    },
    "es-mx": {
      "keywords": [[ "" ]],
      "description": ""
    }
  },
 {
    "en-us": {
      "keywords": [[ "outlier" ]],
      "description": " a data point that differs significantly from other observations"
    },
    "es-mx": {
      "keywords": [[ "valore atípico", "valores atípicos"]],
      "description": ""
    }
  },
 {
    "en-us": {
      "keywords": [[ "peak" ]],
      "description": "the point in a plot where the data rises to the highest point, before falling again"
    },
    "es-mx": {
      "keywords": [[ "" ]],
      "description": ""
    }
  },
 {
    "en-us": {
      "keywords": [[ "Artificial Intelligence (AI)" ]],
      "description": "technologies that enable computers to perform tasks that were once thought to be for humans only"
    },
    "es-mx": {
      "keywords": [[ "" ]],
      "description": ""
    }
  },
 {
    "en-us": {
      "keywords": [[ "data-driven algorithm" ]],
      "description": "the instructions that tell a computer how to perform a task, which produce better results when given more data"
    },
    "es-mx": {
      "keywords": [[ "" ]],
      "description": ""
    }
  },
 {
    "en-us": {
      "keywords": [[ "training" ]],
      "description": "the act of transforming data into a model"
    },
    "es-mx": {
      "keywords": [[ "" ]],
      "description": ""
    }
  },
 {
    "en-us": {
      "keywords": [[ "bag of words" ]],
      "description": "a model that represents text as an unordered collection of words with frequencies"
    },
    "es-mx": {
      "keywords": [[ "" ]],
      "description": ""
    }
  },
 {
    "en-us": {
      "keywords": [[ "dimensionality" ]],
      "description": "the number of dimensions in a 3D vector space; for a bag-of-words model, dimensionality reflects how many different words are in the corpus"
    },
    "es-mx": {
      "keywords": [[ "" ]],
      "description": ""
    }
  },
 {
    "en-us": {
      "keywords": [[ "vector" ]],
      "description": "an ordered list of numbers within parentheses and separated by commas, representing a point"
    },
    "es-mx": {
      "keywords": [[ "" ]],
      "description": ""
    }
  },
 {
    "en-us": {
      "keywords": [[ "normalization" ]],
      "description": "organizing data to remove unneeded characteristics and eliminate redundancy"
    },
    "es-mx": {
      "keywords": [[ "" ]],
      "description": ""
    }
  },
 {
    "en-us": {
      "keywords": [[ "" ]],
      "description": ""
    },
    "es-mx": {
      "keywords": [[ "" ]],
      "description": ""
    }
  },
 {
    "en-us": {
      "keywords": [[ "decision tree" ]],
      "description": "a machine learning algorithm that uses a tree-like model to show decisions and their possible consequences"
    },
    "es-mx": {
      "keywords": [[ "" ]],
      "description": ""
    }
  },
 {
    "en-us": {
      "keywords": [[ "node" ]],
      "description": "on a decision tree, this represents a decision or condition; root nodes are at the top of the tree, while leaf nodes do not split"
    },
    "es-mx": {
      "keywords": [[ "" ]],
      "description": ""
    }
  },
 {
    "en-us": {
      "keywords": [[ "splitting" ]],
      "description": "on a decision tree, the process of dividing a node into sub-nodes"
    },
    "es-mx": {
      "keywords": [[ "" ]],
      "description": ""
    }
  },
 {
    "en-us": {
      "keywords": [[ "overfitting" ]],
      "description": "building a model that corresponds too closely to the training dataset, resulting in poor performance on new data"
    },
    "es-mx": {
      "keywords": [[ "" ]],
      "description": ""
    }
  },
 {
    "en-us": {
      "keywords": [[ "supervised learning" ]],
      "description": " a type of machine learning where  the computer trains on example data tagged by a human and learns a function that maps from input to output"
    },
    "es-mx": {
      "keywords": [[ "" ]],
      "description": ""
    }
  },
 {
    "en-us": {
      "keywords": [[ "clustering" ]],
      "description": "a machine learning algorithm that groups unlabeled data based on similarity"
    },
    "es-mx": {
      "keywords": [[ "" ]],
      "description": ""
    }
  },
 {
    "en-us": {
      "keywords": [[ "centroid" ]],
      "description": "the average of a cluster"
    },
    "es-mx": {
      "keywords": [[ "" ]],
      "description": ""
    }
  },
 {
    "en-us": {
      "keywords": [[ "Gini coefficient" ]],
      "description": "a measure between 0 and 1, quantifying the inequality in a set of values; 0 represents perfect equality and 1 represents perfect inequality"
    },
    "es-mx": {
      "keywords": [[ "" ]],
      "description": ""
    }
  },
 {
    "en-us": {
      "keywords": [[ "unsupervised learning" ]],
      "description": "a type of machine learning where the computer analyzes an unlabeled dataset to discover patterns"
    },
    "es-mx": {
      "keywords": [[ "" ]],
      "description": ""
    }
  },
 {
    "en-us": {
      "keywords": [[ "regression" ]],
      "description": "a machine learning algorithm that can be trained to predict continuous real-number outputs"
    },
    "es-mx": {
      "keywords": [[ "" ]],
      "description": ""
    }
  },
 {
    "en-us": {
      "keywords": [[ "statistical language model" ]],
      "description": "a probabilistic model that predicts the likelihood of various word sequences using statistical patterns in data"
    },
    "es-mx": {
      "keywords": [[ "" ]],
      "description": ""
    }
  },
 {
    "en-us": {
      "keywords": [[ "n-gram" ]],
      "description": "a chunk of a given number of words; for special cases where n is 1, 2, or 3, the n-grams are called unigrams, bigrams, and trigrams."
    },
    "es-mx": {
      "keywords": [[ "" ]],
      "description": ""
    }
  },
 {
    "en-us": {
      "keywords": [[ "sampling" ]],
      "description": "randomly selecting the next word in a sequence by referencing a statistical language model "
    },
    "es-mx": {
      "keywords": [[ "" ]],
      "description": ""
    }
  },
 {
    "en-us": {
      "keywords": [[ "temperature" ]],
      "description": "the parameter that controls the randomness of the model’s output as it generates text"
    },
    "es-mx": {
      "keywords": [[ "" ]],
      "description": ""
    }
  }
]
