{
  "SJ.1": {
    "description": "Students will develop positive social identities based on their membership in multiple groups in society",
    "lessons": [
      "computing-needs-all-voices",
      "project-flags"
    ]
  },
  "SJ.2": {
    "description": "Students will develop language and historical and cultural knowledge that affirm and accurately describe their membership in multiple identity groups",
    "lessons": [
      "bar-and-pie-charts",
      "computing-needs-all-voices"
    ]
  },
  "SJ.3": {
    "description": "Students will recognize that people’s multiple identities interact and create unique and complex individuals",
    "lessons": [
      "project-flags"
    ]
  },
  "SJ.4": {
    "description": "Students will express pride, confidence and healthy self-esteem without denying the value and dignity of other people.",
    "lessons": [
      "bar-and-pie-charts",
      "computing-needs-all-voices"
    ]
  },
  "SJ.5": {
    "description": "Students will recognize traits of the dominant culture, their home culture and other cultures and understand how they negotiate their own identity in multiple spaces.",
    "lessons": []
  },
  "SJ.6": {
    "description": "Students will express comfort with people who are both similar to and different from them and engage respectfully with all people.",
    "lessons": []
  },
  "SJ.7": {
    "description": "Students will develop language and knowledge to accurately and respectfully describe how people (including themselves) are both similar to and different from each other and others in their identity groups.",
    "lessons": [
      "project-research-paper",
      "project-data-exploration",
      "bar-and-pie-charts",
      "computing-needs-all-voices"
    ]
  },
  "SJ.8": {
    "description": "Students will respectfully express curiosity about the history and lived experiences of others and will exchange ideas and beliefs in an open-minded way",
    "lessons": [
      "computing-needs-all-voices"
    ]
  },
  "SJ.9": {
    "description": "Students will respond to diversity by building empathy, respect, understanding and connection.",
    "lessons": []
  },
  "SJ.10": {
    "description": "Students will examine diversity in social, cultural, political and historical contexts rather than in ways that are superficial or oversimplified.",
    "lessons": [
      "computing-needs-all-voices"
    ]
  },
  "SJ.11": {
    "description": "Students will recognize stereotypes and relate to people as individuals rather than representatives of groups.",
    "lessons": []
  },
  "SJ.12": {
    "description": "Students will recognize unfairness on the individual level (e.g., biased speech) and injustice at the institutional or systemic level (e.g., discrimination).",
    "lessons": [
      "project-research-paper",
      "ethics-privacy-and-bias",
      "checking-your-work"
    ]
  },
  "SJ.13": {
    "description": "Students will analyze the harmful impact of bias and injustice on the world, historically and today",
    "lessons": [
      "project-research-paper",
      "project-data-exploration",
      "probability-inference",
      "ethics-privacy-and-bias",
      "checking-your-work"
    ]
  },
  "SJ.14": {
    "description": "Students will recognize that power and privilege influence relationships on interpersonal, intergroup and institutional levels and consider how they have been affected by those dynamics.",
    "lessons": [
      "project-research-paper",
      "project-data-exploration",
      "data-collection",
      "checking-your-work"
    ]
  },
  "SJ.15": {
    "description": "Students will identify figures, groups, events and a variety of strategies and philosophies relevant to the history of social justice around the world.",
    "lessons": [
      "checking-your-work"
    ]
  },
  "SJ.16": {
    "description": "Students will express empathy when people are excluded or mistreated because of their identities and concern when they themselves experience bias.",
    "lessons": []
  },
  "SJ.17": {
    "description": "Students will recognize their own responsibility to stand up to exclusion, prejudice and injustice.",
    "lessons": []
  },
  "SJ.18": {
    "description": "Students will speak up with courage and respect when they or someone else has been hurt or wronged by bias.",
    "lessons": []
  },
  "SJ.19": {
    "description": "Students will make principled decisions about when and how to take a stand against bias and injustice in their everyday lives and will do so despite negative peer or group pressure.",
    "lessons": []
  },
  "SJ.20": {
    "description": "Students will plan and carry out collective action against bias and injustice in the world and will evaluate what strategies are most effective.",
    "lessons": []
  }
}
