{
  "MS-SEP1-1": {
    "description": "Ask questions that require sufficient and appropriate empirical evidence to answer.",
    "lessons": []
  },
  "MS-SEP1-2": {
    "description": "Ask questions that arise from careful observation of phenomena, models, or unexpected results, to clarify and/or seek additional information.",
    "lessons": [
      "hoc-data"
    ]
  },
  "MS-SEP1-3": {
    "description": "Ask questions to identify and/or clarify evidence and/or the premise(s) of an argument.",
    "lessons": []
  },
  "MS-SEP1-4": {
    "description": "Ask questions to determine relationships between independent and dependent variables and relationships in models.",
    "lessons": []
  },
  "MS-SEP1-5": {
    "description": "Ask questions to clarify and/or refine a model, an explanation, or an engineering problem.",
    "lessons": []
  },
  "MS-SEP1-6": {
    "description": "Ask questions that can be investigated within the scope of the classroom, outdoor environment, and museums and other public facilities with available resources and, when appropriate, frame a hypothesis based on observations and scientific principles.",
    "lessons": []
  },
  "MS-SEP1-7": {
    "description": "Define a design problem that can be solved through the development of an object, tool, process or system and includes multiple criteria and constraints, including scientific knowledge that may limit possible solutions.",
    "lessons": []
  },
  "MS-SEP1-8": {
    "description": "Ask questions that challenge the premise(s) of an argument or the interpretation of a data set.",
    "lessons": [
      "hoc-data"
    ]
  },
  "HS-SEP1-1": {
    "description": "Ask questions that arise from careful observation of phenomena, or unexpected results, to clarify and/or seek additional information.",
    "lessons": []
  },
  "HS-SEP1-2": {
    "description": "Ask questions that arise from examining models or a theory, to clarify and/or seek additional information and relationships.",
    "lessons": []
  },
  "HS-SEP1-3": {
    "description": "Ask questions to determine relationships, including quantitative relationships, between independent and dependent variables.",
    "lessons": []
  },
  "HS-SEP1-4": {
    "description": "Ask questions to clarify and refine a model, an explanation, or an engineering problem.",
    "lessons": []
  },
  "HS-SEP1-5": {
    "description": "Evaluate a question to determine if it is testable and relevant.",
    "lessons": []
  },
  "HS-SEP1-6": {
    "description": "Ask questions that can be investigated within the scope of the school laboratory, research facilities, or field (e.g., outdoor environment) with available resources and, when appropriate, frame a hypothesis based on a model or theory.",
    "lessons": []
  },
  "HS-SEP1-7": {
    "description": "Ask and/or evaluate questions that challenge the premise(s) of an argument, the interpretation of a data set, or the suitability of the design.",
    "lessons": []
  },
  "HS-SEP1-8": {
    "description": "Define a design problem that involves the development of a process or system with interacting components and criteria and constraints that may include social, technical and/or environmental considerations.",
    "lessons": []
  },
  "HS-SEP1-9": {
    "description": "Analyze complex real-world problems by specifying criteria and constraints for successful solutions.",
    "lessons": []
  },
  "MS-SEP2-1": {
    "description": "Evaluate limitations of a model for a proposed object or tool.",
    "lessons": []
  },
  "MS-SEP2-2": {
    "description": "Develop or modify a model—based on evidence – to match what happens if a variable or component of a system is changed.",
    "lessons": []
  },
  "MS-SEP2-3": {
    "description": "Use and/or develop a model of simple systems with uncertain and less predictable factors.",
    "lessons": []
  },
  "MS-SEP2-4": {
    "description": "Develop and/or revise a model to show the relationships among variables, including those that are not observable but predict observable phenomena.",
    "lessons": []
  },
  "MS-SEP2-5": {
    "description": "Develop and/or use a model to predict and/or describe phenomena.",
    "lessons": []
  },
  "MS-SEP2-6": {
    "description": "Develop a model to describe unobservable mechanisms.",
    "lessons": []
  },
  "MS-SEP2-7": {
    "description": "Develop and/or use a model to generate data to test ideas about phenomena in natural or designed systems, including those representing inputs and outputs, and those at unobservable scales.",
    "lessons": []
  },
  "HS-SEP2-1": {
    "description": "Evaluate merits and limitations of two different models of the same proposed tool, process, mechanism, or system in order to select or revise a model that best fits the evidence or design criteria.",
    "lessons": []
  },
  "HS-SEP2-2": {
    "description": "Design a test of a model to ascertain its reliability.",
    "lessons": []
  },
  "HS-SEP2-3": {
    "description": "Develop, revise, and/or use a model based on evidence to illustrate and/or predict the relationships between systems or between components of a system.",
    "lessons": []
  },
  "HS-SEP2-4": {
    "description": "Develop and/or use multiple types of models to provide mechanistic accounts and/or predict phenomena, and move flexibly between model types based on merits and limitations.",
    "lessons": []
  },
  "HS-SEP2-5": {
    "description": "Use a model to provide mechanistic accounts of phenomena.",
    "lessons": []
  },
  "HS-SEP2-6": {
    "description": "Develop a complex model that allows for manipulation and testing of a proposed process or system.",
    "lessons": []
  },
  "HS-SEP2-7": {
    "description": "Develop and/or use a model (including mathematical and computational) to generate data to support explanations, predict phenomena, analyze systems, and/or solve problems.",
    "lessons": []
  },
  "MS-SEP3-1": {
    "description": "Plan an investigation individually and collaboratively, and in the design: identify independent and dependent variables and controls, what tools are needed to do the gathering, how measurements will be recorded, and how many data are needed to support a claim.",
    "lessons": []
  },
  "MS-SEP3-2": {
    "description": "Conduct an investigation and/or evaluate and/or revise the experimental design to produce data to serve as the basis for evidence that meet the goals of the investigation.",
    "lessons": []
  },
  "MS-SEP3-3": {
    "description": "Evaluate the accuracy of various methods for collecting data.",
    "lessons": []
  },
  "MS-SEP3-4": {
    "description": "Collect data to produce data to serve as the basis for evidence to answer scientific questions or test design solutions under a range of conditions.",
    "lessons": []
  },
  "MS-SEP3-5": {
    "description": "Collect data about the performance of a proposed object, tool, process, or system under a range of conditions.",
    "lessons": []
  },
  "HS-SEP3-1": {
    "description": "Plan an investigation or test a design individually and collaboratively to produce data to serve as the basis for evidence as part of building and revising models, supporting explanations for phenomena, or testing solutions to problems. Consider possible variables or effects and evaluate the confounding investigation’s design to ensure variables are controlled.",
    "lessons": []
  },
  "HS-SEP3-2": {
    "description": "Plan and conduct an investigation individually and collaboratively to produce data to serve as the basis for evidence, and in the design: decide on types, how much, and accuracy of data needed to produce reliable measurements and consider limitations on the precision of the data (e.g., number of trials, cost, risk, time), and refine the design accordingly.",
    "lessons": []
  },
  "HS-SEP3-3": {
    "description": "Plan and conduct an investigation or test a design solution in a safe and ethical manner including considerations of environmental, social, and personal impacts.",
    "lessons": []
  },
  "HS-SEP3-4": {
    "description": "Select appropriate tools to collect, record, analyze, and evaluate data.",
    "lessons": []
  },
  "HS-SEP3-5": {
    "description": "Make directional hypotheses that specify what happens to a dependent variable when an independent variable is manipulated.",
    "lessons": []
  },
  "HS-SEP3-6": {
    "description": "Manipulate variables and collect data about a complex model of a proposed process or system to identify failure points or improve performance relative to criteria for success or other variables.",
    "lessons": []
  },
  "MS-SEP4-1": {
    "description": "Construct, analyze, and/or interpret graphical displays of data and/or large data sets to identify linear and nonlinear relationships.",
    "lessons": []
  },
  "MS-SEP4-2": {
    "description": "Use graphical displays (e.g., maps, charts, graphs, and/or tables) of large data sets to identify temporal and spatial relationships.",
    "lessons": []
  },
  "MS-SEP4-3": {
    "description": "Distinguish between causal and correlational relationships in data.",
    "lessons": []
  },
  "MS-SEP4-4": {
    "description": "Analyze and interpret data to provide evidence for phenomena.",
    "lessons": [
      "hoc-data"
    ]
  },
  "MS-SEP4-5": {
    "description": "Apply concepts of statistics and probability (including mean, median, mode, and variability) to analyze and characterize data, using digital tools when feasible.",
    "lessons": []
  },
  "MS-SEP4-6": {
    "description": "Consider limitations of data analysis (e.g., measurement error), and/or seek to improve precision and accuracy of data with better technological tools and methods (e.g., multiple trials).",
    "lessons": []
  },
  "MS-SEP4-7": {
    "description": "Analyze and interpret data to determine similarities and differences in findings.",
    "lessons": [
      "hoc-data"
    ]
  },
  "MS-SEP4-8": {
    "description": "Analyze data to define an optimal operational range for a proposed object, tool, process or system that best meets criteria for success.",
    "lessons": []
  },
  "HS-SEP4-1": {
    "description": "Analyze data using tools, technologies, and/or models (e.g., computational, mathematical) in order to make valid and reliable scientific claims or determine an optimal design solution.",
    "lessons": []
  },
  "HS-SEP4-2": {
    "description": "Apply concepts of statistics and probability (including determining function fits to data, slope, intercept, and correlation coefficient for linear fits) to scientific and engineering questions and problems, using digital tools when feasible.",
    "lessons": []
  },
  "HS-SEP4-3": {
    "description": "Consider limitations of data analysis (e.g., measurement error, sample selection) when analyzing and interpreting data.",
    "lessons": []
  },
  "HS-SEP4-4": {
    "description": "Compare and contrast various types of data sets (e.g., self-generated, archival) to examine consistency of measurements and observations.",
    "lessons": []
  },
  "HS-SEP4-5": {
    "description": "Evaluate the impact of new data on a working explanation and/or model of a proposed process or system.",
    "lessons": []
  },
  "HS-SEP4-6": {
    "description": "Analyze data to identify design features or characteristics of the components of a proposed process or system to optimize it relative to criteria for success.",
    "lessons": []
  },
  "MS-SEP5-1": {
    "description": "Use digital tools (e.g., computers) to analyze very large data sets for patterns and trends.",
    "lessons": []
  },
  "MS-SEP5-2": {
    "description": "Use mathematical representations to describe and/or support scientific conclusions and design solutions.",
    "lessons": []
  },
  "MS-SEP5-3": {
    "description": "Create algorithms (a series of ordered steps) to solve a problem.",
    "lessons": []
  },
  "MS-SEP5-4": {
    "description": "Apply mathematical concepts and/or processes (such as ratio, rate, percent, basic operations, and simple algebra) to scientific and engineering questions and problems.",
    "lessons": [
      "hoc-data"
    ]
  },
  "MS-SEP5-5": {
    "description": "Use digital tools and/or mathematical concepts and arguments to test and compare proposed solutions to an engineering design problem.",
    "lessons": []
  },
  "HS-SEP5-1": {
    "description": "Create and/or revise a computational model or simulation of a phenomenon, designed device, process, or system.",
    "lessons": []
  },
  "HS-SEP5-2": {
    "description": "Use mathematical, computational, and/or algorithmic representations of phenomena or design solutions to describe and/or support claims and/or explanations.",
    "lessons": [
      "hoc-data"
    ]
  },
  "HS-SEP5-3": {
    "description": "Apply techniques of algebra and functions to represent and solve scientific and engineering problems.",
    "lessons": []
  },
  "HS-SEP5-4": {
    "description": "Use simple limit cases to test mathematical expressions, computer programs, algorithms, or simulations of a process or system to see if a model “makes sense” by comparing the outcomes with what is known about the real world.",
    "lessons": []
  },
  "HS-SEP5-5": {
    "description": "Apply ratios, rates, percentages, and unit conversions in the context of complicated measurement problems involving quantities with derived or compound units (such as mg/mL, kg/m3, acre-feet, etc.).",
    "lessons": []
  },
  "MS-SEP6-1": {
    "description": "Construct an explanation that includes qualitative or quantitative relationships between variables that predict(s) and/or describe(s) phenomena.",
    "lessons": []
  },
  "MS-SEP6-2": {
    "description": "Construct an explanation using models or representations.",
    "lessons": []
  },
  "MS-SEP6-3": {
    "description": "Construct a scientific explanation based on valid and reliable evidence obtained from sources (including the students’ own experiments) and the assumption that theories and laws that describe the natural world operate today as they did in the past and will continue to do so in the future.",
    "lessons": []
  },
  "MS-SEP6-4": {
    "description": "Apply scientific ideas, principles, and/or evidence to construct, revise and/or use an explanation for real-world phenomena, examples, or events.",
    "lessons": []
  },
  "MS-SEP6-5": {
    "description": "Apply scientific reasoning to show why the data or evidence is adequate for the explanation or conclusion.",
    "lessons": []
  },
  "MS-SEP6-6": {
    "description": "Apply scientific ideas or principles to design, construct, and/or test a design of an object, tool, process or system.",
    "lessons": []
  },
  "MS-SEP6-7": {
    "description": "Undertake a design project, engaging in the design cycle, to construct and/or implement a solution that meets specific design criteria and constraints.",
    "lessons": []
  },
  "MS-SEP6-8": {
    "description": "Optimize performance of a design by prioritizing criteria, making tradeoffs, testing, revising, and re-testing.",
    "lessons": []
  },
  "HS-SEP6-1": {
    "description": "Make a quantitative and/or qualitative claim regarding the relationship between dependent and independent variables.",
    "lessons": []
  },
  "HS-SEP6-2": {
    "description": "Construct and revise an explanation based on valid and reliable evidence obtained from a variety of sources (including students’ own investigations, models, theories, simulations, peer review) and the assumption that theories and laws that describe the natural world operate today as they did in the past and will continue to do so in the future.",
    "lessons": []
  },
  "HS-SEP6-3": {
    "description": "Apply scientific ideas, principles, and/or evidence to provide an explanation of phenomena and solve design problems, taking into account possible unanticipated effects.",
    "lessons": []
  },
  "HS-SEP6-4": {
    "description": "Apply scientific reasoning, theory, and/or models to link evidence to the claims to assess the extent to which the reasoning and data support the explanation or conclusion.",
    "lessons": []
  },
  "HS-SEP6-5": {
    "description": "Design, evaluate, and/or refine a solution to a complex real-world problem, based on scientific knowledge, student-generated sources of evidence, prioritized criteria, and tradeoff considerations.",
    "lessons": []
  },
  "MS-SEP7-1": {
    "description": "Compare and critique two arguments on the same topic and analyze whether they emphasize similar or different evidence and/or interpretations of facts.",
    "lessons": []
  },
  "MS-SEP7-2": {
    "description": "Respectfully provide and receive critiques about one’s explanations, procedures, models and questions by citing relevant evidence and posing and responding to questions that elicit pertinent elaboration and detail.",
    "lessons": []
  },
  "MS-SEP7-3": {
    "description": "Construct, use, and/or present an oral and written argument supported by empirical evidence and scientific reasoning to support or refute an explanation or a model for a phenomenon or a solution to a problem.",
    "lessons": []
  },
  "MS-SEP7-4": {
    "description": "Make an oral or written argument that supports or refutes the advertised performance of a device, process, or system, based on empirical evidence concerning whether or not the technology meets relevant criteria and constraints.",
    "lessons": []
  },
  "MS-SEP7-5": {
    "description": "Evaluate competing design solutions based on jointly developed and agreed-upon design criteria.",
    "lessons": []
  },
  "HS-SEP7-1": {
    "description": "Compare and evaluate competing arguments or design solutions in light of currently accepted explanations, new evidence, limitations (e.g., trade-offs), constraints, and ethical issues.",
    "lessons": []
  },
  "HS-SEP7-2": {
    "description": "Evaluate the claims, evidence, and/or reasoning behind currently accepted explanations or solutions to determine the merits of arguments.",
    "lessons": []
  },
  "HS-SEP7-3": {
    "description": "Respectfully provide and/or receive critiques on scientific arguments by probing reasoning and evidence and challenging ideas and conclusions, responding thoughtfully to diverse perspectives, and determining what additional information is required to resolve contradictions.",
    "lessons": []
  },
  "HS-SEP7-4": {
    "description": "Construct, use, and/or present an oral and written argument or counter-arguments based on data and evidence.",
    "lessons": []
  },
  "HS-SEP7-5": {
    "description": "Make and defend a claim based on evidence about the natural world or the effectiveness of a design solution that reflects scientific knowledge, and student-generated evidence.",
    "lessons": []
  },
  "HS-SEP7-6": {
    "description": "Evaluate competing design solutions to a real-world problem based on scientific ideas and principles, empirical evidence, and logical arguments regarding relevant factors (e.g. economic, societal, environmental, ethical considerations).",
    "lessons": []
  },
  "MS-SEP8-1": {
    "description": "Critically read scientific texts adapted for classroom use to determine the central ideas and/or obtain scientific and/or technical information to describe patterns in and/or evidence about the natural and designed world(s).",
    "lessons": []
  },
  "MS-SEP8-2": {
    "description": "Integrate qualitative and/or quantitative scientific and/or technical information in written text with that contained in media and visual displays to clarify claims and findings.",
    "lessons": []
  },
  "MS-SEP8-3": {
    "description": "Gather, read, synthesize information from multiple appropriate sources and assess the credibility, accuracy, and possible bias of each publication and methods used, and describe how they are supported or not supported by evidence.",
    "lessons": []
  },
  "MS-SEP8-4": {
    "description": "Evaluate data, hypotheses, and/or conclusions in scientific and technical texts in light of competing information or accounts.",
    "lessons": []
  },
  "MS-SEP8-5": {
    "description": "Communicate scientific and/or technical information (e.g. about a proposed object, tool, process, system) in writing and/or through oral presentations.",
    "lessons": []
  },
  "HS-SEP8-1": {
    "description": "Critically read scientific literature adapted for classroom use to determine the central ideas or conclusions and/or to obtain scientific and/or technical information to summarize complex evidence, concepts, processes, or information presented in a text by paraphrasing them in simpler but still accurate terms.",
    "lessons": []
  },
  "HS-SEP8-2": {
    "description": "Compare, integrate and evaluate sources of information presented in different media or formats (e.g., visually, quantitatively) as well as in words in order to address a scientific question or solve a problem.",
    "lessons": []
  },
  "HS-SEP8-3": {
    "description": "Gather, read, and evaluate scientific and/or technical information from multiple authoritative sources, assessing the evidence and usefulness of each source.",
    "lessons": []
  },
  "HS-SEP8-4": {
    "description": "Evaluate the validity and reliability of and/or synthesize multiple claims, methods, and/or designs that appear in scientific and technical texts or media reports, verifying the data when possible.",
    "lessons": []
  },
  "HS-SEP8-5": {
    "description": "Communicate scientific and/or technical information or ideas (e.g. about phenomena and/or the process of development and the design and performance of a proposed process or system) in multiple formats (including orally, graphically, textually, and mathematically).",
    "lessons": []
  }
}
