{
  "21.6-8.ES.1": {
    "description": "Communicate and work productively with others, considering different perspectives, and cultural views to increase the quality of work.",
    "lessons": ["computing-needs-all-voices"]
  },
  "21.6-8.ES.2": {
    "description": "Adapt and adjust to various roles and responsibilities in an environment of change.",
    "lessons": []
  },
  "21.6-8.ES.3": {
    "description": "Demonstrate leadership, integrity, ethical behavior, and social responsibility in all environments.",
    "lessons": []
  },
  "21.6-8.ES.4": {
    "description": "Demonstrate initiative, self–direction, creativity, and entrepreneurial thinking while exploring individual talents and skills necessary to be successful.",
    "lessons": []
  },
  "21.6-8.ES.5": {
    "description": "Demonstrate productivity and accountability while aspiring to meet high expectations.",
    "lessons": []
  },
  "21.6-8.TL.1": {
    "description": "Demonstrate creative thinking in the design and development of innovative technology products and problem solving.",
    "lessons": []
  },
  "21.6-8.TL.2": {
    "description": "Collaborate with peers, experts, and others using interactive technology.",
    "lessons": []
  },
  "21.6-8.TL.3": {
    "description": "Plan strategies utilizing digital tools to gather, evaluate, and use information.",
    "lessons": []
  },
  "21.6-8.TL.4": {
    "description": "Use critical thinking skills to conduct research, solve problems, and make informed decisions using appropriate technological tools and resources.",
    "lessons": ["project-data-exploration", "project-research-paper"]
  },
  "21.6-8.TL.5": {
    "description": "Understand the legal and ethical issues of technology as related to individuals, cultures, and societies.",
    "lessons": ["ethics-privacy-and-bias"]
  },
  "21.6-8.TL.6": {
    "description": "Understand the underlying structure and application of technology systems.",
    "lessons": []
  },
  "21.9-12.ES.1": {
    "description": "Communicate and work productively with others, incorporating different perspectives and cross cultural understanding, to increase innovation and the quality of work.",
    "lessons": ["computing-needs-all-voices"]
  },
  "21.9-12.ES.2": {
    "description": "Adapt to various roles and responsibilities and work flexibly in climates of ambiguity and changing priorities.",
    "lessons": []
  },
  "21.9-12.ES.3": {
    "description": "Demonstrate leadership skills, integrity, ethical behavior, and social responsibility while collaborating to achieve common goals.",
    "lessons": []
  },
  "21.9-12.ES.4": {
    "description": "Demonstrate initiative and self–direction through high achievement and lifelong learning while exploring the ways individual talents and skills can be used for productive outcomes in personal and professional life.",
    "lessons": []
  },
  "21.9-12.ES.5": {
    "description": "Demonstrate productivity and accountability by meeting high expectations.",
    "lessons": []
  },
  "21.9-12.TL.1": {
    "description": "Demonstrate creative thinking, construct knowledge, and develop innovative products and processes using technology.",
    "lessons": []
  },
  "21.9-12.TL.2": {
    "description": "Use digital media and environments to communicate and work collaboratively, including at a distance, to support individual learning and contribute to the learning of others.",
    "lessons": []
  },
  "21.9-12.TL.3": {
    "description": "Apply digital tools to gather, evaluate, and use information.",
    "lessons": []
  },
  "21.9-12.TL.4": {
    "description": "Demonstrate critical thinking skills using appropriate tools and resources to plan and conduct research, manage projects, solve problems and make informed decisions.",
    "lessons": []
  },
  "21.9-12.TL.5": {
    "description": "Understand human, cultural, and societal issues related to technology and practice legal and ethical behavior.",
    "lessons": ["ethics-privacy-and-bias"]
  },
  "21.9-12.TL.6": {
    "description": "Demonstrate a sound understanding of technology concepts, systems and operations.",
    "lessons": []
  }
}
