{
  "K-2.CAS.a.1": {
    "description": "Demonstrate proper ergonomics (e.g., body position, stretching) when using devices.",
    "lessons": []
  },
  "K-2.CAS.a.2": {
    "description": "Use electrical devices safely and in moderation (e.g., unplug devices by pulling the plug rather than the cord, do not mix water/food and electric devices, avoid gaming and walking).",
    "lessons": []
  },
  "K-2.CAS.a.3": {
    "description": "Care for devices appropriately (e.g., handling devices gently, completely shutting down devices when not in use, storing devices in the appropriate container).",
    "lessons": []
  },
  "K-2.CAS.a.4": {
    "description": "Explain that a password helps protect the privacy of information.",
    "lessons": []
  },
  "K-2.CAS.a.5": {
    "description": "Identify safe and unsafe examples of online communications.",
    "lessons": []
  },
  "K-2.CAS.a.6": {
    "description": "Explain why we keep personal information (e.g., name, location, phone number, home address) private.",
    "lessons": []
  },
  "K-2.CAS.a.7": {
    "description": "Identify which personal information (e.g., user name or real name, school name or home address) should and should not be shared online and with whom.",
    "lessons": []
  },
  "K-2.CAS.a.8": {
    "description": "Explain why it is necessary to report inappropriate electronic content or contact.",
    "lessons": []
  },
  "K-2.CAS.b.1": {
    "description": "Define good digital citizenship as using technology safely, responsibly, and ethically.",
    "lessons": []
  },
  "K-2.CAS.b.2": {
    "description": "Demonstrate responsible use of computers, peripheral devices, and resources as outlined in school rules (Acceptable Use Policy [AUP] for K-2).",
    "lessons": []
  },
  "K-2.CAS.b.3": {
    "description": "Explain that most digital artifacts have owners.",
    "lessons": []
  },
  "K-2.CAS.b.4": {
    "description": "Explain the importance of giving credit to media creators/owners when using their work.",
    "lessons": []
  },
  "K-2.CAS.c.1": {
    "description": "Identify and describe how people (e.g., students, parents, police officers) use many types of technologies in their daily work and personal lives.",
    "lessons": []
  },
  "K-2.CAS.c.2": {
    "description": "Recognize when the purpose of content is to provide information or to influence you to act.",
    "lessons": []
  },
  "K-2.DTC.a.1": {
    "description": "Operate a variety of digital tools (e.g., open/close, find, save/print, navigate, use input/output devices).",
    "lessons": []
  },
  "K-2.DTC.a.2": {
    "description": "Identify, locate, and use letters, numbers, and special keys on a keyboard (e.g., Space Bar, Shift, Delete).",
    "lessons": []
  },
  "K-2.DTC.a.3": {
    "description": "Create a simple digital artifact.",
    "lessons": []
  },
  "K-2.DTC.a.4": {
    "description": "Use appropriate digital tools individually and collaboratively to create, review, and revise simple artifacts that include text, images and audio.",
    "lessons": []
  },
  "K-2.DTC.b.1": {
    "description": "Collaboratively use digital tools and media resources to communicate key ideas and details in a way that informs, persuades, and/or entertains.",
    "lessons": []
  },
  "K-2.DTC.b.2": {
    "description": "Use a variety of digital tools to exchange information and feedback with teachers.",
    "lessons": []
  },
  "K-2.DTC.b.3": {
    "description": "Use a variety of digital tools to present information to others.",
    "lessons": []
  },
  "K-2.DTC.c.1": {
    "description": "Conduct basic keyword searches to gather information from teacher-provided digital sources (e.g., online library catalog, databases).",
    "lessons": []
  },
  "K-2.DTC.c.2": {
    "description": "Create an artifact individually and collaboratively that answers a research question, while clearly expressing thoughts and ideas.",
    "lessons": []
  },
  "K-2.DTC.c.3": {
    "description": "Acknowledge and name sources of information or media (e.g., title of book, author of book, website).",
    "lessons": []
  },
  "K-2.CS.a.1": {
    "description": "Identify different kinds of computing devices in the classroom and other places (e.g., laptops, tablets, smart phones, desktops).",
    "lessons": []
  },
  "K-2.CS.a.2": {
    "description": "Identify visible components of computing devices (e.g., keyboard, screen, monitor, printer, pointing device).",
    "lessons": []
  },
  "K-2.CS.a.3": {
    "description": "Explain that computing devices function when applications, programs, or commands are executed.",
    "lessons": []
  },
  "K-2.CS.a.4": {
    "description": "Operate a variety of computing systems (e.g., turn on, use input/output devices such as a mouse, keyboard, or touch screen; find, navigate, launch a program).",
    "lessons": []
  },
  "K-2.CS.b.1": {
    "description": "Explain that computing devices are machines that are not alive, but can be used to help humans with tasks.",
    "lessons": []
  },
  "K-2.CS.b.2": {
    "description": "Recognize that some tasks are best completed by humans and others by computing devices (e.g., a human might be able to rescue someone in a normal environment, but robots would be better to use in a dangerous environment).",
    "lessons": []
  },
  "K-2.CS.b.3": {
    "description": "Recognize that different tools can solve the same problem (e.g., pen and paper, calculators, and smart phones can all be used to solve simple mathematical problems).",
    "lessons": []
  },
  "K-2.CS.c.1": {
    "description": "Explain that networks link computers and devices locally and around the world allowing people to access and communicate information.",
    "lessons": []
  },
  "K-2.CT.a.1": {
    "description": "List the attributes of a common object, for example, cars have a color, type (e.g., pickup, van, sedan), number of seats, etc.",
    "lessons": []
  },
  "K-2.CT.b.1": {
    "description": "Define an algorithm as a sequence of defined steps.",
    "lessons": []
  },
  "K-2.CT.b.2": {
    "description": "Create a simple algorithm, individually and collaboratively, without using computers to complete a task (e.g., making a sandwich, getting ready for school, checking a book out of the library).",
    "lessons": []
  },
  "K-2.CT.b.3": {
    "description": "Enact an algorithm using tangible materials (e.g., manipulatives, your body) or present the algorithm in a visual medium (e.g., storyboard).",
    "lessons": []
  },
  "K-2.CT.c.1": {
    "description": "Identify different kinds of information (e.g., text, charts, graphs, numbers, pictures, audio, video, collections of objects).",
    "lessons": []
  },
  "K-2.CT.c.2": {
    "description": "Identify, research, and collect information on a topic, issue, problem, or question using age-appropriate digital technologies.",
    "lessons": []
  },
  "K-2.CT.c.3": {
    "description": "Individually and collaboratively propose a solution to a problem or question based on an analysis of information.",
    "lessons": []
  },
  "K-2.CT.c.4": {
    "description": "Individually and collaboratively create information visualizations (e.g., charts, infographics).",
    "lessons": []
  },
  "K-2.CT.c.5": {
    "description": "Explain that computers can save information as data that can be stored, searched, retrieved, and deleted.",
    "lessons": []
  },
  "K-2.CT.d.1": {
    "description": "Define a computer program as a set of commands created by people to do something.",
    "lessons": []
  },
  "K-2.CT.d.2": {
    "description": "Explain that computers only follow the programÕs instructions.",
    "lessons": []
  },
  "K-2.CT.d.3": {
    "description": "Individually or collaboratively create a simple program using visual instructions or tools that do not require a textual programming language (e.g., ÒunpluggedÓ programming activities, a block-based programming language).",
    "lessons": []
  },
  "K-2.CT.e.1": {
    "description": "Describe how models represent a real-life system (e.g., globe, map, solar system, digital elevation model, weather map).",
    "lessons": []
  },
  "K-2.CT.e.2": {
    "description": "Define simulation and identify the concepts illustrated by a simple simulation (e.g., growth and health, butterfly life cycle).",
    "lessons": []
  },
  "3-5.CAS.a.1": {
    "description": "Describe how to use proper ergonomics (e.g., body position, lighting, positioning of equipment, taking breaks) when using devices.",
    "lessons": []
  },
  "3-5.CAS.a.2": {
    "description": "Describe the threats to safe and efficient use of devices (e.g., SPAM, spyware, phishing, viruses) associated with various forms of technology use (e.g., downloading and executing software programs, following hyperlinks, opening files).",
    "lessons": []
  },
  "3-5.CAS.a.3": {
    "description": "Identify appropriate and inappropriate uses of technology when posting to social media, sending e-mail or texts, and browsing the Internet.",
    "lessons": []
  },
  "3-5.CAS.a.4": {
    "description": "Explain the proper use and operation of security technologies (e.g., passwords, virus protection software, spam filters, popup blockers, cookies).",
    "lessons": []
  },
  "3-5.CAS.a.5": {
    "description": "Describe ways to employ safe practices and avoid the potential risks/dangers associated with various forms of online communications, downloads, linking, Internet purchases, advertisements, and inappropriate content within constrained environments.",
    "lessons": []
  },
  "3-5.CAS.a.6": {
    "description": "Identify different types of cyberbullying (e.g., harassment, flaming, excluding people, outing, and impersonation).",
    "lessons": []
  },
  "3-5.CAS.a.7": {
    "description": "Explain that if you encounter cyberbullying or other inappropriate content, you should immediately tell a responsible adult (e.g., teacher, parent).",
    "lessons": []
  },
  "3-5.CAS.b.1": {
    "description": "Demonstrate responsible use of computers, peripheral devices, and resources as outlined in school rules (Acceptable Use Policy [AUP]).",
    "lessons": []
  },
  "3-5.CAS.b.2": {
    "description": "Describe the difference between digital artifacts that are open or free and those that are protected by copyright.",
    "lessons": [
      "making-game-images"
    ]
  },
  "3-5.CAS.b.3": {
    "description": "Explain the guidelines for the fair use of downloading, sharing, or modifying of digital artifacts",
    "lessons": []
  },
  "3-5.CAS.b.4": {
    "description": "Describe the purpose of copyright and the possible consequences for inappropriate use of digital artifacts that are protected by copyright.",
    "lessons": []
  },
  "3-5.CAS.b.5": {
    "description": "Explain that laws exist (e.g., Section 508, Telecommunication Act of 1996) that help ensure that people with disabilities can access electronic and information technology.",
    "lessons": []
  },
  "3-5.CAS.c.1": {
    "description": "Explain the different forms of web advertising (e.g., search ads, pay-per-click ads, banner ads, targeted ads, in-game ads, e-mail ads).",
    "lessons": []
  },
  "3-5.CAS.c.2": {
    "description": "Explain why websites, digital resources, and artifacts may include advertisements and collect personal information.",
    "lessons": []
  },
  "3-5.CAS.c.3": {
    "description": "Define the digital divide as unequal access to technology on the basis of differences, such as income, education, age, and geographic location.",
    "lessons": []
  },
  "3-5.CAS.c.4": {
    "description": "Use critical thinking to explain how access to technology helps empower individuals and groups (e.g., gives them access to information, the ability to communicate with others around the world, allows them to buy and sell things).",
    "lessons": []
  },
  "3-5.CAS.c.5": {
    "description": "Identify resources in the community that can give people access to technology (e.g., libraries, community centers, education programs, schools, hardware/software donation programs).",
    "lessons": []
  },
  "3-5.CAS.c.6": {
    "description": "Identify ways in which people with disabilities access and use technology (e.g., audio players and recorders, FM listening systems, magnifiers).",
    "lessons": []
  },
  "3-5.CAS.c.7": {
    "description": "Identify the impact of social media and cyberbullying on individuals, families, and society.",
    "lessons": []
  },
  "3-5.DTC.a.1": {
    "description": "Type five words-per-minute times grade level (e.g., for Grade 5, type 25 words/minute).",
    "lessons": []
  },
  "3-5.DTC.a.2": {
    "description": "Navigate between local, networked, or online/cloud environments and transfer files between each (upload/download).",
    "lessons": []
  },
  "3-5.DTC.a.3": {
    "description": "Use digital tools (local and online) to manipulate and publish multimedia artifacts.",
    "lessons": []
  },
  "3-5.DTC.b.1": {
    "description": "Communicate key ideas and details individually or collaboratively in a way that informs, persuades, and/or entertains using digital tools and media-rich resources",
    "lessons": []
  },
  "3-5.DTC.b.2": {
    "description": "Collaborate through online digital tools under teacher supervision.",
    "lessons": []
  },
  "3-5.DTC.c.1": {
    "description": "Identify digital information sources to answer research questions (e.g., online library catalog, online encyclopedias, databases, websites).",
    "lessons": []
  },
  "3-5.DTC.c.2": {
    "description": "Perform searches to locate information using two or more key words and techniques to refine and limit such searches.",
    "lessons": []
  },
  "3-5.DTC.c.3": {
    "description": "Evaluate digital sources for accuracy, relevancy, and appropriateness.",
    "lessons": []
  },
  "3-5.DTC.c.4": {
    "description": "Gather and organize information from digital sources by quoting, paraphrasing, and/or summarizing.",
    "lessons": []
  },
  "3-5.DTC.c.5": {
    "description": "Create an artifact that answers a research question and clearly communicates thoughts and ideas.",
    "lessons": []
  },
  "3-5.DTC.c.6": {
    "description": "Cite text-based sources using a school- or district-adopted format.",
    "lessons": []
  },
  "3-5.DTC.c.7": {
    "description": "Provide basic source information (e.g., Uniform Resource Locator [URL], date accessed) for non-text-based sources (e.g., images, audio, video).",
    "lessons": []
  },
  "3-5.CS.a.1": {
    "description": "Identify a broad range of computing devices (e.g., computers, smart phones, tablets, robots, e-textiles) and appropriate uses for them.",
    "lessons": []
  },
  "3-5.CS.a.2": {
    "description": "Describe the function and purpose of various input and output devices (e.g., monitor, keyboard, speakers, controller, probes, sensors, Bluetooth transmitters, synthesizers).",
    "lessons": []
  },
  "3-5.CS.a.3": {
    "description": "Demonstrate an appropriate level of proficiency (connect and record data, print, send command, connect to Internet, search) in using a range of computing devices (e.g., probes, sensors, printers, robots, computers).",
    "lessons": []
  },
  "3-5.CS.a.4": {
    "description": "Identify and solve simple hardware and software problems that may occur during everyday use (e.g., power, connections, application window or toolbar).",
    "lessons": []
  },
  "3-5.CS.a.5": {
    "description": "Describe the differences between hardware and software.",
    "lessons": []
  },
  "3-5.CS.a.6": {
    "description": "Identify and explain that some computing functions are always active (e.g., locations function on smart phones).",
    "lessons": []
  },
  "3-5.CS.b.1": {
    "description": "Compare and contrast human and computer performance on similar tasks (e.g., sorting alphabetically, finding a path across a cluttered room) to understand which is best suited to the task.",
    "lessons": []
  },
  "3-5.CS.b.2": {
    "description": "Explain how hardware and applications (e.g., Global Positioning System [GPS] navigation for driving directions, text-to-speech translation, language translation) can enable everyone, including people with disabilities, to do things they could not do otherwise.",
    "lessons": []
  },
  "3-5.CS.b.3": {
    "description": "Explain advantages and limitations of technology (e.g., a spell-checker can check thousands of words faster than a human could look them up, however, a spell-checker might not know whether ÔunderservedÕ is correct or if the authorÕs intent was to type Ôundeserved.Õ",
      "lessons": []
  },
  "3-5.CS.c.1": {
    "description": "Describe how a network is made up of a variety of components and identify the common components (e.g., links, nodes, networking devices).",
    "lessons": []
  },
  "3-5.CS.c.2": {
    "description": "Describe the need for authentication of users and devices as it relates to access permissions, privacy, and security.",
    "lessons": []
  },
  "3-5.CS.c.3": {
    "description": "Define and explain why devices are numbered/labeled in networks (e.g., the World Wide Web Uniform Resource Locator [URL], the Internet Protocol [IP] address, the Machine Access Code [MAC]).",
    "lessons": []
  },
  "3-5.CS.c.4": {
    "description": "Recognize that there are many sources of and means for accessing information within a network (e.g., websites, e-mail protocols, search engines)",
    "lessons": []
  },
  "3-5.CS.d.1": {
    "description": "Identify common services (e.g., driving directions apps that access remote map services, digital personal assistants that access remote information services).",
    "lessons": []
  },
  "3-5.CT.a.1": {
    "description": "Use numbers or letters to represent information in another form (e.g., secret codes, Roman numerals, abbreviations).",
    "lessons": []
  },
  "3-5.CT.a.2": {
    "description": "Organize information in different ways to make it more useful/relevant (e.g., sorting, tables).",
    "lessons": []
  },
  "3-5.CT.a.3": {
    "description": "Make a list of sub-problems to consider, while addressing a larger problem.",
    "lessons": []
  },
  "3-5.CT.b.1": {
    "description": "Define an algorithm as a sequence of instructions that can be processed by a computer.",
    "lessons": []
  },
  "3-5.CT.b.2": {
    "description": "Recognize that different solutions exist for the same problem (or sub-problem).",
    "lessons": []
  },
  "3-5.CT.b.3": {
    "description": "Use logical reasoning to predict outcomes of an algorithm.",
    "lessons": []
  },
  "3-5.CT.b.4": {
    "description": "Individually and collaboratively create an algorithm to solve a problem (e.g., move a character/robot/person through a maze).",
    "lessons": []
  },
  "3-5.CT.b.5": {
    "description": "Detect and correct logical errors in various algorithms (e.g., written, mapped, live action, or digital).",
    "lessons": []
  },
  "3-5.CT.c.1": {
    "description": "Describe examples of databases from everyday life (e.g., library catalogs, school records, telephone directories, contact lists).",
    "lessons": []
  },
  "3-5.CT.c.2": {
    "description": "Individually and collaboratively collect and manipulate data to answer a question using a variety of computing methods (e.g., sorting, totaling, averaging) and tools (such as a spreadsheet) to collect, organize, graph, and analyze data.",
    "lessons": []
  },
  "3-5.CT.d.1": {
    "description": "Individually and collaboratively create, test, and modify a program in a graphical environment (e.g., block-based visual programming language).",
    "lessons": []
  },
  "3-5.CT.d.2": {
    "description": "Use arithmetic operators, conditionals, and repetition in programs.",
    "lessons": []
  },
  "3-5.CT.d.3": {
    "description": "Use interactive debugging to detect and correct simple program errors.",
    "lessons": []
  },
  "3-5.CT.d.4": {
    "description": "Recognize that programs need known starting values (e.g., set initial score to zero in a game).",
    "lessons": []
  },
  "3-5.CT.e.1": {
    "description": "Individually and collaboratively create a simple model of a system (e.g., water cycle, solar system) and explain what the model shows and does not show.",
    "lessons": []
  },
  "3-5.CT.e.2": {
    "description": "Identify the concepts, features, and behaviors illustrated by a simulation (e.g., object motion, weather, ecosystem, predator/prey) and those that were not included.",
    "lessons": []
  },
  "3-5.CT.e.3": {
    "description": "Individually and collaboratively use data from a simulation to answer a question.",
    "lessons": []
  },
  "6-8.CAS.a.1": {
    "description": "Identify threats and actively protect devices and networks from viruses, intrusion, vandalism, and other malicious activities.",
    "lessons": []
  },
  "6-8.CAS.a.2": {
    "description": "Describe how cyberbullying can be prevented and managed.",
    "lessons": []
  },
  "6-8.CAS.a.3": {
    "description": "Explain the connection between the persistence of data on the Internet, personal online identity, and personal privacy.",
    "lessons": []
  },
  "6-8.CAS.a.4": {
    "description": "Describe and use safe, appropriate, and responsible practices (netiquette) when participating in online communities (e.g., discussion groups, blogs, social networking sites).",
    "lessons": []
  },
  "6-8.CAS.a.5": {
    "description": "Differentiate between appropriate and inappropriate content on the Internet.",
    "lessons": []
  },
  "6-8.CAS.b.1": {
    "description": "Explain how copyright law and licensing protect the owner of intellectual property.",
    "lessons": [
      "making-game-images"
    ]
  },
  "6-8.CAS.b.2": {
    "description": "Explain possible consequences of violating intellectual property law and plagiarism.",
    "lessons": []
  },
  "6-8.CAS.b.3": {
    "description": "Apply fair use for using copyrighted materials (e.g., images, music, video, text).",
    "lessons": []
  },
  "6-8.CAS.b.4": {
    "description": "Identify the legal consequences of sending or receiving inappropriate content (e.g., cyberbullying, harassment, sexting).",
    "lessons": []
  },
  "6-8.CAS.b.5": {
    "description": "Differentiate among open source and proprietary software licenses and their  applicability to different types of software and media.",
    "lessons": []
  },
  "6-8.CAS.b.6": {
    "description": "Demonstrate compliance with the schoolÕs Acceptable Use Policy [AUP].",
    "lessons": []
  },
  "6-8.CAS.b.7": {
    "description": "Identify software license agreements and application permissions.",
    "lessons": []
  },
  "6-8.CAS.b.8": {
    "description": "Explain positive and malicious purposes of hacking.",
    "lessons": []
  },
  "6-8.CAS.b.9": {
    "description": "License original content and extend license for sharing in the public domain (e.g., creative commons).",
    "lessons": []
  },
  "6-8.CAS.c.1": {
    "description": "Describe current events and emerging technologies in computing and the effects they may have on education, the workplace, individuals, communities, and global society.",
    "lessons": []
  },
  "6-8.CAS.c.2": {
    "description": "Identify and discuss the technology proficiencies needed in the classroom and the workplace, and how to meet the needs.",
    "lessons": []
  },
  "6-8.CAS.c.3": {
    "description": "Relate the distribution of computing resources in a global society to issues of equity, access, and power.",
    "lessons": []
  },
  "6-8.CAS.c.4": {
    "description": "Evaluate how media and technology can be used to distort, exaggerate, and misrepresent information.",
    "lessons": [
      "measures-of-center",
      "threats-to-validity"
    ]
  },
  "6-8.CAS.c.5": {
    "description": "Evaluate the bias of digital information sources, including websites.",
    "lessons": []
  },
  "6-8.DTC.a.1": {
    "description": "Identify and explain the strengths, weaknesses, and capabilities of a variety of digital tools.",
    "lessons": []
  },
  "6-8.DTC.a.2": {
    "description": "Identify the kinds of content associated with different file types and why different file types exist (e.g., formats for word processing, images, music, three-dimensional drawings.).",
    "lessons": []
  },
  "6-8.DTC.a.3": {
    "description": "Integrate information from multiple file formats into a single artifact.",
    "lessons": []
  },
  "6-8.DTC.a.4": {
    "description": "Individually and collaboratively use advanced tools to design and create online content (e.g., digital portfolio, multimedia, blog, webpage).",
    "lessons": [
      "making-game-images",
      "functions-for-character-animation",
      "inequalities3-sam",
      "inequalities-collision",
      "distance",
      "player-animation",
      "project-video-game"
    ]
  },
  "6-8.DTC.a.5": {
    "description": "Individually and collaboratively develop and conduct an online survey.",
    "lessons": [
      "data-collection"
    ]
  },
  "6-8.DTC.b.1": {
    "description": "Communicate and publish key ideas and details individually or collaboratively in a way that informs, persuades, and/or entertains using a variety of digital tools and media-rich resources.",
    "lessons": [
      "project-research-paper"
    ]
  },
  "6-8.DTC.b.2": {
    "description": "Collaborate synchronously and asynchronously through online digital tools.",
    "lessons": []
  },
  "6-8.DTC.b.3": {
    "description": "Demonstrate ability to communicate appropriately through various online tools (e.g., email, social media, texting, blog comments).",
    "lessons": []
  },
  "6-8.DTC.c.1": {
    "description": "Perform advanced searches to locate information using a variety of digital sources (e.g., Boolean Operators, limiters like reading level, subject, media type).",
    "lessons": []
  },
  "6-8.DTC.c.2": {
    "description": "Evaluate quality of digital sources for reliability, including currency, relevancy, authority, accuracy, and purpose of digital information.",
    "lessons": []
  },
  "6-8.DTC.c.3": {
    "description": "Gather, organize, and analyze information from digital sources by quoting, paraphrasing, and/or summarizing.",
    "lessons": []
  },
  "6-8.DTC.c.4": {
    "description": "Create an artifact, individually and collaboratively, that answers a research question and communicates results and conclusions.",
    "lessons": [
      "project-research-paper"
    ]
  },
  "6-8.DTC.c.5": {
    "description": "Use digital citation tools to cite sources using a school- or district-adopted format (e.g., Modern Language Association [MLA]), including proper citation for all text and nontext sources (e.g., images, audio, video).",
    "lessons": []
  },
  "6-8.CS.a.1": {
    "description": "Describe the main functions of an operating system.",
    "lessons": []
  },
  "6-8.CS.a.2": {
    "description": "Recognize that there is a wide range of application software.",
    "lessons": []
  },
  "6-8.CS.a.3": {
    "description": "Identify and describe the function of the main internal parts of a basic computing device (e.g., motherboard, hard drive, Central Processing Unit [CPU]).",
    "lessons": []
  },
  "6-8.CS.a.4": {
    "description": "Identify and describe the use of sensors, actuators, and control systems in an embodied system (e.g., a robot, an e-textile, installation art, smart room).",
    "lessons": []
  },
  "6-8.CS.a.5": {
    "description": "Individually and collaboratively design and demonstrate the use of a device (e.g., robot, e-textile) to accomplish a task.",
    "lessons": []
  },
  "6-8.CS.a.6": {
    "description": "Use a variety of computing devices (e.g., probes, sensors, handheld devices, Global Positioning System [GPS]) to individually and collaboratively collect, analyze, and present information for content-related problems.",
    "lessons": []
  },
  "6-8.CS.a.7": {
    "description": "Identify steps involved in diagnosing and solving routine hardware and software problems (e.g., power, connections, application window or toolbar, cables, ports, network resources, video, sound) that occur during everyday computer use.",
    "lessons": []
  },
  "6-8.CS.b.1": {
    "description": "Explain why some problems can be solved more easily by computers or humans based on a general understanding of types of tasks at which each excels.",
    "lessons": []
  },
  "6-8.CS.b.2": {
    "description": "Describe how humans and machines interact to solve problems that cannot be solved by either alone (e.g., Òbig dataÓ experiments that involve drawing conclusions by analyzing vast amounts of data).",
    "lessons": []
  },
  "6-8.CS.c.1": {
    "description": "Explain the difference between physical (wired), local and wide area, wireless, and mobile networks.",
    "lessons": []
  },
  "6-8.CS.c.2": {
    "description": "Model the components of a network, including devices, routers, switches, cables, wires, and transponders.",
    "lessons": []
  },
  "6-8.CS.c.3": {
    "description": "Describe how information, both text and non-text, is translated and communicated between digital devices over a computer network.",
    "lessons": []
  },
  "6-8.CS.d.1": {
    "description": "Identify capabilities of devices that are enabled through services (e.g., a wearable device that stores fitness data in the cloud, a mobile device that uses location services for navigation).",
    "lessons": []
  },
  "6-8.CT.a.1": {
    "description": "Describe how data is abstracted by listing attributes of everyday items to represent, order and compare those items (e.g., street address as an abstraction for locations; car make, model, and license plate number as an abstraction for cars).",
    "lessons": []
  },
  "6-8.CT.a.2": {
    "description": "Define a simple function that represents a more complex task/problem and can be reused to solve similar tasks/problems.",
    "lessons": [
      "functions-make-life-easier",
      "functions-dr",
      "functions-for-character-animation",
      "problem-decomposition",
      "inequalities1-simple",
      "inequalities2-compound",
      "inequalities3-sam",
      "re-refactoring",
      "re-structures-reactors-animations",
      "re-nested-structures",
      "re-intro-to-data-structures",
      "re-functions-that-ask-questions",
      "re-key-events",
      "re-timers",
      "re-scoring"
    ]
  },
  "6-8.CT.a.3": {
    "description": "Use decomposition to define and apply a hierarchical classification scheme to a complex system, such as the human body, animal classification, or in computing.",
    "lessons": []
  },
  "6-8.CT.b.1": {
    "description": "Design solutions that use repetition and conditionals.",
    "lessons": [
      "piecewise-functions-conditionals",
      "player-animation",
      "table-methods",
      "codap-filering",
      "codap-building",
      "defining-table-functions"
    ]
  },
  "6-8.CT.b.2": {
    "description": "Use logical reasoning to predict outputs given varying inputs.",
    "lessons": [
      "functions-make-life-easier",
      "functions-dr",
      "functions-for-character-animation",
      "problem-decomposition",
      "inequalities1-simple",
      "inequalities2-compound",
      "inequalities3-sam",
      "re-refactoring",
      "re-structures-reactors-animations",
      "re-nested-structures",
      "re-intro-to-data-structures",
      "re-functions-that-ask-questions",
      "re-key-events",
      "re-timers",
      "re-scoring"
    ]
  },
  "6-8.CT.b.3": {
    "description": "Individually and collaboratively decompose a problem and create a sub-solution for each of its parts (e.g., video game, robot obstacle course, making dinner).",
    "lessons": [
      "problem-decomposition",
      "inequalities-collision"
    ]
  },
  "6-8.CT.b.4": {
    "description": "Recognize that more than one algorithm can solve a given problem.",
    "lessons": []
  },
  "6-8.CT.b.5": {
    "description": "Recognize that boundaries need to be taken into account for an algorithm to produce correct results.",
    "lessons": [
      "inequalities3-sam"
    ]
  },
  "6-8.CT.c.1": {
    "description": "Demonstrate that numbers can be represented in different base systems (e.g., binary, octal, and hexadecimal) and text can be represented in different ways (e.g., American Standard Code for Information Interchange [ASCII]).",
    "lessons": []
  },
  "6-8.CT.c.2": {
    "description": "Describe how computers store, manipulate, and transfer data types and files (e.g., integers, real numbers, Boolean Operators) in a binary system.",
    "lessons": []
  },
  "6-8.CT.c.3": {
    "description": "Create, modify, and use a database (e.g., define field formats, add new records, manipulate data), individually and collaboratively, to analyze data and propose solutions for a task/problem.",
    "lessons": []
  },
  "6-8.CT.c.4": {
    "description": "Perform a variety of operations such as sorting, filtering, and searching in a database to organize and display information in a variety of ways such as number formats (scientific notation and percentages), charts, tables, and graphs.",
    "lessons": [
      "table-methods",
      "codap-filtering",
      "codap-building"
    ]
  },
  "6-8.CT.c.5": {
    "description": "Select and use data-collection technology (e.g., probes, handheld devices, geographic mapping systems) to individually and collaboratively gather, view, organize, analyze, and report results for content-related problems.",
    "lessons": [
      "data-collection"
    ]
  },
  "6-8.CT.d.1": {
    "description": "Individually and collaboratively compare algorithms to solve a problem, based on a given criteria (e.g., time, resource, accessibility).",
    "lessons": []
  },
  "6-8.CT.d.2": {
    "description": "Use functions to hide the detail in a program.",
    "lessons": [
      "functions-make-life-easier",
      "functions-dr",
      "functions-for-character-animation",
      "problem-decomposition",
      "inequalities1-simple",
      "inequalities2-compound",
      "inequalities3-sam",
      "re-refactoring",
      "re-structures-reactors-animations",
      "re-nested-structures",
      "re-intro-to-data-structures",
      "re-functions-that-ask-questions",
      "re-key-events",
      "re-timers",
      "re-scoring"
    ]
  },
  "6-8.CT.d.3": {
    "description": "Create a program, individually and collaboratively, that implements an algorithm to achieve a given goal.",
    "lessons": []
  },
  "6-8.CT.d.4": {
    "description": "Implement problem solutions using a programming language, including all of the following: looping behavior, conditional statements, expressions, variables, and functions.",
    "lessons": [
      "project-research-paper",
      "project-data-exploration",
      "project-video-game",
      "codap-filtering",
      "codap-building",
      "piecewise-functions-conditionals",
      "player-animation"
    ]
  },
  "6-8.CT.d.5": {
    "description": "Trace programs step-by-step in order to predict their behavior.",
    "lessons": [
      "functions-make-life-easier",
      "functions-dr",
      "functions-for-character-animation",
      "problem-decomposition",
      "inequalities1-simple",
      "inequalities2-compound",
      "inequalities3-sam",
      "re-refactoring",
      "re-structures-reactors-animations",
      "re-nested-structures",
      "re-intro-to-data-structures",
      "re-functions-that-ask-questions",
      "re-key-events",
      "re-timers",
      "re-scoring"
    ]
  },
  "6-8.CT.d.6": {
    "description": "Use an iterative approach in development and debugging to understand the dimensions of a problem clearly.",
    "lessons": [
      "debugging"
    ]
  },
  "6-8.CT.e.1": {
    "description": "Create a model of a real-world system and explain why some details, features and behaviors were required in the model and why some could be ignored.",
    "lessons": []
  },
  "6-8.CT.e.2": {
    "description": "Use and modify simulations to analyze and illustrate a concept in depth (e.g., light rays/mechanical waves interaction with materials, genetic variation).",
    "lessons": []
  },
  "6-8.CT.e.3": {
    "description": "Select and use computer simulations, individually and collaboratively, to gather, view, analyze, and report results for content-related problems (e.g., migration, trade, cellular function).",
    "lessons": []
  },
  "9-12.CAS.a.1": {
    "description": "Evaluate and design an ergonomic work environment.",
    "lessons": []
  },
  "9-12.CAS.a.2": {
    "description": "Explain safe practices when collaborating online, including how to anticipate potentially dangerous situations.",
    "lessons": []
  },
  "9-12.CAS.a.3": {
    "description": "Construct strategies to combat cyberbullying/harassment.",
    "lessons": []
  },
  "9-12.CAS.a.4": {
    "description": "Identify the mental health consequences of cyberbullying/harassment.",
    "lessons": []
  },
  "9-12.CAS.a.5": {
    "description": "Explain how peer pressure in social computing settings influences choices.",
    "lessons": []
  },
  "9-12.CAS.a.6": {
    "description": "Apply strategies for managing negative peer pressure and encouraging positive peer pressure.",
    "lessons": []
  },
  "9-12.CAS.b.1": {
    "description": "Model mastery of the schoolÕs Acceptable Use Policy [AUP].",
    "lessons": []
  },
  "9-12.CAS.b.2": {
    "description": "Identify computer-related laws and analyze their impact on digital privacy, security, intellectual property, network access, contracts, and consequences of sexting and harassment.",
    "lessons": []
  },
  "9-12.CAS.b.3": {
    "description": "Discuss the legal and ethical implications associated with malicious hacking and software piracy.",
    "lessons": []
  },
  "9-12.CAS.b.4": {
    "description": "Interpret software license agreements and application permissions.",
    "lessons": []
  },
  "9-12.CAS.c.1": {
    "description": "Explain the impact of the digital divide on access to critical information.",
    "lessons": []
  },
  "9-12.CAS.c.2": {
    "description": "Discuss the impact of computing technology on business and commerce (e.g., automated tracking of goods, automated financial transaction, e-commerce, cloud computing).",
    "lessons": []
  },
  "9-12.CAS.c.3": {
    "description": "Describe the role that assistive technology can play in peopleÕs lives.",
    "lessons": []
  },
  "9-12.CAS.c.4": {
    "description": "Create a digital artifact that is designed to be accessible (e.g., closed captioning for audio, alternative text for images).",
    "lessons": []
  },
  "9-12.CAS.c.5": {
    "description": "Analyze the beneficial and harmful effects of computing innovations (e.g., social networking, delivery of news and other public media, intercultural communication).",
    "lessons": []
  },
  "9-12.CAS.c.6": {
    "description": "Cultivate a positive web presence (e.g., digital resume, portfolio, social media).",
    "lessons": []
  },
  "9-12.CAS.c.7": {
    "description": "Identify ways to use technology to support lifelong learning.",
    "lessons": []
  },
  "9-12.CAS.c.8": {
    "description": "Analyze the impact of values and points of view that are presented in media messages (e.g., racial, gender, political).",
    "lessons": []
  },
  "9-12.CAS.c.9": {
    "description": "Discuss the social and economic implications associated with malicious hacking, software piracy, and cyber terrorism.",
    "lessons": []
  },
  "9-12.DTC.a.1": {
    "description": "Use digital tools to design and develop a significant digital artifact (e.g., multipage website, online portfolio, simulation).",
    "lessons": [
      "project-research-paper",
      "project-data-exploration",
      "project-video-game"
    ]
  },
  "9-12.DTC.a.2": {
    "description": "Select digital tools or resources based on their efficiency and effectiveness to use for a project or assignment, and justify the selection.",
    "lessons": []
  },
  "9-12.DTC.b.1": {
    "description": "Communicate and publish key ideas and details to a variety of audiences using digital tools and media-rich resources.",
    "lessons": []
  },
  "9-12.DTC.b.2": {
    "description": "Collaborate on a substantial project with outside experts or others through online digital tools (e.g., science fair project, community service project, capstone project).",
    "lessons": []
  },
  "9-12.DTC.c.1": {
    "description": "Generate, evaluate, and prioritize questions that can be researched through digital resources or tools.",
    "lessons": [
      "ds-intro",
      "project-research-paper",
      "project-data-exploration"
    ]
  },
  "9-12.DTC.c.2": {
    "description": "Perform advanced searches to locate information and/or design a data-collection approach to gather original data (e.g., qualitative interviews, surveys, prototypes, simulations).",
    "lessons": []
  },
  "9-12.DTC.c.3": {
    "description": "Evaluate digital sources needed to solve a given problem (e.g., reliability, point of view, relevancy).",
    "lessons": []
  },
  "9-12.DTC.c.4": {
    "description": "Gather, organize, analyze, and synthesize information using a variety of digital tools.",
    "lessons": [
      "data-collection"
    ]
  },
  "9-12.DTC.c.5": {
    "description": "Create an artifact that answers a research question, communicates results and conclusions, and cites sources.",
    "lessons": [
      "project-research-paper",
      "project-data-exploration"
    ]
  },
  "9-12.CS.a.1": {
    "description": "Select computing devices (e.g., probe, sensor, tablet) to accomplish a real-world task (e.g., collecting data in a field experiment) and justify the selection.",
    "lessons": []
  },
  "9-12.CS.a.2": {
    "description": "Examine how the components of computing devices are controlled by and react to programmed commands.",
    "lessons": []
  },
  "9-12.CS.a.3": {
    "description": "Apply strategies for identifying and solving routine hardware and software problems that occur in everyday life (e.g., update software patches, virus scan, empty trash, run utility software, close all programs, reboot, use help sources).",
    "lessons": []
  },
  "9-12.CS.a.4": {
    "description": "Explain and demonstrate how specialized computing devices can be used for problem solving, decision-making and creativity in all subject areas.",
    "lessons": []
  },
  "9-12.CS.a.5": {
    "description": "Describe how computing devices manage and allocate shared resources (e.g., memory, Central Processing Unit [CPU]).",
    "lessons": []
  },
  "9-12.CS.a.6": {
    "description": "Examine the historical rate of change in computing devices (e.g., power/energy, computation capacity, speed, size, ease of use) and discuss the implications for the future.",
    "lessons": []
  },
  "9-12.CS.b.1": {
    "description": "Identify a problem that cannot be solved by humans or machines alone and design a solution for it by decomposing the task into sub-problems suited for a human or machine to accomplish (e.g., a human-computer team playing chess, forecasting weather, piloting airplanes).",
    "lessons": []
  },
  "9-12.CS.c.1": {
    "description": "Explain how network topologies and protocols enable users, devices, and systems to communicate with each other.",
    "lessons": []
  },
  "9-12.CS.c.2": {
    "description": "Examine common network vulnerabilities (e.g., cyberattacks, identity theft, privacy) and their associated responses.",
    "lessons": []
  },
  "9-12.CS.c.3": {
    "description": "Examine the issues (e.g., latency, bandwidth, firewalls, server capability) that impact network functionality.",
    "lessons": []
  },
  "9-12.CS.d.1": {
    "description": "Compare the value of using an existing service versus building the equivalent functionality (e.g., using a reference search engine versus creating a database of references for a project).",
    "lessons": []
  },
  "9-12.CS.d.2": {
    "description": "Explain the concept of quality of service (e.g., security, availability, performance) for services providers (e.g., online storefronts that must supply secure transactions for buyer and seller).",
    "lessons": []
  },
  "9-12.CT.a.1": {
    "description": "Discuss and give an example of the value of generalizing and decomposing aspects of a problem in order to solve it more effectively.",
    "lessons": [
      "problem-decomposition",
      "inequalities-collision",
      "re-nested-structures"
    ]
  },
  "9-12.CT.b.1": {
    "description": "Recognize that the design of an algorithm is distinct from its expression in a programming language.",
    "lessons": []
  },
  "9-12.CT.b.2": {
    "description": "Represent algorithms using structured language, such as pseudocode.",
    "lessons": [
      "functions-make-life-easier",
      "functions-dr",
      "functions-for-character-animation",
      "problem-decomposition",
      "inequalities1-simple",
      "inequalities2-compound",
      "inequalities3-sam",
      "re-refactoring",
      "re-structures-reactors-animations",
      "re-nested-structures",
      "re-intro-to-data-structures",
      "re-functions-that-ask-questions",
      "re-key-events",
      "re-timers",
      "re-scoring"
    ]
  },
  "9-12.CT.b.3": {
    "description": "Explain how a recursive solution to a problem repeatedly applies the same solution to smaller instances of the problem.",
    "lessons": []
  },
  "9-12.CT.b.4": {
    "description": "Describe that there are ways to characterize how well algorithms perform and that two algorithms can perform differently for the same task.",
    "lessons": []
  },
  "9-12.CT.b.5": {
    "description": "Explain that there are some problems which cannot be computationally solved.",
    "lessons": []
  },
  "9-12.CT.c.1": {
    "description": "Describe how data types, structures, and compression in programs affect data storage and quality (e.g., digital image file sizes are affected by resolution and color depth).",
    "lessons": []
  },
  "9-12.CT.c.2": {
    "description": "Create an appropriate multidimensional data structure that can be filtered, sorted, and searched (e.g., array, list, record).",
    "lessons": [
      "codap-filtering",
      "codap-building",
      "table-methods",
      "defining-table-functions"
    ]
  },
  "9-12.CT.c.3": {
    "description": "Create, evaluate, and revise data visualization for communication and knowledge.",
    "lessons": [
      "bar-and-pie-charts",
      "codap-dot-plots-bar-charts",
      "codap-exploring",
      "histograms",
      "histograms-interpret",
      "box-plots",
      "advanced-visualizations",
      "scatter-plots",
      "correlations",
      "linear-regression"
    ]
  },
  "9-12.CT.c.4": {
    "description": "Analyze a complex data set to answer a question or test a hypothesis (e.g., analyze a large set of weather or financial data to predict future patterns).",
    "lessons": []
  },
  "9-12.CT.c.5": {
    "description": "Identify different problems (e.g., large or multipart problems, problems that need specific expertise, problems that affect many constituents) that can benefit from collaboration when processing and analyzing data to develop new insights and knowledge.",
    "lessons": []
  },
  "9-12.CT.d.1": {
    "description": "Use a development process in creating a computational artifact that leads to a minimum viable product and includes reflection, analysis, and iteration (e.g., a data-set analysis program for a science and engineering fair, capstone project that includes a program, term research project based on program data).",
    "lessons": [
      "project-research-paper"
    ]
  },
  "9-12.CT.d.2": {
    "description": "Decompose a problem by defining functions which accept parameters and produce return values.",
    "lessons": []
  },
  "9-12.CT.d.3": {
    "description": "Select the appropriate data structure to represent information for a given problem (e.g., records, arrays, lists).",
    "lessons": [
      "table-methods",
      "defining-table-functions",
      "codap-filtering",
      "codap-building"
    ]
  },
  "9-12.CT.d.4": {
    "description": "Analyze trade-offs among multiple approaches to solve a given problem (e.g., space/time performance, maintainability, correctness, elegance).",
    "lessons": []
  },
  "9-12.CT.d.5": {
    "description": "Use appropriate looping structures in programs (e.g., FOR, WHILE, RECURSION).",
    "lessons": [
      "table-methods",
      "defining-table-functions",
      "codap-filtering",
      "codap-building"
    ]
  },
  "9-12.CT.d.6": {
    "description": "Use appropriate conditional structures in programs (e.g., IF-THEN, IF-THEN-ELSE, SWITCH).",
    "lessons": [
      "piecewise-functions-conditionals",
      "player-animation",
      "re-key-events"
    ]
  },
  "9-12.CT.d.7": {
    "description": "Use a programming language or tool feature correctly to enforce operator precedence.",
    "lessons": [
      "order-of-operations"
    ]
  },
  "9-12.CT.d.8": {
    "description": "Use global and local scope appropriately in program design (e.g., for variables).",
    "lessons": [
      "project-video-game",
      "project-research-paper",
      "project-data-exploration",
      "transform-compose-images"
    ]
  },
  "9-12.CT.d.9": {
    "description": "Select and employ an appropriate component or library to facilitate programming solutions (e.g., turtle, Global Positioning System [GPS], statistics library).",
    "lessons": []
  },
  "9-12.CT.d.10": {
    "description": "Use an iterative design process, including learning from making mistakes, to gain a better understanding of the problem domain.",
    "lessons": [
      "project-video-game",
      "project-research-paper",
      "project-data-exploration",
      "transform-compose-images"
    ]
  },
  "9-12.CT.d.11": {
    "description": "Engage in systematic testing and debugging methods to ensure program correctness.",
    "lessons": [
      "debugging"
    ]
  },
  "9-12.CT.d.12": {
    "description": "Demonstrate how to document a program so that others can understand its design and implementation.",
    "lessons": [
      "functions-dr"
    ]
  },
  "9-12.CT.e.1": {
    "description": "Create models and simulations to help formulate, test, and refine hypotheses.",
    "lessons": []
  },
  "9-12.CT.e.2": {
    "description": "Form a model from a hypothesis generated from research and run a simulation to collect and analyze data to test that hypothesis.",
    "lessons": []
  }
}
