{
  "OK.PA.N.1": {
    "description": "Read, write, compare, classify, and represent real numbers and use them to solve problems in various contexts.",
    "lessons": []
  },
  "OK.PA.N.1.1": {
    "description": "Develop and apply the properties of integer exponents, including the zero exponent rule, to generate equivalent numerical and algebraic expressions.",
    "lessons": []
  },
  "OK.PA.N.1.2": {
    "description": "Express and compare approximations of very large and very small numbers using scientific notation.",
    "lessons": []
  },
  "OK.PA.N.1.3": {
    "description": "Multiply and divide numbers expressed in scientific notation, express the answer in scientific notation.",
    "lessons": []
  },
  "OK.PA.N.1.4": {
    "description": "Classify real numbers as rational or irrational. Explain why the rational number system is closed under addition and multiplication and why the irrational system is not. Explain why the sum of a rational number and an irrational number is irrational; and the product of a non-zero rational number and an irrational number is irrational.",
    "lessons": []
  },
  "OK.PA.N.1.5": {
    "description": "Compare real numbers; locate real numbers on a number line. Identify the square root of a perfect square to 400 or, if it is not a perfect square root, locate it as an irrational number between two consecutive positive integers.",
    "lessons": []
  },
  "OK.PA.A.1": {
    "description": "Understand the concept of function in real-world and mathematical situations, and distinguish between linear and nonlinear functions.",
    "lessons": [
      "contracts",
      "functions-can-be-linear",
      "functions-vertical-line-test",
      "function-definition-linear"
    ]
  },
  "OK.PA.A.1.1": {
    "description": "Recognize that a function is a relationship between an independent variable and a dependent variable in which the value of the independent variable determines the value of the dependent variable.",
    "lessons": [
      "contracts",
      "functions-can-be-linear",
      "functions-vertical-line-test",
      "function-definition-linear"
    ]
  },
  "OK.PA.A.1.2": {
    "description": "Use linear functions to represent and explain real-world and mathematical situations.",
    "lessons": [
      "functions-for-character-animation",
      "functions-dr",
      "functions-make-life-easier"
    ]
  },
  "OK.PA.A.1.3": {
    "description": "Identify a function as linear if it can be expressed in the form y = mx + b or if its graph is a straight line.",
    "lessons": [
      "functions-dr"
    ]
  },
  "OK.PA.A.2": {
    "description": "Recognize linear functions in real-world and mathematical situations; represent linear functions and other functions with tables, verbal descriptions, symbols, and graphs; solve problems involving linear functions and interpret results in the original context.",
    "lessons": [
      "functions-for-character-animation",
      "functions-dr"
    ]
  },
  "OK.PA.A.2.1": {
    "description": "Represent linear functions with tables, verbal descriptions, symbols, and graphs; translate from one representation to another.",
    "lessons": [
      "functions-for-character-animation",
      "function-definition-linear",
      "functions-can-be-linear",
      "functions-dr"
    ]
  },
  "OK.PA.A.2.2": {
    "description": "Identify, describe, and analyze linear relationships between two variables.",
    "lessons": [
      "probability-inference",
      "histograms-interpret",
      "histograms",
      "grouped-samples",
      "choosing-your-dataset",
      "function-definition-linear",
      "functions-can-be-linear"
    ]
  },
  "OK.PA.A.2.3": {
    "description": "Identify graphical properties of linear functions including slope and intercepts. Know that the slope equals the rate of change, and that the yintercept is zero when the function represents a proportional relationship.",
    "lessons": [
      "function-definition-linear"
    ]
  },
  "OK.PA.A.2.4": {
    "description": "Predict the effect on the graph of a linear function when the slope or y-intercept changes. Use appropriate tools to examine these effects.",
    "lessons": [
      "function-definition-linear",
      "functions-can-be-linear"
    ]
  },
  "OK.PA.A.2.5": {
    "description": "Solve problems involving linear functions and interpret results in the original context.",
    "lessons": []
  },
  "OK.PA.A.3": {
    "description": "Generate equivalent numerical and algebraic expressions and use algebraic properties to evaluate expressions.",
    "lessons": [
      "order-of-operations"
    ]
  },
  "OK.PA.A.3.1": {
    "description": "Use substitution to simplify and evaluate algebraic expressions.",
    "lessons": [
      "function-composition",
      "defining-values"
    ]
  },
  "OK.PA.A.3.2": {
    "description": "Justify steps in generating equivalent expressions by identifying the properties used, including the properties of operations (associative, commutative, and distributive laws) and the order of operations, including grouping symbols.",
    "lessons": []
  },
  "OK.PA.A.4": {
    "description": "Represent real-world and mathematical problems using equations and inequalities involving linear expressions. Solve and graph equations and inequalities symbolically and graphically. Interpret solutions in the original context.",
    "lessons": [
      "transform-compose-images"
    ]
  },
  "OK.PA.A.4.1": {
    "description": "Illustrate, write, and solve mathematical and real-world problems using linear equations with one variable with one solution, infinitely many solutions, or no solutions. Interpret solutions in the original context.",
    "lessons": []
  },
  "OK.PA.A.4.2": {
    "description": "Represent, write, solve, and graph problems leading to linear inequalities with one variable in the form px + q > r and px + q < r, where p, q, and r are rational numbers.",
    "lessons": []
  },
  "OK.PA.A.4.3": {
    "description": "Represent real-world situations using equations and inequalities involving one variable.",
    "lessons": [
      "inequalities3-sam",
      "inequalities2-compound",
      "inequalities1-simple"
    ]
  },
  "OK.PA.GM.1": {
    "description": "Solve problems involving right triangles using the Pythagorean Theorem.",
    "lessons": [
      "distance"
    ]
  },
  "OK.PA.GM.1.1": {
    "description": "Informally justify the Pythagorean Theorem using measurements, diagrams, or dynamic software and use the Pythagorean Theorem to solve problems in two and three dimensions involving right triangles.",
    "lessons": [
      "distance"
    ]
  },
  "OK.PA.GM.1.2": {
    "description": "Use the Pythagorean Theorem to find the distance between any two points in a coordinate plane.",
    "lessons": [
      "inequalities-collision",
      "distance"
    ]
  },
  "OK.PA.GM.2": {
    "description": "Calculate surface area and volume of three-dimensional figures.",
    "lessons": [
      "surface-area-rect-prism"
    ]
  },
  "OK.PA.GM.2.1": {
    "description": "Calculate the surface area of a rectangular prism using decomposition or nets. Use appropriate units of measure, such as square centimeters.",
    "lessons": [
      "surface-area-rect-prism"
    ]
  },
  "OK.PA.GM.2.2": {
    "description": "Calculate the surface area of a cylinder, in terms of pi and using approximations for pi, using decomposition or nets. Use appropriate units of measure, such as square centimeters.",
    "lessons": [
      "surface-area-rect-prism"
    ]
  },
  "OK.PA.GM.2.3": {
    "description": "Develop and use the formulas V = lwh and V = Bh to determine the volume of rectangular prisms. Justify why base area (B) and height (h) are multiplied to find the volume of a rectangular prism. Use appropriate measurements such as cubic centimeters.",
    "lessons": []
  },
  "OK.PA.GM.2.4": {
    "description": "Develop and use the formulas V = pi * r^2 * h and V = Bh to determine the volume of right cylinders, in terms of pi and using approximations for pi. Justify why base area (B) and height (h) are multiplied to find the volume of a right cylinder. Use appropriate measurements such as cubic centimeters.",
    "lessons": []
  },
  "OK.PA.D.1": {
    "description": "Display and interpret data in a variety of ways, including using scatterplots and approximate lines of best fit. Use line of best fit and average rate of change to make predictions and draw conclusions about data.",
    "lessons": [
      "choosing-your-dataset"
    ]
  },
  "OK.PA.D.1.1": {
    "description": "Describe the impact that inserting or deleting a data point has on the mean and the median of a data set. Know how to create data displays using a spreadsheet and use a calculator to examine this impact.",
    "lessons": [
      "histograms-interpret",
      "histograms",
      "grouped-samples",
      "choosing-your-dataset"
    ]
  },
  "OK.PA.D.1.2": {
    "description": "Explain how outliers affect measures of central tendency.",
    "lessons": [
      "measures-of-center"
    ]
  },
  "OK.PA.D.1.3": {
    "description": "Collect, display and interpret data using scatterplots. Use the shape of the scatterplot to informally estimate a line of best fit, make statements about average rate of change, and make predictions about values not in the original data set. Use appropriate titles, labels and units.",
    "lessons": [
      "scatter-plots",
      "linear-regression",
      "correlations"
    ]
  },
  "OK.PA.D.2": {
    "description": "Calculate experimental probabilities and reason about probabilities to solve real-world and mathematical problems.",
    "lessons": []
  },
  "OK.PA.D.2.1": {
    "description": "Calculate experimental probabilities and represent them as percents, fractions and decimals between 0 and 1 inclusive. Use experimental probabilities to make predictions when actual probabilities are unknown.",
    "lessons": []
  },
  "OK.PA.D.2.2": {
    "description": "Determine how samples are chosen (random, limited, biased) to draw and support conclusions about generalizing a sample to a population.",
    "lessons": [
      "probability-inference"
    ]
  },
  "OK.PA.D.2.3": {
    "description": "Compare and contrast dependent and independent events.",
    "lessons": []
  },
  "OK.MAP.1": {
    "description": "Develop a deep and flexible conceptual understanding.",
    "lessons": [
      "transform-compose-images"
    ]
  },
  "OK.MAP.2": {
    "description": "Develop accurate and appropriate procedural fluency.",
    "lessons": [
      "order-of-operations"
    ]
  },
  "OK.MAP.3": {
    "description": "Develop strategies for problem solving.",
    "lessons": [
      "functions-for-character-animation"
    ]
  },
  "OK.MAP.4": {
    "description": "Develop mathematical reasoning.",
    "lessons": [
      "transform-compose-images"
    ]
  },
  "OK.MAP.5": {
    "description": "Develop a productive mathematical disposition.",
    "lessons": [
      "functions-make-life-easier"
    ]
  },
  "OK.MAP.6": {
    "description": "Develop the ability to make conjectures, model, and generalize.",
    "lessons": [
      "functions-make-life-easier"
    ]
  },
  "OK.MAP.7": {
    "description": "Develop the ability to communicate mathematically.",
    "lessons": [
      "linear-regression",
      "functions-dr"
    ]
  },
  "OK.G.2D.1.8": {
    "description": "Construct logical arguments to prove triangle congruence (SSS, SAS, ASA, AAS and HL) and triangle similarity (AA, SSS, SAS).",
    "lessons": [
      "contracts"
    ]
  },
  "OK.G.2D.1.5": {
    "description": "Use coordinate geometry to represent and analyze line segments and polygons, including determining lengths, midpoints, and slopes of line segments.",
    "lessons": [
      "inequalities-collision",
      "distance"
    ]
  },
  "OK.G.3D.1.1": {
    "description": "Solve real-world and mathematical problems using the surface area and volume of prisms, cylinders, pyramids, cones, spheres, and composites of these figures. Use nets, measuring devices, or formulas as appropriate.",
    "lessons": [
      "surface-area-rect-prism"
    ]
  },
  "OK.G.RT.1.1": {
    "description": "Apply the distance formula and the Pythagorean Theorem and its converse to solve real-world and mathematical problems, as approximate and exact values, using algebraic and logical reasoning (include Pythagorean Triples).",
      "lessons": [
        "inequalities-collision",
        "distance"
      ]
  },
  "OK.A1.N.1": {
    "description": "Extend the understanding of number and operations to include square roots and cube roots.",
    "lessons": []
  },
  "OK.A1.N.1.1": {
    "description": "Write square roots and cube roots of monomial algebraic expressions in simplest radical form.",
    "lessons": []
  },
  "OK.A1.N.1.2": {
    "description": "Add, subtract, multiply, and simplify square roots of monomial algebraic expressions and divide square roots of whole numbers, rationalizing the denominator when necessary.",
    "lessons": []
  },
  "OK.A1.A.1": {
    "description": "Represent and solve mathematical and real-world problems using linear equations, absolute value equations, and systems of equations; interpret solutions in the original context.",
    "lessons": []
  },
  "OK.A1.A.1.1": {
    "description": "Use knowledge of solving equations with rational values to represent and solve mathematical and real-world problems (e.g., angle measures, geometric formulas, science, or statistics) and interpret the solutions in the original context.",
    "lessons": [
      "functions-make-life-easier"
    ]
  },
  "OK.A1.A.1.2": {
    "description": "Solve absolute value equations and interpret the solutions in the original context.",
    "lessons": []
  },
  "OK.A1.A.1.3": {
    "description": "Analyze and solve real-world and mathematical problems involving systems of linear equations with a maximum of two variables by graphing (may include graphing calculator or other appropriate technology), substitution, and elimination. Interpret the solutions in the original context.",
    "lessons": []
  },
  "OK.A1.A.2": {
    "description": "Represent and solve real-world and mathematical problems using linear inequalities, compound inequalities and systems of linear inequalities; interpret solutions in the original context.",
    "lessons": [
      "inequalities3-sam"
    ]
  },
  "OK.A1.A.2.1": {
    "description": "Represent relationships in various contexts with linear inequalities; solve the resulting inequalities, graph on a coordinate plane, and interpret the solutions.",
    "lessons": []
  },
  "OK.A1.A.2.2": {
    "description": "Represent relationships in various contexts with compound and absolute value inequalities and solve the resulting inequalities by graphing and interpreting the solutions on a number line.",
    "lessons": [
      "inequalities3-sam",
      "inequalities2-compound"
    ]
  },
  "OK.A1.A.2.3": {
    "description": "Solve systems of linear inequalities with a maximum of two variables; graph and interpret the solutions on a coordinate plane.",
    "lessons": []
  },
  "OK.A1.A.3": {
    "description": "Generate equivalent algebraic expressions and use algebraic properties to evaluate expressions and arithmetic and geometric sequences.",
    "lessons": [
      "order-of-operations"
    ]
  },
  "OK.A1.A.3.1": {
    "description": "Solve equations involving several variables for one variable in terms of the others.",
    "lessons": [
      "problem-decomposition"
    ]
  },
  "OK.A1.A.3.2": {
    "description": "Simplify polynomial expressions by adding, subtracting, or multiplying.",
    "lessons": []
  },
  "OK.A1.A.3.3": {
    "description": "Factor common monomial factors from polynomial expressions and factor quadratic expressions with a leading coefficient of 1.",
    "lessons": []
  },
  "OK.A1.A.3.4": {
    "description": "Evaluate linear, absolute value, rational, and radical expressions. Include applying a nonstandard operation such as a o b = 2a + b.",
    "lessons": []
  },
  "OK.A1.A.3.5": {
    "description": "Recognize that arithmetic sequences are linear using equations, tables, graphs, and verbal descriptions. Use the pattern, find the next term.",
    "lessons": []
  },
  "OK.A1.A.3.6": {
    "description": "Recognize that geometric sequences are exponential using equations, tables, graphs and verbal descriptions. Given the formula f(x) = a(r)^x, find the next term and define the meaning of a and r within the context of the problem.",
    "lessons": []
  },
  "OK.A1.A.4": {
    "description": "Analyze mathematical change involving linear equations in real-world and mathematical problems.",
    "lessons": [
      "function-definition-linear"
    ]
  },
  "OK.A1.A.4.1": {
    "description": "Calculate and interpret slope and the x- and y-intercepts of a line using a graph, an equation, two points, or a set of data points to solve realworld and mathematical problems.",
    "lessons": [
      "function-definition-linear"
    ]
  },
  "OK.A1.A.4.2": {
    "description": "Solve mathematical and real-world problems involving lines that are parallel, perpendicular, horizontal, or vertical.",
    "lessons": []
  },
  "OK.A1.A.4.3": {
    "description": "Express linear equations in slope-intercept, point-slope, and standard forms and convert between these forms. Given sufficient information (slope and y-intercept, slope and one-point on the line, two points on the line, x- and y-intercept, or a set of data points), write the equation of a line.",
    "lessons": []
  },
  "OK.A1.A.4.4": {
    "description": "Translate between a graph and a situation described qualitatively.",
    "lessons": []
  },
  "OK.A1.F.1": {
    "description": "Understand functions as descriptions of covariation (how related quantities vary together) in real-world and mathematical problems.",
    "lessons": []
  },
  "OK.A1.F.1.1": {
    "description": "Distinguish between relations and functions.",
    "lessons": []
  },
  "OK.A1.F.1.2": {
    "description": "Identify the dependent and independent variables as well as the domain and range given a function, equation, or graph. Identify restrictions on the domain and range in real-world contexts.",
    "lessons": [
      "contracts",
      "functions-dr",
      "functions-examples-definitions",
      "functions-make-life-easier",
      "functions-vertical-line-test",
      "inequalities3-sam"
    ]
  },
  "OK.A1.F.1.3": {
    "description": "Write linear functions, using function notation, to model real-world and mathematical situations.",
    "lessons": [
      "function-composition",
      "functions-make-life-easier",
      "contracts"
    ]
  },
  "OK.A1.F.1.4": {
    "description": "Given a graph modeling a real-world situation, read and interpret the linear piecewise function (excluding step functions).",
    "lessons": [
      "advanced-visualizations",
      "contracts"
    ]
  },
  "OK.A1.F.2": {
    "description": "Recognize functions and understand that families of functions are characterized by their rate of change.",
    "lessons": []
  },
  "OK.A1.F.2.1": {
    "description": "Distinguish between linear and nonlinear (including exponential) functions arising from real-world and mathematical situations that are represented in tables, graphs, and equations. Understand that linear functions grow by equal intervals and that exponential functions grow by equal factors over equal intervals.",
    "lessons": [
      "function-definition-linear",
      "functions-can-be-linear"
    ]
  },
  "OK.A1.F.2.2": {
    "description": "Recognize the graph of the functions f(x) = x and f(x) = |x| and predict the effects of transformations [ f(x + c) and f(x) + c, where c is a positive or negative constant] algebraically and graphically using various methods and tools that may include graphing calculators.",
    "lessons": []
  },
  "OK.A1.F.3": {
    "description": "Represent functions in multiple ways and use the representation to interpret real-world and mathematical problems.",
    "lessons": [
      "function-definition-linear",
      "function-composition",
      "defining-values"
    ]
  },
  "OK.A1.F.3.1": {
    "description": "Identify and generate equivalent representations of linear equations, graphs, tables, and real-world situations.",
    "lessons": [
      "function-definition-linear",
      "defining-values"
    ]
  },
  "OK.A1.F.3.2": {
    "description": "Use function notation; evaluate a function, including nonlinear, at a given point in its domain algebraically and graphically. Interpret the results in terms of real-world and mathematical problems.",
    "lessons": [
      "function-composition"
    ]
  },
  "OK.A1.F.3.3": {
    "description": "Add, subtract, and multiply functions using function notation.",
    "lessons": [
      "function-composition"
    ]
  },
  "OK.A1.D.1": {
    "description": "Display, describe, and compare data. For linear relationships, make predictions and assess the reliability of those predictions.",
    "lessons": []
  },
  "OK.A1.D.1.1": {
    "description": "Describe a data set using data displays, describe and compare data sets using summary statistics, including measures of central tendency, location, and spread. Know how to use calculators, spreadsheets, or other appropriate technology to display data and calculate summary statistics.",
    "lessons": [
      "histograms-interpret",
      "histograms",
      "grouped-samples",
      "choosing-your-dataset"
    ]
  },
  "OK.A1.D.1.2": {
    "description": "Collect data and use scatterplots to analyze patterns and describe linear relationships between two variables. Using graphing technology, determine regression lines and correlation coefficients; use regression lines to make predictions and correlation coefficients to assess the reliability of those predictions.",
    "lessons": [
      "data-collection"
    ]
  },
  "OK.A1.D.1.3": {
    "description": "Interpret graphs as being discrete or continuous.",
    "lessons": []
  },
  "OK.A1.D.2": {
    "description": "Calculate probabilities and apply probability concepts.",
    "lessons": []
  },
  "OK.A1.D.2.1": {
    "description": "Select and apply counting procedures, such as the multiplication and addition principles and tree diagrams, to determine the size of a sample space (the number of possible outcomes) and to calculate probabilities.",
    "lessons": [
      "table-methods",
      "composing-table-operations",
      "defining-table-functions"
    ]
  },
  "OK.A1.D.2.2": {
    "description": "Describe the concepts of intersections, unions, and complements using Venn diagrams to evaluate probabilities. Understand the relationships between these concepts and the words AND, OR, and NOT.",
    "lessons": [
      "inequalities2-compound"
    ]
  },
  "OK.A1.D.2.3": {
    "description": "Calculate experimental probabilities by performing simulations or experiments involving a probability model and using relative frequencies of outcomes.",
    "lessons": []
  },
  "OK.A1.D.2.4": {
    "description": "Apply probability concepts to real-world situations to make informed decisions.",
    "lessons": []
  },
  "OK.A2.A.1.1": {
    "description": "Represent real-world or mathematical problems using quadratic equations and solve using various methods (including graphing calculator or other appropriate technology), factoring, completing the square, and the quadratic formula. Find non-real roots when they exist.",
    "lessons": ["exploring-quadratic-models"]
  },
  "OK.A2.A.1.2": {
    "description": "Represent real-world or mathematical problems using exponential equations, such as compound interest, depreciation, and population growth, and solve these equations graphically (including graphing calculator or other appropriate technology) or algebraically",
    "lessons": ["exploring-exponential-models"]
  },
  "OK.A2.A2.A.1.6": {
    "description": "Solve common and natural logarithmic equations using the properties of logarithms.",
    "lessons": ["exploring-logarithmic-models"]
  },
  "OK.A2.A.1.8": {
    "description": "Use tools to solve systems of equations containing one linear equation and one quadratic equation. Graphing calculators or other appropriate technology may be used.",
    "lessons": ["exploring-linear-models", "exploring-quadratic-models"]
  },
  "OK.A2.A.1.9": {
    "description": "Solve systems of linear inequalities in two variables, with a maximum of three inequalities; graph and interpret the solutions on a coordinate plane. Graphing calculators or other appropriate technology may be used.",
    "lessons": ["inequalities1-simple", "inequalities2-compound"]
  },
  "OK.A2.A.2.4": {
    "description": "Recognize that a quadratic function has different equivalent representations [ð‘“(ð‘¥) = ð‘Žð‘¥2 + ð‘ð‘¥ + ð‘, ð‘“(ð‘¥) = ð‘Ž(ð‘¥ âˆ’ h)2 + ð‘˜, and ð‘“(ð‘¥) = ð‘Ž(ð‘¥ âˆ’ ð‘)(ð‘¥ âˆ’ ð‘ž)]. Identify and use the mathematical model that is most appropriate to solve problems.",
    "lessons": ["exploring-quadratic-models"]
  },
  "OK.A2.F.1.2": {
    "description": "Identify the parent forms of exponential, radical (square root and cube root only), quadratic, and logarithmic functions. Predict the effects of transformations [ð‘“(ð‘¥ + ð‘), ð‘“(ð‘¥) + ð‘, ð‘“(ð‘ð‘¥), and ð‘ð‘“(ð‘¥)] algebraically and graphically.",
    "lessons": ["exploring-quadratic-models", "exploring-exponential-models", "exploring-logarithmic-models"]
  },
  "OK.A2.F.1.3": {
    "description": "Graph a quadratic function. Identify the x- and y-intercepts, maximum or minimum value, axis of symmetry, and vertex using various methods and tools that may include a graphing calculator or appropriate technology.",
    "lessons": ["exploring-quadratic-models"]
  },
  "OK.A2.F.1.4": {
    "description": "Graph exponential and logarithmic functions. Identify asymptotes and x- and y-intercepts using various methods and tools that may include graphing calculators or other appropriate technology. Recognize exponential decay and growth graphically and algebraically.",
    "lessons": ["exploring-exponential-models", "exploring-logarithmic-models", "exploring-logarithmic-models"]
  },
  "OK.A2.F.1.8": {
    "description": "Graph a quadratic function. Identify the x- and y-intercepts, maximum or minimum value, axis of symmetry, and vertex using various methods and tools that may include a graphing calculator or appropriate technology.",
    "lessons": []
  },
  "OK.A2.F.1.9": {
    "description": "Recognize whether a discrete or continuous graphical representation is appropriate to create a graph based upon a mathematical model.",
    "lessons": []
  },
  "OK.A2.F.2.1": {
    "description": "Add, subtract, multiply, and divide functions using function notation and recognize domain restrictions.",
    "lessons": ["exploring-periodic-models"]
  },
  "OK.A2.F.2.2": {
    "description": "Combine functions by composition and recognize that ð‘”(ð‘¥) = ð‘“(!(ð‘¥), the inverse function of ð‘“(ð‘¥), if and only if ð‘“(ð‘”(ð‘¥)) = ð‘”(ð‘“(ð‘¥)) = ð‘¥.",
    "lessons": []
  },
  "OK.A2.F.2.3": {
    "description": "Find and graph the inverse of a function, if it exists, in mathematical models. Know that the domain of a function f is the range of the inverse function ð‘“ to the -1 and the range of the function ð‘“ is the domain of the inverse function ð‘“ to the -1",
    "lessons": ["exploring-logarithmic-models"]
  },
  "OK.A2.F.2.4": {
    "description": "Apply the inverse relationship between exponential and logarithmic functions to convert from one form to another.",
    "lessons": ["exploring-logarithmic-models"]
  },
  "OK.A2.D.1.1": {
    "description": "Use the mean and standard deviation of a data set to fit it to a normal distribution (bell-shaped curve).",
    "lessons": ["standard-deviation"]
  },
  "OK.A2.D.1.2": {
    "description": "Collect data and use scatterplots to analyze patterns and describe linear, exponential or quadratic relationships between two variables. Using graphing calculators or other appropriate technology, determine regression equation and correlation coefficients; use regression equations to make predictions and correlation coefficients to assess the reliability of those predictions.",
    "lessons": ["exploring-linear-models", "exploring-quadratic-models", "exploring-exponential-models", "correlations", "scatter-plots"]
  },
  "OK.A2.D.1.3": {
    "description": "Make predictions based upon the regression equation (linear, exponential, or quadratic), and use the correlation coefficient to assess the reliability of those predictions using graphing technology.",
    "lessons": ["linear-regression", "exploring-linear-models", "exploring-quadratic-models", "exploring-exponential-models"]
  },
  "OK.A2.D.2.1": {
    "description": "Evaluate reports based on data published in the media by identifying the source of the data, the design of the study, and the way the data are analyzed and displayed. Given spreadsheets, tables, or graphs, recognize and analyze distortions in data displays. Show how graphs and data can be distorted to support different points of view.",
    "lessons": ["threats-to-validity", "ethics-privacy-and-bias"]
  },
  "OK.A2.D.2.2": {
    "description": "Identify and explain misleading conclusions and graphical representations of data sets.",
    "lessons": ["threats-to-validity", "ethics-privacy-and-bias"]
  },
  "OK.A2.D.2.3": {
    "description": "Differentiate between correlation and causation when describing the relationship between two variables.",
    "lessons": ["threats-to-validity", "correlations"]
  },
  "OK.3.CS.HS.01": {
    "description": "Model how information flows through hardware and software to accomplish tasks.",
    "lessons": []
  },
  "OK.4.CS.HS.01": {
    "description": "Model that information is translated, transmitted, and processed in order to flow through hardware and software.",
    "lessons": []
  },
  "OK.5.CS.HS.01": {
    "description": "Model that information is translated into bits in order to transmit and process between software to accomplish tasks.",
    "lessons": []
  },
  "OK.3.CS.T.01": {
    "description": "Identify, using accurate terminology, simple hardware and software problems that may occur during everyday use, discuss problems with peers and adults, and apply strategies for solving these problems.",
    "lessons": []
  },
  "OK.4.CS.T.01": {
    "description": "Identify, using accurate terminology, simple hardware and software problems that may occur during everyday use, discuss problems with peers and adults, and apply strategies for solving these problems.",
    "lessons": []
  },
  "OK.5.CS.T.01": {
    "description": "Identify, using accurate terminology, simple hardware and software problems that may occur during everyday use. Discuss problems with peers and adults, apply strategies for solving these problems and explain why the strategy should work.",
    "lessons": []
  },
  "OK.3.NI.NCO.01": {
    "description": "Recognize that information is sent and received over physical or wireless paths.",
    "lessons": []
  },
  "OK.4.NI.NCO.01": {
    "description": "Explain how information is sent and received across physical or wireless paths.",
    "lessons": []
  },
  "OK.5.NI.NCO.01": {
    "description": "Model how information is broken down into packets and transmitted through multiple devices over networks and the Internet, and reassembled at the destination.",
    "lessons": []
  },
  "OK.3.NI.C.01": {
    "description": "Identify problems that relate to inappropriate use of computing devices and networks.",
    "lessons": []
  },
  "OK.4.NI.C.01": {
    "description": "Identify and explain issues related to responsible use of technology and information, and describe personal consequences of inappropriate use.",
    "lessons": []
  },
  "OK.5.NI.C.01": {
    "description": "Discuss real-world cybersecurity problems and identify strategies for how personal information can be protected.",
    "lessons": []
  },
  "OK.3.DA.S.01": {
    "description": "Recognize that different types of information are stored in different formats that have associated programs and varied storage requirements.",
    "lessons": []
  },
  "OK.4.DA.S.01": {
    "description": "Choose different storage locations based on the type of file, storage requirements, and sharing requirements.",
    "lessons": []
  },
  "OK.5.DA.S.01": {
    "description": "Evaluate trade-offs, including availability and quality, based on the type of file, storage requirements, and sharing requirements.",
    "lessons": []
  },
  "OK.3.DA.CVT.01": {
    "description": "Collect and organize data in various visual formats.",
    "lessons": [
      "data-collection"
    ]
  },
  "OK.4.DA.CVT.01": {
    "description": "Organize and present collected data visually to highlight comparisons.",
    "lessons": [
      "data-collection"
    ]
  },
  "OK.5.DA.CVT.01": {
    "description": "Organize and present collected data to highlight comparisons and support a claim.",
    "lessons": [
      "data-collection"
    ]
  },
  "OK.3.DA.IM.01": {
    "description": "With guidance, utilize data to make predictions and discuss whether there is adequate data to make reliable predictions.",
    "lessons": [
      "threats-to-validity",
      "linear-regression"
    ]
  },
  "OK.4.DA.IM.01": {
    "description": "Determine how the accuracy of conclusions are influenced by the amount of data collected.",
    "lessons": [
      "linear-regression"
    ]
  },
  "OK.5.DA.IM.01": {
    "description": "Use data to highlight or propose cause and effect relationships, predict outcomes, or communicate an idea.",
    "lessons": [
      "ds-intro"
    ]
  },
  "OK.3.AP.A.01": {
    "description": "Compare multiple algorithms for the same task.",
    "lessons": [
      "transform-compose-images"
    ]
  },
  "OK.4.AP.A.01": {
    "description": "Compare and refine multiple algorithms for the same task.",
    "lessons": [
      "composing-table-operations",
      "transform-compose-images"
    ]
  },
  "OK.5.AP.A.01": {
    "description": "Compare and refine multiple algorithms for the same task and determine which is the most efficient.",
    "lessons": [
      "function-composition",
      "transform-compose-images"
    ]
  },
  "OK.3.A.V.01": {
    "description": "Create programs that use variables to store and modify grade level appropriate data.",
    "lessons": [
      "defining-values"
    ]
  },
  "OK.4.AP.V.01": {
    "description": "Create programs that use variables to store and modify grade level appropriate data.",
    "lessons": [
      "defining-values"
    ]
  },
  "OK.5.AP.V.01": {
    "description": "Create programs that use variables to store and modify grade level appropriate data.",
    "lessons": [
      "defining-values"
    ]
  },
  "OK.3.AP.C.01": {
    "description": "Create programs using a programming language that utilize sequencing, repetition, conditionals, and variables to solve a problem or express ideas both independently and collaboratively.",
    "lessons": [
      "composing-table-operations",
      "grouped-samples"
    ]
  },
  "OK.4.AP.C.01": {
    "description": "Create programs using a programming language that utilize sequencing, repetition, conditionals and variables using math operations manipulate values to solve a problem or express ideas both independently and collaboratively.",
    "lessons": [
      "transform-compose-images"
    ]
  },
  "OK.5.AP.C.01": {
    "description": "Create programs using a programming language that utilize sequencing, repetition, conditionals, event handlers and variables using math operations to manipulate values to solve a problem or express ideas both independently and collaboratively.",
    "lessons": []
  },
  "OK.3.AP.M.01": {
    "description": "Decompose the steps needed to solve a problem into a precise sequence of instructions.",
    "lessons": [
      "transform-compose-images"
    ]
  },
  "OK.4.AP.M.01": {
    "description": "Decompose large problems into smaller, manageable subproblems to facilitate the program development process.",
    "lessons": [
      "composing-table-operations",
      "problem-decomposition"
    ]
  },
  "OK.5.AP.M.01": {
    "description": "Decompose large problems into smaller, manageable subproblems and then into a precise sequence of instructions.",
    "lessons": [
      "composing-table-operations",
      "problem-decomposition"
    ]
  },
  "OK.3.AP.M.02": {
    "description": "With grade appropriate complexity, modify, remix, or incorporate portions of an existing program into one's own work, to develop something new or add more advanced features.",
    "lessons": [
      "player-animation",
      "making-game-images",
      "functions-for-character-animation"
    ]
  },
  "OK.4.AP.M.02": {
    "description": "With grade appropriate complexity, modify, remix, or incorporate portions of an existing program into one's own work, to develop something new or add more advanced features.",
    "lessons": [
      "player-animation",
      "making-game-images",
      "functions-for-character-animation"
    ]
  },
  "OK.5.AP.M.02": {
    "description": "With grade appropriate complexity, modify, remix, or incorporate portions of an existing program into one's own work, to develop something new or add more advanced features.",
    "lessons": [
      "player-animation",
      "making-game-images",
      "functions-for-character-animation"
    ]
  },
  "OK.3.AP.PD.01": {
    "description": "Use an iterative process to plan the development of a program while solving simple problems.",
    "lessons": [
      "defining-table-functions",
      "functions-dr",
      "functions-make-life-easier"
    ]
  },
  "OK.4.AP.PD.01": {
    "description": "Use an iterative process to plan the development of a program that includes user preferences while solving simple problems.",
    "lessons": []
  },
  "OK.5.AP.PD.01": {
    "description": "Use an iterative process to plan the development of a program that includes others' perspectives and user preferences while solving simple problems.",
    "lessons": []
  },
  "OK.3.AP.PD.02": {
    "description": "Observe intellectual property rights and give appropriate credit when creating or remixing programs.",
    "lessons": [
      "making-game-images"
    ]
  },
  "OK.4.AP.PD.02": {
    "description": "Observe intellectual property rights and give appropriate credit when creating or remixing programs.",
    "lessons": []
  },
  "OK.5.AP.PD.02": {
    "description": "Observe intellectual property rights and give appropriate credit when creating or remixing programs.",
    "lessons": [
      "making-game-images"
    ]
  },
  "OK.3.AP.PD.03": {
    "description": "Analyze and debug a program that includes sequencing, repetition and variables in a programming language.",
    "lessons": [
      "transform-compose-images",
      "debugging"
    ]
  },
  "OK.4.AP.PD.03": {
    "description": "Analyze, create, and debug a program that includes sequencing, repetition, conditionals and variables in a programming language.",
    "lessons": [
      "composing-table-operations",
      "debugging"
    ]
  },
  "OK.5.AP.PD.03": {
    "description": "Analyze, create, and debug a program that includes sequencing, repetition, conditionals and variables in a programming language.",
    "lessons": [
      "composing-table-operations",
      "debugging"
    ]
  },
  "OK.3.AP.PD.04": {
    "description": "Communicate and explain your program development using comments, presentations and demonstrations.",
    "lessons": [
      "functions-dr"
    ]
  },
  "OK.4.AP.PD.04": {
    "description": "Communicate and explain your program development using comments, presentations and demonstrations.",
    "lessons": [
      "functions-dr"
    ]
  },
  "OK.5.AP.PD.04": {
    "description": "Communicate and explain your program development using comments, presentations and demonstrations.",
    "lessons": [
      "functions-dr"
    ]
  },
  "OK.3.IC.C.01": {
    "description": "Identify computing technologies that have changed the world, and express how those technologies influence, and are influenced by, cultural practices.",
    "lessons": []
  },
  "OK.4.IC.C.01": {
    "description": "Give examples of computing technologies that have changed the world, and express how those technologies influence, and are influenced by, cultural practices.",
    "lessons": []
  },
  "OK.5.IC.C.01": {
    "description": "Give examples and explain how computing technologies have changed the world, and express how computing technologies influence, and are influenced by, cultural practices.",
    "lessons": []
  },
  "OK.3.IC.C.02": {
    "description": "Identify possible problems and how computing devices have built in features for increasing accessibility to all users.",
    "lessons": []
  },
  "OK.4.IC.C.02": {
    "description": "Brainstorm problems and ways to improve computing devices to increase accessibility to all users.",
    "lessons": []
  },
  "OK.5.IC.C.02": {
    "description": "Develop, test and refine digital artifacts to improve accessibility and usability.",
    "lessons": []
  },
  "OK.3.IC.SI.01": {
    "description": "Develop a code of conduct, explain, and practice grade-level appropriate behavior and responsibilities while participating in an online community. Identify and report inappropriate behavior.",
    "lessons": []
  },
  "OK.4.IC.SI.01": {
    "description": "Develop a code of conduct, explain, and practice grade-level appropriate behavior and responsibilities while participating in an online community. Identify and report inappropriate behavior.",
    "lessons": []
  },
  "OK.5.IC.SI.01": {
    "description": "Develop a code of conduct, explain, and practice grade-level appropriate behavior and responsibilities while participating in an online community. Identify and report inappropriate behavior.",
    "lessons": []
  },
  "OK.3.IC.SI.02": {
    "description": "Identify how computational products may be, or have been, improved to incorporate diverse perspectives.",
    "lessons": []
  },
  "OK.4.IC.SI.02": {
    "description": "As a team, consider each others perspectives on improving a computational product.",
    "lessons": []
  },
  "OK.5.IC.SI.02": {
    "description": "As a team, collaborate with outside resources (other grade levels, online collaborative spaces) to include diverse perspectives to improve computational products.",
    "lessons": []
  },
  "OK.3.IC.SLE.01": {
    "description": "Identify types of digital data that may have intellectual property rights that prevent copying or require attribution.",
    "lessons": []
  },
  "OK.4.IC.SLE.01": {
    "description": "Discuss the social impact of violating intellectual property rights.",
    "lessons": []
  },
  "OK.5.IC.SLE.01": {
    "description": "Observe intellectual property rights and give appropriate credit when using resources.",
    "lessons": []
  },
  "OK.5.GM.1.1": {
    "description": "Describe, classify and construct triangles, including equilateral, right, scalene, and isosceles triangles. Recognize triangles in various contexts.",
    "lessons": [
      "contracts"
    ]
  },
  "OK.6.A.1.1": {
    "description": "Plot integer- and rational-valued (limited to halves and fourths) ordered-pairs as coordinates in all four quadrants and recognize the reflective relationships among coordinates that differ only by their signs.",
    "lessons": [
      "transform-compose-images",
      "coordinates"
    ]
  },
  "OK.6.A.1.3": {
    "description": "Use and evaluate variables in expressions, equations, and inequalities that arise from various contexts, including determining when or if, for a given value of the variable, an equation or inequality involving a variable is true or false.",
    "lessons": [
      "simple-data-types"
    ]
  },
  "OK.6.A.3.1": {
    "description": "Represent real-world or mathematical situations using expressions, equations and inequalities involving variables and rational numbers.",
    "lessons": [
      "inequalities2-compound",
      "inequalities1-simple"
    ]
  },
  "OK.6.GM.2.2": {
    "description": "Develop and use the fact that the sum of the interior angles of a triangle is 180Â° to determine missing angle measures in a triangle.",
    "lessons": [
      "contracts"
    ]
  },
  "OK.6.CS.D.01": {
    "description": "Evaluate existing computing devices and recommend improvements to design based on analysis of personal interaction with the device.",
    "lessons": []
  },
  "OK.7.N.1.1": {
    "description": "Know that every rational number can be written as the ratio of two integers or as a terminating or repeating decimal.",
    "lessons": [
      "simple-data-types"
    ]
  },
  "OK.7.N.1.2": {
    "description": "Compare and order rational numbers expressed in various forms using the symbols <, >, and =.",
    "lessons": [
      "simple-data-types"
    ]
  },
  "OK.7.N.1.3": {
    "description": "Recognize and generate equivalent representations of rational numbers, including equivalent fractions.",
    "lessons": [
      "simple-data-types"
    ]
  },
  "OK.7.CS.D.01": {
    "description": "Evaluate existing computing devices and recommend improvements to design based on analysis of how other users interact with the device.",
    "lessons": []
  },
  "OK.7.A.3.1": {
    "description": " Write and solve problems leading to linear equations with one variable in the form px + q = r and p(x + q) = r, where p, q, and r are rational numbers.",
    "lessons": []
  },
  "OK.7.A.3.3": {
    "description": "Represent real-world or mathematical situations using equations and inequalities involving variables and rational numbers.",
    "lessons": [
      "inequalities3-sam",
      "inequalities2-compound",
      "inequalities1-simple",
      "defining-values"
    ]
  },
  "OK.7.A.4.2": {
    "description": "Apply understanding of order of operations and grouping symbols when using calculators and other technologies",
    "lessons": [
      "order-of-operations"
    ]
  },
  "OK.7.GM.1.1": {
    "description": "Using a variety of tools and strategies, develop the concept that surface area of a rectangular prism with rational-valued edge lengths can be found by wrapping the figure with samesized square units without gaps or overlap. Use appropriate measurements such as cm^2",
    "lessons": [
      "surface-area-rect-prism"
    ]
  },
  "OK.7.GM.4.1": {
    "description": "Describe the properties of similarity, compare geometric figures for similarity, and determine scale factors resulting from dilations.",
    "lessons": [
      "making-game-images",
      "transform-compose-images"
    ]
  },
  "OK.7.GM.4.2": {
    "description": "Apply proportions, ratios, and scale factors to solve problems involving scale drawings and determine side lengths and areas of similar triangles and rectangles.",
    "lessons": [
      "making-game-images",
      "transform-compose-images"
    ]
  },
  "OK.8.CS.D.01": {
    "description": "Develop and implement a process to evaluate existing computing devices and recommend improvements to design based on analysis of how other users interact with the device.",
    "lessons": []
  },
  "OK.6.CS.HS.01": {
    "description": "Identify ways that hardware and software are combined to collect and exchange data.",
    "lessons": []
  },
  "OK.7.CS.HS.01": {
    "description": "Evaluate and recommend improvements to software and hardware combinations used to collect and exchange data.",
    "lessons": []
  },
  "OK.8.CS.HS.01": {
    "description": "Design and refine projects that combine hardware and software components to collect and exchange data.",
    "lessons": []
  },
  "OK.6.CS.T.01": {
    "description": "Identify increasingly complex software and hardware problems with computing devices and their components.",
    "lessons": []
  },
  "OK.7.CS.T.01": {
    "description": "Identify and fix increasingly complex software and hardware problems with computing devices and their components.",
    "lessons": [
      "problem-decomposition"
    ]
  },
  "OK.8.CS.T.01": {
    "description": "Systematically identify, fix, and document increasingly complex software and hardware problems with computing devices and their components.",
    "lessons": [
      "problem-decomposition"
    ]
  },
  "OK.6.NI.NCO.01": {
    "description": "Model a simple protocol for transferring information using packets.",
    "lessons": []
  },
  "OK.7.NI.NCO.01": {
    "description": "Explain how a system responds when a packet is lost and the effect it has on the transferred information.",
    "lessons": []
  },
  "OK.8.NI.NCO.01": {
    "description": "Explain protocols and their importance to data transmission; model how packets are broken down into smaller pieces and how they are delivered.",
    "lessons": []
  },
  "OK.6.NI.C.01": {
    "description": "Identify existing cybersecurity concerns with the Internet and systems it uses.",
    "lessons": []
  },
  "OK.7.NI.C.01": {
    "description": "Explain how to protect electronic information, both physical (e.g. hard drive) and digital, identify cybersecurity concerns and options to address issues with the Internet and the systems it uses.",
    "lessons": []
  },
  "OK.8.NI.C.01": {
    "description": "Evaluate physical and digital procedures that could be implemented to protect electronic data/information; explain the impacts of hacking, ransomware, scams, fake scans, and ethical/legal concerns.",
    "lessons": []
  },
  "OK.6.NI.C.02": {
    "description": "Explain the importance of secured websites and describe how one method of encryption works.",
    "lessons": []
  },
  "OK.7.NI.C.02": {
    "description": "Identify and explain two or more methods of encryption used to ensure and secure the transmission of information.",
    "lessons": []
  },
  "OK.8.NI.C.02": {
    "description": "Compare the advantages and disadvantages of multiple methods of encryption to model the secure transmission of information.",
    "lessons": []
  },
  "OK.6.DA.S.01": {
    "description": "Identify how the same data can be represented in multiple ways.",
    "lessons": [
      "bar-and-pie-charts"
    ]
  },
  "OK.7.DA.S.01": {
    "description": "Create multiple representations of data.",
    "lessons": [
      "bar-and-pie-charts"
    ]
  },
  "OK.8.DA.S.01": {
    "description": "Analyze multiple methods of representing data and choose the most appropriate method for representing data.",
    "lessons": [
      "standard-deviation",
      "box-plots",
      "histograms-interpret",
      "histograms",
      "grouped-samples",
      "bar-and-pie-charts",
      "choosing-your-dataset"
    ]
  },
  "OK.6.DA.CVT.01": {
    "description": "Collect data using computational tools and transform the data to make it more useful.",
    "lessons": [
      "standard-deviation",
      "box-plots"
    ]
  },
  "OK.7.DA.CVT.01": {
    "description": "Collect data using computational tools and transform the data to make it more useful and reliable.",
    "lessons": [
      "standard-deviation",
      "box-plots"
    ]
  },
  "OK.8.DA.CVT.01": {
    "description": "Develop, implement, and refine a process that utilizes computational tools to collect and transform data to make it more useful and reliable.",
    "lessons": [
      "grouped-samples",
      "ds-intro"
    ]
  },
  "OK.6.DA.IM.01": {
    "description": "Use models and simulations to formulate, refine, and test hypotheses.",
    "lessons": []
  },
  "OK.7.DA.IM.01": {
    "description": "Discuss the correctness of a model representing a system by comparing the modelâ€™s generated results with observed data from the modeled system.",
    "lessons": []
  },
  "OK.8.DA.IM.01": {
    "description": "Refine computational models based on the data generated by the models.",
    "lessons": []
  },
  "OK.6.D.1.3": {
    "description": "Create and analyze box and whisker plots observing how each segment contains one quarter of the data.",
    "lessons": [
      "standard-deviation",
      "box-plots",
      "histograms-interpret",
      "histograms",
      "grouped-samples",
      "bar-and-pie-charts",
      "choosing-your-dataset"
    ]
  },
  "OK.7.D.1.2": {
    "description": "Use reasoning with proportions to display and interpret data in circle graphs (pie charts) and histograms. Choose the appropriate data display and know how to create the display using a spreadsheet or other graphing technology.",
    "lessons": [
      "standard-deviation",
      "box-plots",
      "histograms-interpret",
      "histograms",
      "grouped-samples",
      "bar-and-pie-charts",
      "choosing-your-dataset"
    ]
  },
  "OK.6.AP.A.01": {
    "description": "Use an existing algorithm in natural language or pseudocode to solve complex problems.",
    "lessons": [
      "functions-dr"
    ]
  },
  "OK.7.AP.A.01": {
    "description": "Select and modify an existing algorithm in natural language or pseudocode to solve complex problems.",
    "lessons": [
      "table-methods",
      "surface-area-rect-prism",
      "simple-data-types",
      "functions-dr"
    ]
  },
  "OK.8.AP.A.01": {
    "description": "Design algorithms in natural language, flow and control diagrams, comments within code, and/or pseudocode to solve complex problems.",
    "lessons": [
      "making-game-images",
      "functions-for-character-animation",
      "transform-compose-images",
      "functions-dr"
    ]
  },
  "OK.6.AP.C.01": {
    "description": "Develop programs that utilize combinations of repetition, conditionals, and the manipulation of variables representing different data types.",
    "lessons": [
      "inequalities3-sam"
    ]
  },
  "OK.7.AP.C.01": {
    "description": "Develop programs that utilize combinations of repetition, compound conditionals, and the manipulation of variables representing different data types.",
    "lessons": []
  },
  "OK.8.AP.C.01": {
    "description": "Develop programs that utilize combinations of nested repetition, compound conditionals, procedures without parameters, and the manipulation of variables representing different data types.",
    "lessons": [
      "simple-data-types"
    ]
  },
  "OK.6.AP.M.01": {
    "description": "Decompose problems into parts to facilitate the design, implementation, and review of programs.",
    "lessons": [
      "problem-decomposition",
      "inequalities3-sam",
      "inequalities-collision",
      "transform-compose-images"
    ]
  },
  "OK.7.AP.M.01": {
    "description": "Decompose problems into parts to facilitate the design, implementation, and review of increasingly complex programs.",
    "lessons": [
      "composing-table-operations",
      "problem-decomposition",
      "inequalities3-sam",
      "inequalities-collision"
    ]
  },
  "OK.8.AP.M.01": {
    "description": "Decompose problems and subproblems into parts to facilitate the design, implementation, and review of complex programs.",
    "lessons": [
      "composing-table-operations",
      "problem-decomposition",
      "inequalities3-sam",
      "inequalities-collision"
    ]
  },
  "OK.6.AP.PD.01": {
    "description": "Seek and incorporate feedback from team members to refine a solution to a problem.",
    "lessons": [
      "player-animation",
      "making-game-images",
      "inequalities-collision",
      "functions-for-character-animation",
      "transform-compose-images"
    ]
  },
  "OK.7.AP.PD.01": {
    "description": "Seek and incorporate feedback from team members and users to refine a solution to a problem.",
    "lessons": [
      "player-animation",
      "making-game-images",
      "inequalities-collision",
      "functions-for-character-animation"
    ]
  },
  "OK.8.AP.PD.01": {
    "description": "Seek and incorporate feedback from team members and users to refine a solution to a problem that meets the needs of diverse users.",
    "lessons": []
  },
  "OK.6.AP.PD.02": {
    "description": "Incorporate existing code, media, and libraries into original programs and give attribution.",
    "lessons": [
      "making-game-images"
    ]
  },
  "OK.7.AP.PD.02": {
    "description": "Incorporate existing code, media, and libraries into original programs of increasing complexity and give attribution.",
    "lessons": [
      "making-game-images"
    ]
  },
  "OK.8.AP.PD.02": {
    "description": "Incorporate existing code, media, and libraries into original programs of increasing complexity and give attribution.",
    "lessons": [
      "functions-make-life-easier"
    ]
  },
  "OK.6.AP.PD.03": {
    "description": "Test and refine programs using teacher provided inputs.",
    "lessons": []
  },
  "OK.7.AP.PD.03": {
    "description": "Test and refine programs using a variety of student created inputs.",
    "lessons": []
  },
  "OK.8.AP.PD.03": {
    "description": "Systematically test and refine programs using a range of student created inputs.",
    "lessons": []
  },
  "OK.6.AP.PD.04": {
    "description": "Break down tasks and follow an individual timeline when developing a computational artifact.",
    "lessons": [
      "probability-inference"
    ]
  },
  "OK.7.AP.PD.04": {
    "description": "Distribute tasks and maintain a project timeline when collaboratively developing computational artifacts.",
    "lessons": [
      "probability-inference"
    ]
  },
  "OK.8.AP.PD.04": {
    "description": "Explain how effective communication between participants is required for successful collaboration when developing computational artifacts.",
    "lessons": [
      "functions-dr"
    ]
  },
  "OK.6.AP.PD.05": {
    "description": "Document text-based programs in order to make them easier to follow, test, and debug.",
    "lessons": [
      "functions-dr"
    ]
  },
  "OK.7.AP.PD.05": {
    "description": "Document text-based programs of increasing complexity in order to make them easier to follow, test, and debug.",
    "lessons": [
      "functions-dr"
    ]
  },
  "OK.8.AP.PD.05": {
    "description": "Document text-based programs of increasing complexity in order to make them easier to follow, test, and debug.",
    "lessons": [
      "functions-dr"
    ]
  },
  "OK.6.IC.C.01": {
    "description": "Explain how computing impacts people's everyday activities.",
    "lessons": [
      "computing-needs-all-voices"
    ]
  },
  "OK.7.IC.C.01": {
    "description": "Explain how computing impacts innovation in other fields.",
    "lessons": []
  },
  "OK.8.IC.C.01": {
    "description": "Describe the trade-offs associated with computing technologies (e.g. automation), explaining their effects on economies and global societies, and explore careers related to the field of computer science.",
    "lessons": []
  },
  "OK.6.IC.C.02": {
    "description": "Identify and discuss the technology proficiencies needed in the classroom and the workplace, and how to meet the needs of diverse users.",
    "lessons": []
  },
  "OK.7.IC.C.02": {
    "description": "Relate the distribution of computing resources in a global society to issues of equity, access, and power.",
    "lessons": []
  },
  "OK.8.IC.C.02": {
    "description": "Evaluate and improve the design of existing technologies to meet the needs of diverse users and increase accessibility and usability. Evaluate how technology can be used to distort, exaggerate, and misrepresent information.",
    "lessons": []
  },
  "OK.6.IC.SI.01": {
    "description": "Individually and collaboratively develop and conduct an online survey that seeks input from a broad audience. Describe and use safe, appropriate, and responsible practices (netiquette) when participating in online communities (e.g., discussion groups, blogs, social networking sites).",
    "lessons": []
  },
  "OK.7.IC.SI.01": {
    "description": "Individually and collaboratively use advanced tools to design and create online content (e.g., digital portfolio, multimedia, blog, web page). Describe and use safe, appropriate, and responsible practices (netiquette) when participating in online communities (e.g., discussion groups, blogs, social networking sites).",
    "lessons": []
  },
  "OK.8.IC.SI.01": {
    "description": "Communicate and publish key ideas and details individually or collaboratively in a way that informs, persuades, and/or entertains using a variety of digital tools and media-rich resources. Describe and use safe, appropriate, and responsible practices (netiquette) when participating in online communities (e.g., discussion groups, blogs, social networking sites).",
    "lessons": [
      "threats-to-validity",
      "choosing-your-dataset"
    ]
  },
  "OK.6.IC.SLE.01": {
    "description": "Differentiate between appropriate and inappropriate content on the Internet, and identify unethical and illegal online behavior.",
    "lessons": []
  },
  "OK.7.IC.SLE.01": {
    "description": "Explain the connection between the longevity of data on the Internet, personal online identity, and personal privacy.",
    "lessons": []
  },
  "OK.8.IC.SLE.01": {
    "description": "Discuss the social impacts and ethical considerations associated with cybersecurity, including the positive and malicious purposes of hacking.",
    "lessons": []
  },
  "OK.L1.CS.D.01": {
    "description": "Explain how abstractions hide the underlying implementation details of computing systems embedded in everyday objects.",
    "lessons": [
      "game-design",
      "coordinates"
    ]
  },
  "OK.L1.CS.HS.01": {
    "description": "Explain the interactions between application software, system software, and hardware.",
    "lessons": []
  },
  "OK.L2.CS.HS.01": {
    "description": "Identify and categorize roles of an operating system.",
    "lessons": []
  },
  "OK.L1.CS.T.01": {
    "description": "Develop and apply criteria for systematic discovery of errors and systematic strategies for correction of errors in computing systems.",
    "lessons": [
      "debugging"
    ]
  },
  "OK.L2.CS.T.01": {
    "description": "Identify how hardware components facilitate logic, input, output, and storage in computing systems.",
    "lessons": []
  },
  "OK.L1.NI.NCO.01": {
    "description": "Evaluate the scalability and reliability of networks by identifying and illustrating the basic components of computer networks (e.g., routers, switches, servers, etc.) and network protocols (e.g., IP, DNS, etc.).",
    "lessons": []
  },
  "OK.L2.NI.NCO.01": {
    "description": "Describe the issues that impact network functionality (e.g., bandwidth, load, latency, topology).",
    "lessons": []
  },
  "OK.L1.NI.C.01": {
    "description": "Compare physical and cybersecurity measures by evaluating trade-offs between the usability and security of a computing system.",
    "lessons": []
  },
  "OK.L2.NI.C.01": {
    "description": "Compare and refine ways in which software developers protect devices and information from unauthorized access.",
    "lessons": []
  },
  "OK.L1.NI.C.02": {
    "description": "Illustrate how sensitive data can be affected by attacks.",
    "lessons": []
  },
  "OK.L1.NI.C.03": {
    "description": "Recommend security measures to address various scenarios based on information security principles.",
    "lessons": []
  },
  "OK.L1.NI.C.04": {
    "description": "Explain trade-offs when selecting and implementing cybersecurity recommendations from multiple perspectives such as the user, enterprise, and government.",
    "lessons": []
  },
  "OK.L1.DA.S.01": {
    "description": "Translate and compare different bit representations of data types, such as characters, numbers, and images.",
    "lessons": []
  },
  "OK.L1.DA.S.02": {
    "description": "Evaluate the trade-offs in how data is organized and stored digitally.",
    "lessons": []
  },
  "OK.L1.DA.CVT.01": {
    "description": "Use tools and techniques to locate, collect, and create visualizations of small- and largescale data sets (e.g., paper surveys and online data sets).",
    "lessons": [
      "choosing-your-dataset"
    ]
  },
  "OK.L2.DA.CVT.01": {
    "description": "Use data analysis tools and techniques to identify patterns from complex real-world data.",
    "lessons": [
      "linear-regression"
    ]
  },
  "OK.L2.DA.CVT.02": {
    "description": "Generate data sets that use a variety of data collection tools and analysis techniques to support a claim and/or communicate information.",
    "lessons": [
      "standard-deviation",
      "box-plots"
    ]
  },
  "OK.L1.DA.IM.01": {
    "description": "Show the relationships between collected data elements using computational models.",
    "lessons": [
      "scatter-plots",
      "linear-regression",
      "correlations"
    ]
  },
  "OK.L2.DA.IM.01": {
    "description": "Use models and simulations to help formulate, refine, and test scientific hypotheses.",
    "lessons": []
  },
  "OK.L1.AP.A.01": {
    "description": "Create a prototype that uses algorithms (e.g., searching, sorting, finding shortest distance) to provide a possible solution for a real-world problem.",
    "lessons": [
      "grouped-samples",
      "surface-area-rect-prism",
      "inequalities3-sam"
    ]
  },
  "OK.L2.AP.A.01": {
    "description": "Describe how artificial intelligence algorithms drive many software and physical systems (e.g., autonomous robots, computer vision, pattern recognition, text analysis).",
    "lessons": []
  },
  "OK.L2.AP.A.02": {
    "description": "Develop an artificial intelligence algorithm to play a game against a human opponent or solve a real world problem.",
    "lessons": []
  },
  "OK.L2.AP.A.03": {
    "description": "Critically examine and trace classic algorithms (e.g., selection sort, insertion sort, binary search, linear search).",
    "lessons": []
  },
  "OK.L2.AP.A.04": {
    "description": "Evaluate algorithms (e.g., sorting, searching) in terms of their efficiency and clarity.",
    "lessons": []
  },
  "OK.L1.AP.V.01": {
    "description": "Demonstrate the use of lists (e.g., arrays) to simplify solutions, generalizing computational problems instead of repeatedly using primitive variables.",
    "lessons": []
  },
  "OK.L2.AP.V.01": {
    "description": "Compare and contrast simple data structures and their uses (e.g., lists, stacks, queues).",
    "lessons": []
  },
  "OK.L1.AP.C.01": {
    "description": "Justify the selection of specific control structures (e.g., sequence, conditionals, repetition, procedures) considering program efficiencies such as readability, performance, and memory usage.",
    "lessons": []
  },
  "OK.L2.AP.C.01": {
    "description": "Trace the execution of repetition (e.g., loops, recursion), illustrating output and changes in values of named variables.",
    "lessons": []
  },
  "OK.L1.AP.M.01": {
    "description": "Break down a solution into procedures using systematic analysis and design.",
    "lessons": [
      "composing-table-operations",
      "advanced-visualizations",
      "defining-table-functions",
      "problem-decomposition",
      "piecewise-functions-conditionals"
    ]
  },
  "OK.L2.AP.M.01": {
    "description": "Construct solutions to problems using student-created components (e.g., procedures, modules, objects).",
    "lessons": []
  },
  "OK.L1.AP.M.02": {
    "description": "Create computational artifacts by systematically organizing, manipulating and/or processing data.",
    "lessons": [
      "table-methods",
      "composing-table-operations",
      "advanced-visualizations",
      "defining-table-functions",
      "piecewise-functions-conditionals"
    ]
  },
  "OK.L2.AP.M.02": {
    "description": "Design or redesign a solution to a large-scale computational problem by identifying generalizable patterns.",
    "lessons": []
  },
  "OK.L2.AP.M.03": {
    "description": "Create programming solutions by reusing existing code (e.g., libraries, Application Programming Interface (APIs), code repositories).",
    "lessons": [
      "table-methods",
      "inequalities3-sam"
    ]
  },
  "OK.L1.AP.PD.01": {
    "description": "Create software by analyzing a problem and/or process, developing and documenting a solution, testing outcomes, and adapting the program for a variety of users.",
    "lessons": []
  },
  "OK.L2.AP.PD.01": {
    "description": "Create software that will provide solutions to a variety of users using the software life cycle process.",
    "lessons": []
  },
  "OK.L1.AP.PD.02": {
    "description": "Define and classify a variety of software licensing schemes (e.g., open source, freeware, commercial) and discuss the advantages and disadvantages of each scheme in software development.",
    "lessons": []
  },
  "OK.L2.AP.PD.02": {
    "description": "Design software in a project team environment using integrated development environments (IDEs), versioning systems, and collaboration systems.",
    "lessons": []
  },
  "OK.L1.AP.PD.03": {
    "description": "While working in a team, develop, test, and refine event-based programs that solve practical problems or allow self expression.",
    "lessons": []
  },
  "OK.L2.AP.PD.03": {
    "description": "Develop programs for multiple computing platforms.",
    "lessons": [
      "functions-make-life-easier"
    ]
  },
  "OK.L1.AP.PD.04": {
    "description": "Using visual aids and documentation, illustrate the design elements and data flow (e.g., flowcharts, pseudocode) of the development of a complex program.",
    "lessons": []
  },
  "OK.L2.AP.PD.04": {
    "description": "Systematically check code for correctness, usability, readability, efficiency, portability, and scalability through peer review.",
    "lessons": []
  },
  "OK.L1.AP.PD.05": {
    "description": "Evaluate and refine computational artifacts to make them more user-friendly, efficient and/or accessible.",
    "lessons": [
      "histograms-interpret",
      "histograms"
    ]
  },
  "OK.L2.AP.PD.05": {
    "description": "Develop and use a series of test cases to verify that a program performs according to its design specifications.",
    "lessons": [
      "functions-dr"
    ]
  },
  "OK.L2.AP.PD.06": {
    "description": "Explain security issues that might lead to compromised computer programs.",
    "lessons": []
  },
  "OK.L2.AP.PD.07": {
    "description": "Modify an existing program to add additional functionality and discuss intended and unintended implications (e.g., breaking other functionality).",
    "lessons": [
      "player-animation"
    ]
  },
  "OK.L1.IC.C.01": {
    "description": "Evaluate the ways computing impacts personal, ethical, social, economic, and cultural practices.",
    "lessons": [
      "ethics-privacy-and-bias"
    ]
  },
  "OK.L2.IC.C.01": {
    "description": "Evaluate the beneficial and harmful effects that computational artifacts and innovations have on society.",
    "lessons": [
      "ethics-privacy-and-bias"
    ]
  },
  "OK.L1.IC.C.02": {
    "description": "Test and refine computational artifacts to reduce bias and equity deficits.",
    "lessons": [
      "threats-to-validity",
      "probability-inference",
      "grouped-samples",
      "choosing-your-dataset",
      "checking-your-work"
    ]
  },
  "OK.L2.IC.C.02": {
    "description": "Evaluate the impact of equity, access, and influence on the distribution of computing resources in a global society.",
    "lessons": []
  },
  "OK.L1.IC.C.03": {
    "description": "Demonstrate how a given algorithm applies to problems across disciplines.",
    "lessons": []
  },
  "OK.L2.IC.C.03": {
    "description": "Design and implement a study that evaluates or predicts how computation has revolutionized an aspect of our culture and how it might evolve (e.g., education, healthcare, art/entertainment, energy).",
    "lessons": []
  },
  "OK.L1.IC.SI.01": {
    "description": "Demonstrate how computing increases connectivity among people of various cultures.",
    "lessons": []
  },
  "OK.L1.IC.SLE.01": {
    "description": "Explain the beneficial and harmful effects that intellectual property laws can have on innovation.",
    "lessons": []
  },
  "OK.L2.IC.SLE.01": {
    "description": "Debate laws and regulations that impact the development and use of software.",
    "lessons": [
      "ethics-privacy-and-bias"
    ]
  },
  "OK.L1.IC.SLE.02": {
    "description": "Explain the privacy concerns related to the large-scale collection and analysis of information about individuals (e.g., how businesses, social media, and the government collects and uses data) that may not be evident to users.",
    "lessons": [
      "ethics-privacy-and-bias"
    ]
  },
  "OK.L1.IC.SLE.03": {
    "description": "Evaluate the social and economic consequences of how law and ethics interact with digital aspects of privacy, data, property, information, and identity.",
    "lessons": [
      "ethics-privacy-and-bias"
    ]
  },
  "OK.SP.1.5": {
    "description": "Use counting techniques including permutations and combinations to solve mathematical and real-world problems, including determining probabilities of compound events. ",
    "lessons": [
      "combinatorics-combination",
      "combinatorics-permutation"
    ]
  }
}
