{
  "quadratics-graph": {
    "text": "Graph quadratic functions and show intercepts, maxima, and minima.",
    "standards": ["HSF.IF.C.7.A"],
    "assessment-rec" : []
  },
  "quadratics-growth": {
    "text": "Identify quadratic sequences of numbers by the fact that the difference between terms always changes by the same amount.",
    "standards": "",
    "assessment-rec": []
  },
  "quadratic-situations" : {
    "text": "Identify situations than can be modeled by a quadratic relationship.",
    "standards": [],
    "assessment-rec": []
  },
  "quadratics-forms": {
    "text": "Express quadratic equations in standard, factored, and vertex forms and convert between these forms.",
    "standards": [],
    "assessment-rec": []
  },
  "exponentials-graph": {
    "text": "Graph exponential functions, showing intercepts and asymptotes.",
    "standards": ["HSF.IF.C.7.E"],
    "assessment-rec" : []
  },
  "exponentials-growth": {
    "text": "Identify exponential sequences of numbers by the fact that the difference between terms always changes by a constant factor.",
    "standards": ["HSF.IF.C.8.B","HSF.LE.A.3"],
    "assessment-rec": []
  },
  "exponential-situations" : {
    "text": "Identify situations than can be modeled by an exponential relationship.",
    "standards": [],
    "assessment-rec": ["HSF.LE.A.1","HSF.LE.A.1.C"]
  },
  "logarithms-graph": {
    "text": "Graph logarithmic functions, showing intercepts and asymptotes.",
    "standards": ["HSF.IF.C.7.E"],
    "assessment-rec" : []
  },
  "logarithms-growth": {
    "text": "Identify logarithmic sequences of numbers by the fact that the _index_ of a term must change by constant factor in order for the term to grow linearly.",
    "standards": ["HSF.LE.A.4"],
    "assessment-rec": []
  },
  "logarithms-situations" : {
    "text": "Identify situations than can be modeled by a logarithmic relationship.",
    "standards": [],
    "assessment-rec": []
  },
  "logarithms-exponents": {
    "text": "Understand the inverse relationship between exponents and logarithms and use this relationship to solve problems involving logarithms and exponents.",
    "standards": ["HSF.BF.B.5"],
    "assessment-rec": []
  },
  "periodic-unit-circle": {
    "text": "Explain the relationship between the angle θ and the (x,y) values of a point rotating around a unit circle",
    "standards": ["HSF.TF.A.1", "HSF.TF.A.2"],
    "assessment-rec": []
  },
  "periodic-growth": {
    "text": "Identify periodic sequences of numbers by the fact that they rise and fall smoothly in consistent patterns over consistent intervals.",
    "standards": "",
    "assessment-rec": []
  },
  "periodic-graph": {
    "text": "Graph sin and cos functions, showing horizontal and vertical shifts, midlines, peaks, troughs, amplitude and frequency.",
    "standards": ["HSF.IF.C.7.E"],
    "assessment-rec" : []
  },
  "periodic-situations" : {
    "text": "Identify situations than can be modeled by a periodic relationship.",
    "standards": [],
    "assessment-rec": []
  }
}
