{
  "example-learning-objective": {
    "text": "Prose we want to show up in the lesson.",
    "standards": ["std1", "std2"],
    "assessment-rec": "author notes about how it might be assessed"
  },
   "table-build-column" : {
    "text": "Add a column to a table.",
    "standards": [""],
    "assessment-rec": "Give students a starter-file with a table and have them add a column" 
  },
   "table-filter" : {
    "text": "Filter a table using a Boolean-producing function.",
    "standards": [""],
    "assessment-rec": "Give students a starter-file with a table and have them filter it." 
  },
  "stdev-understand" : {
    "text": "Use standard deviation to make judgments about data, and understand the role it plays in those judgements.",
    "standards": ["HSS.ID.A.2"],
    "assessment-rec": "Compare two datasets, their means and stdevs, and a conclusion that ignores the stdev. Ask students why the conclusion is wrong"
  },
  "stdev-calc" : {
    "text": "Calculate the standard deviation of a dataset.",
    "standards": ["HSS.ID.A.2"],
    "assessment-rec": "Give students a dataset, have them calculate the stdev"
  },
  "boxplot-create" : {
    "text": "Compute the 5-number summary and draw the box plot for a given dataset.",
    "standards": ["6.SP.B.4","HSS.ID.A.1"],
    "assessment-rec": "Give students a dataset, have them calculate the 5-number summary and draw a box plot"
  },
  "spread-transfer" : {
    "text": "Compare and contrast information displayed in a box plot and a histogram, identifying that box plots have variable intervals and histograms have fixed bins.",
    "standards": ["6.SP.B.4","HSS.ID.A.1"],
    "assessment-rec": "Have students match box plots to histograms"
  },
  "histograms-pyret": {
    "text":"Create histograms from a dataset in Pyret.",
    "standards": [""],
    "assessment-rec": ""
  },
   "random-sample-pyret": {
    "text":"Use Pyret to generate differently sized random samples from a dataset.",
    "standards": [""],
    "assessment-rec": ""
  },
  "measures-of-center-pyret":{
    "text":"Compute measures of center including mean, median and mode(s) of a dataset in Pyret.",
    "standards": [""],
    "assessment-rec": ""
  },
  "measures-of-spread-pyret":{
    "text":"Compute measures of spread of a dataset including range and IQR in Pyret.",
    "standards": [""],
    "assessment-rec": ""
  },
  "categorical-displays-pyret":{
    "text":"Create categorical displays from a single column of a dataset in Pyret (i.e. pie charts, bar charts).",
    "standards": [""],
    "assessment-rec": ""
  },
  "compound-categorical-displays-pyret":{
    "text":"Create categorical displays from two columns of a dataset in Pyret (i.e. multi-bar charts, stacked-bar charts).",
    "standards": [""],
    "assessment-rec": ""
  },
  "pros-cons-bar-pie": {
    "text":"Recognize that while pie charts and bar charts both display the counts of categorical data, consideration should be given to which is a more useful display for a given situation.",
    "standards": [""],
    "assessment-rec": ""
  },
  "interpret-bar": {
    "text":"Interpret bar charts to answer statistical questions about a dataset.",
    "standards": [""],
    "assessment-rec": ""
  },
  "interpret-pie": {
    "text":"Interpret pie charts to answer statistical questions about a dataset.",
    "standards": [""],
    "assessment-rec": ""
  },
  "interpret-stacked-bar": {
    "text":"Interpret stacked bar charts to answer statistical questions about a dataset.",
    "standards": [""],
    "assessment-rec": ""
  },
  "interpret-multi-bar": {
    "text":"Interpret multi-bar charts to answer statistical questions about a dataset.",
    "standards": [""],
    "assessment-rec": ""
  },
  "sensible-grouped-samples": {
    "text":"Identify sensible grouped samples for a dataset.",
    "standards": [""],
    "assessment-rec": ""
  },
  "develop-statistical-question": {
    "text":"Develop a statistical research question about a real-world dataset.",
    "standards": [""],
    "assessment-rec": ""
  },
  "cat-v-quant-def": {
    "text":"Explain the difference between Categorical and Quantitative data, recognizing that Quantitative data measures an amount while Categorical data is used to qualify.",
    "standards": [""],
    "assessment-rec": ""
  },
  "cat-v-quant-variable": {
    "text":"Identify whether a variable in a dataset is Categorical or Quantitative by considering whether the data tells us \"what kind?\" or \"how much?\"",
    "standards": [""],
    "assessment-rec": ""
  },


  "use-contracts": {
    "text":"Use contracts to write expressions that will produce one-variable displays in Pyret (pie charts, bar charts, histograms, and box plots).",
    "standards": [""],
    "assessment-rec": ""
  },
  "read-contracts": {
    "text":"Make sense of functions in @proglang by interpreting their contracts.",
    "standards": [""],
    "assessment-rec": ""
  },
  "infographic-ratios": {
    "text":"Assess whether various infographics effectively incorporate ratios and proportions by considering the infographic's impact.",
    "standards": [""],
    "assessment-rec": ""
  },
  "infographic-stereotypes": {
    "text":"Avoid stereotyping when creating an infographic in order to help viewers relate to and understand the topic.",
    "standards": [""],
    "assessment-rec": ""
  },
  "data-cycle-parts": {
    "text":"Describe the four parts of the Data Cycle, including: (1) ask questions, (2) consider the data, (3) analyze the data, and (4) interpret the data.",
    "standards": [""],
    "assessment-rec": ""
  },
  "stat-inference": {
    "text":"Explain how statistical inference uses information from a sample (e.g., probability) to draw conclusions about the larger population from which the sample was taken.",
    "standards": [""],
    "assessment-rec": ""
  },
  "sample-size": {
    "text":"Describe the role of sample size, recognizing that larger samples generally yield better estimates of what's true for a population.",
    "standards": [""],
    "assessment-rec": ""
  },
    "random-sample-bias": {
    "text":"Describe how random sampling can help us avoid bias in our analysis.",
    "standards": [""],
    "assessment-rec": ""
  },
  "describe-data-cycle": {
    "text":"Describe the four parts of the Data Cycle, including: (1) ask questions, (2) consider the data, (3) analyze the data, and (4) interpret the data.",
    "standards": [""],
    "assessment-rec": ""
  },
  "rows-and-columns": {
    "text":"Identify the specific Rows and Columns needed to answer various questions.",
    "standards": [""],
    "assessment-rec": ""
  },
  "describe-dataset": {
    "text":"Describe a dataset by discussing its source, structure, and relevance.",
    "standards": [""],
    "assessment-rec": ""
  },
  "define-subsets": {
    "text":"Define tables of differently sized subsets from a dataset in Pyret.",
    "standards": [""],
    "assessment-rec": ""
  },
  "explanatory-response": {
    "text":" Differentiate between an explanatory variable and a response variable, recognizing that the response variable (plotted on the y-axis) responds to the explanatory variable (plotted on the x-axis).",
    "standards": [""],
    "assessment-rec": ""
  },
  "scatter-plots-by-hand": {
    "text":"Make scatter plots by hand given a list of (x,y) pairs",
    "standards": [""],
    "assessment-rec": ""
  },
  "scatter-plots-pyret": {
    "text":"Make scatter plots in Pyret",
    "standards": [""],
    "assessment-rec": ""
  },
  "trends-in-scatter-plots": {
    "text":"Identify possible trends in scatter-plots by exploring relationships between columns.",
    "standards": [""],
    "assessment-rec": ""
  },
  "unusual-observations": {
    "text":"Understand that unusual observations are always worth thinking about: sometimes they are random, sometimes they provide deeper insight, and sometimes are the points we are looking for.",
    "standards": [""],
    "assessment-rec": ""
  }
}