{
  "example-learning-objective": { 
    "text": "Prose we want to show up in the lesson.",
    "standards": ["std1", "std2"],
    "assessment-rec": "author notes about how it might be assessed."
  },
  "cat-v-quant-def": {
    "text":"Explain the difference between Categorical and Quantitative data, recognizing that Quantitative data measures an amount while Categorical data is used to qualify.",
    "standards": [""],
    "assessment-rec": ""
  },
  "cat-v-quant-variable": {
    "text":"Identify whether a variable in a dataset is Categorical or Quantitative by considering whether the data tells us \"what kind?\" or \"how much?\".",
    "standards": [""],
    "assessment-rec": ""
  },
  "pros-cons-bar-pie": {
    "text":"Recognize that while pie charts and bar charts both display the counts of categorical data, consideration should be given to which is a more useful display for a given situation.",
    "standards": [""],
    "assessment-rec": ""
  },
  "interpret-bar": {
    "text":"Interpret bar charts to answer statistical questions about a dataset.",
    "standards": [""],
    "assessment-rec": ""
  },
  "interpret-pie": {
    "text":"Interpret pie charts to answer statistical questions about a dataset.",
    "standards": [""],
    "assessment-rec": ""
  },
  "interpret-stacked-bar": {
    "text":"Interpret stacked bar charts to answer statistical questions about a dataset.",
    "standards": [""],
    "assessment-rec": ""
  },
  "interpret-multi-bar": {
    "text":"Interpret multi-bar charts to answer statistical questions about a dataset.",
    "standards": [""],
    "assessment-rec": ""
  },
  "describe-data-cycle": {
    "text":"Describe the four parts of the Data Cycle, including: (1) ask questions, (2) consider the data, (3) analyze the data, and (4) interpret the data.",
    "standards": [""],
    "assessment-rec": ""
  },
  "develop-statistical-question": {
    "text":"Develop a statistical research question about a real-world dataset.",
    "standards": [""],
    "assessment-rec": ""
  },
  "stat-inference": {
    "text":"Explain how statistical inference uses information from a sample (e.g., probability) to draw conclusions about the larger population from which the sample was taken.",
    "standards": [""],
    "assessment-rec": ""
  },
  "sample-size": {
    "text":"Describe the role of sample size, recognizing that larger samples generally yield better estimates of what's true for a population.",
    "standards": [""],
    "assessment-rec": ""
  },
  "random-sample-bias": {
    "text":"Describe how random sampling can help us avoid bias in our analysis.",
    "standards": [""],
    "assessment-rec": ""
  },
  "sensible-grouped-samples": {
    "text":"Identify sensible grouped samples for a dataset.",
    "standards": [""],
    "assessment-rec": ""
  },
  "infographic-ratios": {
    "text":"Assess whether various infographics effectively incorporate ratios and proportions by considering the infographic's impact.",
    "standards": [""],
    "assessment-rec": ""
  },
  "infographic-stereotypes": {
    "text":"Avoid stereotyping when creating an infographic in order to help viewers relate to and understand the topic.",
    "standards": [""],
    "assessment-rec": ""
  },
  "rows-and-columns": {
    "text":"Identify the specific Rows and Columns needed to answer various questions.",
    "standards": [""],
    "assessment-rec": ""
  },
  "describe-dataset": {
    "text":"Describe a dataset by discussing its source, structure, and relevance.",
    "standards": [""],
    "assessment-rec": ""
  },
  "define-subsets": {
    "text":"Define tables of differently sized subsets from a dataset in Pyret.",
    "standards": [""],
    "assessment-rec": ""
  },
  "explanatory-response": {
    "text":" Differentiate between an explanatory variable and a response variable, recognizing that the response variable (plotted on the y-axis) responds to the explanatory variable (plotted on the x-axis).",
    "standards": [""],
    "assessment-rec": ""
  },
  "scatter-plots-by-hand": {
    "text":"Make scatter plots by hand given a list of (x,y) pairs.",
    "standards": [""],
    "assessment-rec": ""
  },
  "scatter-plots-proglang": {
    "text":"Make scatter plots in @proglang.",
    "standards": [""],
    "assessment-rec": ""
  },
  "trends-in-scatter-plots": {
    "text":"Identify possible trends in scatter-plots by exploring relationships between columns.",
    "standards": [""],
    "assessment-rec": ""
  },
  "unusual-observations": {
    "text":"Understand that unusual observations are always worth thinking about: sometimes they are random, sometimes they provide deeper insight, and sometimes are the points we are looking for.",
    "standards": [""],
    "assessment-rec": ""
  },
  "visual-cues": {
    "text":"Explain how visual cues can enhance a display by making it more meaningful, accessible, or exciting.",
    "standards": [""],
    "assessment-rec": ""
  },
  "order-matters": {
    "text":" Understand that composing table operations in a particular order (build, filter, sort) is required to avoid crashing the program or producing nonsensical results.",
    "standards": [""],
    "assessment-rec": ""
  },
  "diagram-composition": {
    "text":"  Diagram function composition to make sense of the order in which table operations must be performed.",
    "standards": [""],
    "assessment-rec": ""
  },
  "compose-table-ops": {
    "text":"Compose table operations to conduct more sophisticated analyses.",
    "standards": [""],
    "assessment-rec": ""
  },
  "make-dot-plots": {
    "text": "Make dot plots by hand to display the frequency of values in quantitative data.",
    "standards": [""],
    "assessment-rec": ""
  },
  "dot-plot-features": {
    "text": "Describe the distribution of data in a dot plot by identifying peaks, clusters, gaps, outliers, and typicality.",
    "standards": [""],
    "assessment-rec": ""
  },
  "variability-define": {
    "text": "Define the variability of a categorical dataset as how different or alike data points are.",
    "standards": [""],
    "assessment-rec": ""
  },
  "variability-describe": {
    "text": "Describe the variability of a data in a dot plot, recognizing that increased variability results in a wider spread while decreased variability results in a more narrow spread.",
    "standards": [""],
    "assessment-rec": ""
  },
  "dot-plot-v-histogram": {
    "text": "Compare and contrast dot plots and histograms, recognizing that: (1) both display the frequency and distribution of quantitative data, and (2) dot plots display the frequency of individual values while histograms display the frequency of groups of values.",
    "standards": [""],
    "assessment-rec": "match dot plots and histograms; evaluate merits of each."
  },
  "best-measure-of-center":{
    "text":"Determine which measure of center – mean, median, or mode – best summarizes a dataset.",
    "standards": [""],
    "assessment-rec": ""
  },
  "histograms-and-measures-of-center":{
    "text":"Draw conclusions about the mean, median, and mode of a dataset by represented by a histogram.",
    "standards": [""],
    "assessment-rec": ""
  },
  "peaks-clusters-gaps": {
    "text": "Describe the distribution of data in a histogram by identifying peaks, clusters, gaps, and outliers in histograms.",
    "standards": [""],
    "assessment-rec": ""
  },
  "histogram-skew-or-symmetric": {
    "text": "Identify a histogram's shape as skewed right, skewed left, or symmetric.",
    "standards": [""],
    "assessment-rec": ""
  },
  "bar-chart-v-histogram": {
    "text": "Understand that bar charts display the frequency of categorical data while histograms show the frequency and distribution of quantitative data.",
    "standards": [""],
    "assessment-rec": "use enrollment-by-college question from Whitaker & Jacobbe, 2017."
  },
  "histogram-shape": {
    "text": "Use a histogram's shape to draw conclusions about quantitative data.",
    "standards": [""],
    "assessment-rec": "update Joy's What Shape Makes Sense, make it required."
  },
  "choosing-bin-size": {
    "text": "Recognize that changing a histogram's bin size impacts the histogram's shape and can affect what we learn about the distribution of the data.",
    "standards": [""],
    "assessment-rec": ""
  },
   "make-histograms": {
    "text": "Make histograms by hand and in @proglang to represent a quantitative dataset.",
    "standards": [""],
    "assessment-rec": ""
  },
  "histogram-center-spread": {
    "text": "Make claims about the center and spread of a histogram.",
    "standards": [""],
    "assessment-rec": ""
  },
  "histogram-variability": {
    "text": "Assess the level of variability displayed by a histogram.",
    "standards": [""],
    "assessment-rec": ""
  }, 
  "histograms-by-hand": {
    "text": "Make histograms by hand to represent a quantitative dataset.",
    "standards": [""],
    "assessment-rec": ""
  }, 
  "boxplot-create" : {
    "text": "Compute the 5-number summary and draw the box plot for a given dataset.",
    "standards": ["6.SP.B.4","HSS.ID.A.1"],
    "assessment-rec": "Give students a dataset, have them calculate the 5-number summary and draw a box plot."
  },
  "spread-transfer" : {
    "text": "Compare and contrast information displayed in a box plot and a histogram, identifying that box plots have variable intervals and histograms have fixed bins.",
    "standards": ["6.SP.B.4","HSS.ID.A.1"],
    "assessment-rec": "Have students match box plots to histograms."
  },
   "stdev-understand" : {
    "text": "Use standard deviation to make judgments about data, and understand the role it plays in those judgements.",
    "standards": ["HSS.ID.A.2"],
    "assessment-rec": "Compare two datasets, their means and stdevs, and a conclusion that ignores the stdev. Ask students why the conclusion is wrong."
  },
  "stdev-calc" : {
    "text": "Calculate the standard deviation of a dataset.",
    "standards": ["HSS.ID.A.2"],
    "assessment-rec": "Give students a dataset, have them calculate the stdev."
  },
  "form": {
    "text":"Determine whether a scatter plot's form seems to be linear, nonlinear, or have no relationship at all.",
    "standards": [""],
    "assessment-rec": ""
  },
  "direction": {
    "text":"Determine whether a scatter plot's direction is positive, negative, or neither.",
    "standards": [""],
    "assessment-rec": ""
  },
  "strength": {
    "text":"Determine whether a scatter plot's strength is strong (knowing the x-value of a point gives us a good idea of what the y-value) or weak (knowing the x-value tells us little about y-value).",
    "standards": [""],
    "assessment-rec": ""
  },
  "linear-regression": {
    "text":"Determine line-of-best-fit using linear regression, use regression lines to make predictions, and use model-fit statistics to assess the reliability of those predictions.",
    "standards": ["OK.A1.D.1.2", "OK.A2.D.1.2", "OK.A2.D.1.3", "8.SP.A.2", "8.SP.A.3"],
    "assessment-rec": ""
  },
  "threats-demonstrate": {
    "text":"Demonstrate how various threats to validity can impact the validity of conclusions drawn when research is conducted.",
    "standards": [""],
    "assessment-rec": ""
  },
  "misuse-identify": {
    "text":"Identify the misuse of statistics in a variety of scenarios and explain how it can result in distortion of the data and false claims.",
    "standards": [""],
    "assessment-rec": ""
  },
  "outlier-impact": {
    "text":"Recognize that the decision of whether or not to keep an outlier can have a profound impact on validity.",
    "standards": [""],
    "assessment-rec": ""
  },
   "when-subsets-make-sense": {
    "text":"Understand that when there is variability between subsets in a column of data it might not make sense to look for trends in the whole.",
    "standards": [""],
    "assessment-rec": ""
  },
  "use-contracts": {
    "text":"Use contracts to write expressions that will produce one-variable visualizations in @proglang (pie charts, bar charts, histograms, and box plots).",
    "standards": [""],
    "assessment-rec": ""
  },
  "read-contracts": {
    "text":"Make sense of functions in @proglang by interpreting their contracts.",
    "standards": [""],
    "assessment-rec": ""
  },
   "table-build-column" : {
    "text": "Add a column to a table.",
    "standards": [""],
    "assessment-rec": "Give students a starter-file with a table and have them add a column" 
  },
   "table-filter" : {
    "text": "Filter a table using a Boolean-producing function.",
    "standards": [""],
    "assessment-rec": "Give students a starter-file with a table and have them filter it." 
  },
  "random-sample-pyret": {
    "text":"Use Pyret to generate differently sized random samples from a dataset.",
    "standards": [""],
    "assessment-rec": ""
  },
  "measures-of-center-proglang":{
    "text":"Compute measures of center including mean, median and mode(s) of a dataset in @proglang.",
    "standards": [""],
    "assessment-rec": ""
  },
  "measures-of-spread-proglang":{
    "text":"Compute measures of spread of a dataset including range and IQR in @proglang.",
    "standards": [""],
    "assessment-rec": ""
  },
  "histograms-proglang": {
    "text": "Make histograms in proglang to represent a quantitative dataset.",
    "standards": [""],
    "assessment-rec": ""
  },
    "categorical-visualizations-proglang":{
    "text":"Create categorical visualizations from a single column of a dataset in @proglang (i.e. pie charts, bar charts).",
    "standards": [""],
    "assessment-rec": ""
  },
  "compound-categorical-visualizations-proglang":{
    "text":"Create categorical visualizations from two columns of a dataset in @proglang (i.e. multi-bar charts, stacked-bar charts).",
    "standards": [""],
    "assessment-rec": ""
  },
   "advanced-display-pyret": {
    "text":"Create an advanced display in Pyret to present information about an additional variable that would otherwise not be considered.",
    "standards": [""],
    "assessment-rec": ""
  },
   "develop-survey": {
    "text":"Develop a survey that avoids data-hygiene problems such as missing data, inconsistent types, inconsistent units, and inconsistent naming.",
    "standards": [""],
    "assessment-rec": ""
  },
   "response-validation": {
    "text":"Use response validation in Google Forms, including Required Questions, Question Format, Descriptive Instructions, and Specify Parameters.",
    "standards": [""],
    "assessment-rec": ""
  },
   "id-hygiene-probs": {
    "text":"Identify different data hygiene problems that can compromise analysis (i.e., variations in spelling and capitalization, typos, etc).",
    "standards": [""],
    "assessment-rec": ""
  },
  "import-data": {
    "text":"Import data from a Google Sheet into @proglang.",
    "standards": [""],
    "assessment-rec": ""
  },
  "five-num-summary-compute": {
    "text": "Compute the values in the five-number summary for a dataset (minimum, Q1, median, Q3, and maximum).",
    "standards": [""],
    "assessment-rec": ""
  },
  "five-num-summary-interpret": {
    "text": "Interpret the values in the five-number summary for a dataset (minimum, Q1, median, Q3, and maximum).",
    "standards": [""],
    "assessment-rec": ""
  },
  "box-plot-create": {
    "text": "Create a box plot from a five-number summary.",
    "standards": [""],
    "assessment-rec": ""
  },
  "box-plot-proglang": {
    "text": "Create a box plot in @proglang.",
    "standards": [""],
    "assessment-rec": ""
  },
  "box-plot-interpret": {
    "text": "Interpret a box plot to answer questions about a dataset and its spread.",
    "standards": [""],
    "assessment-rec": ""
  },
  "box-plot-shape": {
    "text": "Describe box plot shape including skew, symmetry and potential outliers.",
    "standards": [""],
    "assessment-rec": ""
  },
  "box-plot-histogram": {
    "text": "Recognize the shape of various distributions, and identify that shape in box plots and histograms.",
    "standards": [""],
    "assessment-rec": ""
  },
  "direction-strength": {
    "text": "Identify the apparent direction and strength of a relationship from a scatter plot.",
    "standards": [""],
    "assessment-rec": ""
  },
  "r-value": {
    "text": "Recognize that r-value represents the relationship between an independent and dependent variable; it ranges from -1 (perfect negative correlation) to +1 (perfect positive correlation).",
    "standards": [""],
    "assessment-rec": ""
  },
  "predict-values": {
    "text": "Use a predictor function to predict values that are not included in the dataset.",
    "standards": [""],
    "assessment-rec": ""
  },
  "write-about-lr": {
    "text": "Summarize what can be learned about a dataset from the results of linear regression, using proper statistical terminology.",
    "standards": [""],
    "assessment-rec": ""
  }
}


