{
  "sunset1.gif": {
    "description": "A simple sunset, with a yellow circle in the top-left corner and a brown rectangle along the bottom",
    "source" : "Created by the Bootstrap Team",
    "license" : "Creative Commons 4.0 - NC - SA"
  },
  "sunset2.png": {
    "description": "Two frames of the sunset animation, side by side. Both have a yellow circle in the top-left corner and a brown rectangle along the bottom. In the second frame, the sun has moved slightly lower and to the right.",
    "source" : "Created by the Bootstrap Team",
    "license" : "Creative Commons 4.0 - NC - SA"
  },
  "sunset3.png": {
    "description": "Three frames of the sunset animation, side by side with the data structure for each underneath. The structures all have two fields: the x and y coordinate of the sun. In each frame of the animation the x and y get slightly bigger, and the corresponding frame shows the sun inching down and to the right. After each frame, the on-tick event fires, the next-state-tick function updates the data structure accordingly, the to-draw event fires and the draw-state function generates the next frame.",
    "source" : "Created by the Bootstrap Team",
    "license" : "Creative Commons 4.0 - NC - SA"
  },
  "cowjump.gif": {
    "description": "A running animation of a cow moving from left-to-right, jumping up when it passes over the moon.",
    "source" : "Created by the Bootstrap Team",
    "license" : "Creative Commons 4.0 - NC - SA"
  },
  "cycling.gif": {
    "description": "A running animation of a bicycle moving from left-to-right, with its wheels spinning as it moves.",
    "source" : "Created by the Bootstrap Team",
    "license" : "Creative Commons 4.0 - NC - SA"
  },
  "pulsingstar.gif": {
    "description": "A running animation of a star moving from left-to-right, pulsing bigger and smaller as it moves.",
    "source" : "Created by the Bootstrap Team",
    "license" : "Creative Commons 4.0 - NC - SA"
  },
  "dimmer.gif": {
    "description": "A running animation of a dimmer switch, which changes the brightness of a light as it moves up and down.",
    "source" : "Created by the Bootstrap Team",
    "license" : "Creative Commons 4.0 - NC - SA"
  },
  "rect.svg": {
    "description": "An empty rectangle, in which to draw a frame from your running program",
    "source" : "Created by the Bootstrap Team",
    "license" : "Creative Commons 4.0 - NC - SA"    
  }
}
