{
  "questions.png" : {
    "description" : "A collection of thought bubbles with question marks",
    "source" : "Created by the Bootstrap Team",
    "license" : "Creative Commons 4.0 - NC - SA"
  },
  "wealth-v-life.png" : {
    "description" : "A scatter plot showing median life expectancy v. per-capita income of 192 countries. The point cloud rises rapidly at first, before flattening out",
    "source" : "Created by the Bootstrap Team",
    "license" : "Creative Commons 4.0 - NC - SA"
  },
  "wealth-v-life-linear.png" : {
    "description" : "An LR plot showing median life expectancy v. per-capita income of 192 countries. The point cloud rises rapidly at first, before flattening out. The linear model has only a moderate fit (R^2=0.413)",
    "source" : "Created by the Bootstrap Team",
    "license" : "Creative Commons 4.0 - NC - SA"
  },
  "wealth-v-life-transformed.png" : {
    "description" : "An scatter plot showing median life expectancy v. log of per-capita income of 192 countries. The point cloud goes up linearly as log-income increases",
    "source" : "Created by the Bootstrap Team",
    "license" : "Creative Commons 4.0 - NC - SA"
  },
  "wealth-v-life-transformed-linear.png" : {
    "description" : "An LR plot showing median life expectancy v. per-capita income of 192 countries. The point cloud rises rapidly at first, before flattening out. The linear model has a slope of 5.169, and y-intercept of 24.264, with a good fit (R^2=0.663)",
    "source" : "Created by the Bootstrap Team",
    "license" : "Creative Commons 4.0 - NC - SA"
  },
  "wealth-v-life-log.png" : {
    "description" : "An scatter plot showing median life expectancy v. per-capita income of 192 countries. A logarithmic model with a coefficient of 5.169 and a y-intercept of 24.264 is fit to the plot, and fits well (R^2=0.663)",
    "source" : "Created by the Bootstrap Team",
    "license" : "Creative Commons 4.0 - NC - SA"
  },
  "graph-settings.png" : {
    "description" : "A modified screenshot of the graph settings panel from Desmos, highlighting relevant buttons",
    "source" : "Created in Desmos by the Bootstrap Team",
    "license" : "Creative Commons 4.0 - NC - SA"
  }
}
